[{"id":"demi-god-zhū-gě-liàng-神诸葛亮","name":"Demi-God Zhū Gě Liàng 神诸葛亮","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcCLo34MDlEqhpWDMCwKlG70Z43RSyLf-_y2uJGIy067RtDrkHk5xFve44bxGxJs_XB7GIYTSefYHQFabgi2i3zOZX0pWWvUutM_URUJcBhtZjYJmIFzAF07T1ZC2VG_rvE8uKwFlHHAn_/s320/shenzhuge.jpg","text":"\n\n\nTranslated description:\n\"The Sorcerer at the Red Cliffs 赤壁的妖术师 (chì bì dè yāo shù shī)\"\n\nWhy is he a Demi-God:\nIn an act of mischief, Zhu Ge Liang decides to fool Zhou Yu 周瑜 into thinking he has the ability to control the weather. At an elaborately set up altar, Zhu Ge Liang performs a mysterious rite that he says will help change the wind direction, which was necessary in order for their fire strategy to work against the ships of Cao Cao 曹操. True enough, by that night the wind directions turn 180 degrees, finally putting in place the final gear in the machine that would be Cao Cao's terrible defeat. Everyone is fooled by Zhu Ge Liang, who absolutely cannot control the weather at all. He simply knew how to read the stars to foretell the weather. Easy peasy! All those meteorologists with their high-tech doppler radars should be ashamed of themselves!\n\n\nCharacter ability 1: \"The Seven Stars 七星 (qī xīng)\"\nAt the very beginning of the game, when the initial 4 cards are being distributed amongst all players, you will be given a total of 11 cards. Pick 4 out of these 11 to be your starting hand, while the remaining cards are placed face down elsewhere (out of the game area). These extra cards will be referred to as \"Stars\". During your turn, right after the drawing phase, you can interchange any number of your on-hand cards with an identical number of your Stars.\n\nCharacter ability 2: \"Strong Gale 狂风 (kuáng fēng)\"\nAt the end of your turn, you can discard 1 of your \"Stars\" and select 1 target player. From then till your next turn, this target player will suffer 1 additional unit of damage for all fire attribute damage.\n\nCharacter ability 3: \"Heavy Shroud 大雾 (dà wù)\"\nAt the end of your turn, you can discard X number of \"Stars\" and select X number of target players. From then till your next turn, these target players will be protected from all damage except Lightning attribute damage.\n\nAbility's relation to story:\nSince Zhu Ge Liang knew how to read the stars to foretell weather, it is only natural that \"The Seven Stars\" is intricately linked to the story, specifically to the battle at Red Cliffs. What's more impressive is the game maker's use of weather elements in his other abilities \"Strong Gale\" and \"Heavy Shroud\". We already know that a gale was necessary for the fire to spread towards Cao Cao's army, and the deeper reference to fire attributed damage is well-appreciated.\n\n\"Heavy Shroud\" is not part of his hocus-pocus ritual, but it still is related to the Red Cliffs battle. Prior to the main battle, Zhu Ge Liang used boats of straw to \"harvest\" 100,000 arrows for Zhou Yu. The shroud of haze was also fore-told in the stars and he used that to his advantage, deceiving the enemy into shooting at figurines of straw in the poor visibility.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-zhōu-yú-神周瑜","name":"Demi-God Zhōu Yú 神周瑜","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg17L_lpEpH28lQvgB8XP26dJvgy4vymJJ9_nkqP7LVU063rvQQJamoOAu9jdVgbVaJn6CCVcxpJP1KB6mJf9_1-ynuhlJNUASLboifhZuZOBYNLRk52ilczwIvTryTEovIRqngjbw7EreK/s320/shenzhouyu.jpg","text":"\n\n\nTranslated description:\n\"The God of Fire at Red Cliffs 赤壁的火神 (chì bì dè huǒ shén)\"\n\nWhy is he a Demi-God:\nPeople familiar with the Romance of the Three Kingdoms story would know that Zhu Ge Liang 诸葛亮 and Zhou Yu were both instrumental in defeating Cao Cao 曹操 at the Red Cliffs. However the historians that distilled out the \"Romance\" from the story found that Zhou Yu was the main architect of the victory, while Zhu Ge Liang had far less involvement. Even then, we can already tell in the story that Zhou Yu did a lot of the dirty work in putting the pieces together. These include:\n\n1. Setting up Pang Tong 庞统 to deceive Cao Cao into shackling his ships together.\n\n2. Sending Huang Gai 黄盖 to feint defection in order to set start the fire.\n\n3. Planning for the cut off of Cao Cao's retreat.\n\nUltimately, Zhou Yu deserves the credit for destroying Cao Cao's entire army and that is why Zhou Yu deserves to be immortalized as a Demi-God!\n\n\nCharacter ability 1: \"The Sound of Music 琴音 (qín yīn)\"\nDuring your discard phase, when you discard 2 or more on-hand cards, you can choose to force all players (including yourself) to regain 1 unit of health or lose 1 unit of health.\n\nCharacter ability 2: [Single-Use ability] \"Searing Heat 业炎 (yè yán)\"\nDuring your action phase, you can select 1 to 3 players and distribute a total of 3 units of fire attribute damage between them. If you allocate 2 units or more of damage to any of the players, you need to discard 1 card of each suit (4 cards in total) and lose 3 units of health.\n\nAbility's relation to story: \nAlthough Zhou Yu is known for his superb skills with the Qin instrument, there does not seem to be any mention of him playing the Qin during the Red Cliffs episode. Thus I believe \"The Sound of Music\" is just loosely based on his ability to play. \"Searing Heat\" probably just refers to his fiery achievement in defeating Cao Cao, but there is no reference for his sacrificing his health in the story at this period of time. Therefore this is probably also loosely-based on the story.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-guān-yǔ-神关羽","name":"Demi-God Guān Yǔ 神关羽","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhB-DBGJnpGNCGRXc2t5SGBDsgKb2xdJEHBrQ3AONeq2G64h5-vH7kWHYB0JXvquBy655qIQGjpjk1L2c2-nVvxg42FJRzyDweUz17Y8JQAnntB80FDq76jOguVyK49qqFuTo51OFPh0saI/s320/shenguanyu.jpg","text":"\n\n\nTranslated description:\n\"The Return of the Ultimate Ghost 鬼神再临 (gǔi shén zài lín)\"\n\nWhy is he a Demi-God:\nThere is no ghost quite like the ghost of Guan Yu in the Romance of Three Kingdoms story. No doubt he is not the only supernatural character to re-appear after death (Yu Ji 于吉 also came back to haunt Sun Ce 孙策), but the ghost of Guan Yu did more than spook the mortals. No, that would belittle him! The ghost of Guan Yu possessed his killer, Lu Meng 吕蒙, and took over control of his body. The possessed Lu Meng grabbed Sun Quan 孙权, and tossed him to the ground. Guan Yu even cursed Sun Quan through Lu Meng's mouth, then promptly killed Lu Meng from the inside, blood oozing out of the eyes, ears, nose and mouth. But the ghost of Guan Yu was not done yet! After Sun Quan sent Guan Yu's head to Cao Cao 曹操, Guan Yu's head awoke in its box and Cao Cao collapsed on the ground in fright. Cao Cao quickly gave Guan Yu a colossal burial fit for a prince and even posthumously named Guan Yu as Prince of Jing Zhou 荆州.\n\n\nCharacter ability 1: [Enforced ability] \"God of War 武神 (wǔ shén)\"\nEvery \"heart\" suited card will be regarded as ATTACK 杀. When you use one of these \"heart\" suited cards, the ATTACK has no range limitations.\n\nCharacter ability 2: [Enforced ability] \"Warrior Spirit 武魂 (wǔ hún)\"\nFor every 1 unit of damage that any player that inflicts on you, that player will receive 1 \"Nightmare 梦魇\" token. When you die, the player with the most number of Nightmare tokens must flip a judgement card. Unless the judgement card is PEACH 桃 or PEACH GARDEN 桃园结义, that player dies immediately.\n\nAbility's relation to story:\n\"God of War\" does not have any link to the story. I guess this is simply paying homage to the numerous military achievements of Guan Yu in his lifetime. \"Warrior Spirit\" is a fantastically created ability that has clear links to Lu Meng's death. The game makers want to re-create the retribution effect of Guan Yu's killer, and I think they put it together perfectly.\n\nTrivia:\nThe illustration of the card follows the author's description of the ghost of Guan Yu. After the burial given by Cao Cao, Guan Yu's spirit lingers and wanders to Yu Quan Hill 玉泉山 where a priest see's a ghost in the nightsky with the shape of man mounted on a horse. The priest then recognises that it is the ghost of Guan Yu.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-lǚ-méng-神吕蒙","name":"Demi-God Lǚ Méng 神吕蒙","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhnvtpLmzTuRxtPqZwd7Wl_SkIZdgV3vcubyBk2eOZar2m7RwsCIhZU0Ev28KKzduHC2dSbCPLy3mTgFMZC0EvJoyT9YYQRVYaTDaWjfcafBxfxuyYVFXaC8J5Fi91T8mVnYCw-c94A4D1n/s320/shenlumeng.jpg","text":"\n\n\nTranslated description:\n\"The Minister with Divine Enlightenment 圣光之国士 (shèng guāng zhī guó shì)\"\n\nWhy is he a Demi-God:\nI wish I had an answer to this question that I am whole-heartedly convinced with. Unfortunately, I do not. \"Divine Enlightenment\" is an exaggeration of Lu Meng's studious discipline, where he turns from a military brute into a learned minister. His remarkable improvements are due to his own hard work and there was nothing divine about his new found enlightenment. Perhaps by giving this character a tinge of divinity, he rises to join the immortal Demi-Gods? Of course, my aim is not to pick the minor faults of this game, given the huge amount of literature references in all the cards combined.\n\n\nCharacter ability 1: \"Browse Through 涉猎 (shè liè)\"\nDuring your drawing phase, you can choose to carry out the following action to replace the drawing of cards: Flip over 5 cards from the top of the deck and take 1 card of each suit (max 4 cards: 1 heart, 1 spade, 1 clubs, 1 diamonds). Discard the remainder.\n\nCharacter ability 2: \"Strike at the Heart 攻心 (gōng xīn)\"\nDuring your action phase, you can view all the on-hand cards of 1 player. You can then pick 1 card with a suit of \"hearts\" from this player's on-hand cards and display it for every player to see. After doing so, you can choose to either discard this \"hearts\" card or place it at the top of the deck.\n\nAbility's relation to story:\n\"Browse Through\" is the very phrase that Sun Quan 孙权 used to advise Lu Meng to read more and be knowledgeable. Of course, Sun Quan's intention was not to turn Lu Meng into a PhD, so he only advocated browsing through as many books as possible to get a wider breadth of knowledge. Using a wordplay on the ability name, Lu Meng can now \"browse through\" the first 5 cards of the deck and take his pick. Very nice fit!\n\n\"Strike at the Heart\" is also another wordplay. In his attack on Jing Zhou 荆州, Lu Meng used psychological tactics to defeat Guan Yu 关羽. He \"attacked\" the hearts of the civilians of Jing Zhou by treating them well and with respect. It was thus that Guan Yu's troops began deserting him.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-cáo-cāo-神曹操","name":"Demi-God Cáo Cāo 神曹操","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjouSx_CIygEwx6XYFoTlPwvkLhAKETHKP8Jyk19IFVXiaK6_U7MQVb3oDyPUQwLwUXsBDP_YTj59kSIE_lqzNwWVlYEwmOfOfF25GiLoC-5-FvIORlWoS7U-4lgnFEL9Zv6TTPAkQp8pPq/s320/shencaocao.jpg","text":"\n\n\nTranslated description:\n\"A Hero that transcends time 超世之英杰 (chāo shì zhī yīng jié)\"\n\nWhy is he a Demi-God:\nNearly every Chinese in the world would have heard of his name. It is not just his achievements that are spectacular, his use of military tactics and his overall leadership ability is legendary. The description is no exaggeration; Cao Cao truly is a hero that has transcended time.  That fact that we are playing a card game that is built-upon that the Three Kingdoms story is proof of this. You might ask, \"What about Liu Bei 刘备 or Sun Quan 孙权? Are they not in the same league?\" Perhaps. Both of them were extraordinary in their own rights, but the drama that is Cao Cao is what makes him stand out from those two. It is well-known that the Romance of Three Kingdoms story down-played a lot of Cao Cao's achievements and his more humane side, thus what we know from the story is only a part of his full story. Cao Cao deserves to be a Demi-God, because he is arguably the most important person in the entire era.\n\n\nCharacter ability 1: \"Homage 归心 (guī xīn)\"\nFor every 1 unit of damage that you receive, you can draw one card from every character in play (equipped cards, on-hand cards, or pending judgement cards). After doing so, you must flip character card.\n\nCharacter ability 2: [Enforced ability] \"Flying Shadow 飞影 (fēi yǐng)\"\nWhen other characters consider their distance from you, you will always have additional +1 distance away (equipped +1 horse by default).\n\nAbility's relation to story:\n\"Homage\" is exactly what the word means; bow to the God that is Cao Cao and offer him your cards for his picking. \"Flying Shadow\" is a word play on his favorite steed \"The Shadow 绝影\", which is a +1 horse in this game.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-lǚ-bù-神吕布","name":"Demi-God Lǚ Bù 神吕布","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgyH1sA6qPLqaiCtPc5Mg_ddWxJiqONkAff9YN5OciutsHqXeYtnVn4MFRELSqD9pSHyFn1zmj21C_l7mQ0Ky9WyBjra9nNKL2tmAh9wB5y8wh6fzprnUR2cs-3q2LTk7n-mJxE6Fcp-UtG/s320/shenlubu.jpg","text":"\n\n\nTranslated description:\n\"The Way of the Asura 修罗之道 (xiū luó zhī dào)\"\n\n(Asuras are mythical Demi-Gods in Buddhist mythology that are wrathful, prideful, arrogant, and love to fight. Click here for Asuras Wiki.)\n\nWhy is he a Demi-God:\nLet's list out a couple adjectives to describe Lu Bu -\n\n1. Arrogant (Striking his halberd with an arrow to win a truce between Yuan Shu 袁术 and Liu Bei 刘备)\n2. Wrathful (Killing Dong Zhuo 董卓 over Diao Chan 貂蝉)\n3. Loves to fight (1 vs 3 against the sworn-brothers-three)\n4. Prideful (Loves to hear compliments and receive gifts that stroke his ego).\n\n... and lastly...\n\n5. Not very bright (no relation to the Asuras)\n\nNotice that the description is quite accurate about him, placing his personality amongst the Asuras. Perhaps that is why he is a Demi-God: because the Asuras are Demi-Gods themselves. Therefore this Demi-God character has nothing to do with his death, but everything to do with his actions while he was alive.\n\n\nCharacter ability 1: [Enforced ability] \"Violent Rage 狂暴 (kuáng bào)\"\nAt the beginning of the game, you get 2 \"Rage 暴怒\" tokens. Every 1 unit of damage you cause or suffer, you receive 1 Rage token.\n\nCharacter ability 2: [Enforced ability] \"Simpleton 无谋 (wú móu)\"\nEvery time you use a tool card (with the exception of Time-delay Tool Cards), you must discard 1 Rage token or lose 1 unit of health.\n\nCharacter ability 3: \"Unprecedented 无前 (wú qián)\"\nDuring your action phase, you can discard 2 Rage tokens and select 1 target player. For the rest of your turn, the target player's Armour becomes ineffective. In addition, you acquires Lu Bu's \"Without Equal 无双\" ability.\n\nCharacter ability 4: \"Asura's Fury 神愤 (shén fèn)\"\nDuring your action phase, you can discard 6 Rage tokens. Every player (except yourself) will:\n\n(Carried out in order from 1 to 3)\n1. Receive 1 unit of damage\n2. Discard all equipped cards\n3. Discard 4 on-hand cards\n\nAfter this is done, you must flip your character card. Limited to once per turn.\n\nAbility's relation to story:\nAbilities 1, 3 and 4 are created for this character with little to no link to the story. \"Simpleton\" has some links to the story, but I need not elaborate here as it has been described in my previous post on (normal) Lu Bu.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-sīmǎ-yì-神司马懿","name":"Demi-God Sīmǎ Yì 神司马懿","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhjFT6ZTACEezz-eqlbcDMW_lEs5x-ZjgMlmLJhr1eHB2IYQgRWwLwBVIKPhamhwA0EqoK6_pQJ2dsCYH7g2hegb7_qK_fUGvyznN3bymrwG_A5nHpuZ4V4C9boIGMQtuPU6QfIT7mxQ6qv/s320/shensimayi.jpg","text":"\n\n\nTranslated description:\n\"The Founder of Jin Empire 晋国之祖 (jìn guó zhī zhǔ)\"\n\nWhy is he a Demi-God:\nWhy not?! You are talking about the overall winner of the entire era! This is the man who played the Cao family like a puppet-master, read Zhuge Liang 诸葛亮’s mind like nobody else could, had a sleeve full of tricks to deceive everyone, and eventually had his children and grandchildren conquer all of China.\n\nHow amazing is Sima Yi? Well according to some legends, Sima Yi was one of the disciples of the mysterious Sima Hui 司马徽, who was also the teacher of Zhuge Liang and Guo Jia 郭嘉. It was said that Sima Yi was the youngest of all his disciples, but the most able and cunning. This legend was never corroborated, of course, and even Sima Yi's entrance into Cao Cao 曹操's service is disputed. But his wit, intellect, and management ability was on par with, if not beyond, those of Zhuge Liang. The two arch-rivals won and lost battles against each other and both had a lot of respect for the other. In the greater scheme of things, though, Zhuge Liang lost out to Sima Yi because his allegiance and integrity to Shu made him overwork himself to death. Sima Yi, on the other hand, seemed to handle his live and work with greater ease and he lived to a much older age.\n\nWhether you think he is pure evil or simply utilitarian, there really is no denying this old man his undisputed title as victor of the Three Kingdoms!\n\nCharacter ability 1: \"Restraint 忍戒 (rěn jiè)\" [Enforced ability]\nFor every 1 unit of damage you receive or every 1 card you discard during your discard phase, you receive a “Restraint 忍” token.\n\nCharacter ability 2: \"Promotion 拜印 (bài yìn)\" [Awakening ability]\nAt the start of your turn, if you have 4 or more Restraint tokens, you must reduce your maximum health by 1 unit, and you permanently acquire the ability \"Extreme Tactic 极略\". (Discard a Restraint token to execute one of the following abilities: \"Demonic Talent 鬼才\", \"Banish into Exile 放逐\", \"Unmitigated Murder 完杀\", \"Balance of Power 制衡\" or \"Assembling Wisdom 集智\")\n\n(Recall:\nDemonic Talent (Sima Yi) - Change judgement card\nBanish into Exile (Cao Pi) - Flip character card\nUnmitigated murder (Jia Xu) - Peach can't save others\nBalance of Power (Sun Quan) - Change cards on-hand/equipped\nAssembling Wisdom (Huang Yueying) - Draw 1 card when use a Tool card)\n\nCharacter ability 3: \"Domino Victory 连破 (lián pò)\"\nIf you kill one or more players within your turn, once your turn ends, you get to play an extra turn.\n\nAbility's relation to story:\nThe chinese words \"忍戒\" comes from the Chinese phrase \"用忍戒急 (Restrain yourself from hasty actions)\". In military campaigns, Sima Yi was famed for restraining himself and his forces against enemy taunts. He insisted on waiting for the right moment to strike. Probably the most famous of such a scenario happened at the Battle of Wu Zhang Plains 五丈原之战, where Zhuge Liang sent Sima Yi women's clothings as an insult, calling Sima Yi a woman for not daring to meet his forces in battle. Sima Yi ignored the taunt and eventually prevailed after Zhuge Liang fell deathly exhausted. It is an apt ability, where the Restraint tokens are a tangible form of that \"little black book\" to scrawl in grievances!\n\nIn politics, he hid his ambition for decades and instead served the Wei kingdom. He eventually got the promotion \"拜印\", which was a traditional ritual for the appointment of generals. Insidiously, however, the cunning Sima Yi was coiled up and waiting to strike. When the right moment came, he would perform “Consecutive Aggresion”, eliminating his enemies quickly and in quick succession. One example was when Gongsun Yuan 公孙渊 rebelled against the Wei kingdom, Sima Yi was sent to crush him. Despite Gongsun Yuan's defenses, Sima Yi overpowered him. Sima Yi set up a fake camp to attract his attention, and sent his troops to strike at the right moment. He won three consecutive battles and eventually killed Gongsun Yuan and his sons when they attempted to flee.\n\nThe reasoning behind the five abilities included in \"Extreme strategies\" are:\n\"Demonic Talent\"---that’s his signature move.\n\"Banish into Exile\"---it was Cao Pi who promoted him\n\"Unmitigated Murder\"---he was a shrewd strategist like Jia Xu, and his strategy was deadly.\n\"Balance of Power\"---a genius at politics, he weakened Shu and Wu by utilizing Wei forces, and the invasions of Shu and Wu forced Wei to promote him, allowing Sima family to become more powerful.\n\"Assembling Wisdom\"---he was not a lone strategist, and his comrade often gave him advice of tactics, although he was better\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"demi-god-zhào-yún-神赵云","name":"Demi-God Zhào Yún 神赵云","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjy0sOujsMNcT6aUk5Gmi8vD4khufeKdNd_q_OM62gQQG9iRiMIN3Lr_Y61O5CDY3kHlC9wj47DPb9d5IEwzPJB_OEYQhFCWd4VSAlu_gpm__sf05nqYJx-4JRS2VvW1L4iAoFn4Oal6Qzt/s320/shenzhaoyun.jpg","text":"\n\n\nTranslated description: \n\"Aura of the Dragon 神威如龙 (shén wēi rú lóng)\"\n\nWhy is he a Demi-God?\nThere are over 1000 characters in the ROTK story, some more prominent than others, yet most of them had their flaws. Let's focus only on warriors and generals and see whom we can think of. Lu Bu 吕布 was the strongest, but a simpleton through and through. Guan Yu 关羽 was well-respected, but his arrogance cost him his life. Zhang Fei 张飞 was a brutal fighter, but a reckless goon. Dian Wei 典韦 was fearsome, but died early. The list can go on and on... but one hero really stands out amongst them. He is none other than Zhao Yun.\n\nAlmost all the qualities you want to find in a general, Zhao Yun does not lack. Courage and fighting ability is his calling card, but so too is his loyalty and prudence. He served Liu Bei and Shu till a ripe old age, and throughout his long career his name rings fear together with deep respect in the hearts of his foes. But most amazing of all for that era, is his humility. Seldom the one for cockiness and reckless tirades, he makes Guan Yu and Zhang Fei appear like immature teens compared to his cool-head. If there was one general who can be crowned the strongest overall in the three kingdoms era, it would surely be Zhao Yun! The one with the aura of the Dragon!\n\nCharacter ability 1: \"Adversity 逆境 (nì jìng)\" [Enforced ability] \nDuring the drawing phase, the number of cards you draw is equal to the health you have lost thus far plus 2. Your on-hand card limit will always be +2 more than usual.\n\nCharacter ability 2: \"Soul of the Dragon 龙魂\"\nYou can use or play X cards with the same suit as the following:\n\"Hearts\" as \"PEACH 桃\"\n\"Diamonds\" as \"ATTACK 杀\" with fire attributes\n\"Clubs\" as \"DODGE 闪\"\n\"Spades\" as \"NEGATE 无懈可击\"\n(X is the units of health you have currently. X has a minimum of 1.)\n\nAbility's relation to story:\n\"Adversity\" refers to Zhao Yun’s victories in battles that were seemingly impossible to win. The battle that is related to this Demi-God character the most is the Battle of ChangBan 长坂之战. For more details, click here to read the post on Zhao Yun. If you look carefully, you would see in the character portrait that Demi-God Zhao Yun has a baby slung across his chest. That baby is none other than Liu Shan 刘禅 and this portrait actually depicts Zhao Yun's incredible rescue of the baby from the Wei forces during the Chang Ban battle. Nice as the portrait is, the ability itself does not seem to relate much to any adversity he is facing. The little link available is that Zhao Yun can draw more cards as his situation (health) becomes more dire.\n\nIncidentally, Demi-God Zhao Yun is given only 2 units of health. It makes me wonder if this has anything to do with Zhao Yun sustaining multiple wounds and injuries during his rescue of Liu Shan.\n\n\"Soul of the Dragon\" is wordplay on Zhao Yun’s styled name, \"子龙\". The character \"龙\" means dragon. Obviously, the ability has little to do with his soul, or any of the situations in the story. It is just a cool-sounding title to a very power ability. Yet the mechanics of this ability can be argued to have been created in the unofficial packs. The unofficial Zhang Jiao 张角 already featured an ability very similar to \"Soul of the Dragon\", albeit Zhang Jiao's ability was retardedly overpowered. Of course, you could say that it all began with Yuan Shao 袁绍's ability.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǚ-bù-吕布-(sp008)","name":"Lǚ Bù 吕布 (SP008)","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi3xzlhRjxI886GJXfq42lfaHFVVjFMlz9oujECce7SUsnEyWUkacqXUgTE40S_HIV_vyq1zJyy6ECvwkIRcAGsfYrbmid92_t6YqchuroBW8oqwEois3y0HNfMwfTtbcGzi4n3YKYlP8cx/s320/splubu8.jpg","text":"\n\n\n\nWho is he?\n\nI guess you are already very familiar with him. Lǚ Bù 吕布, the strongest fighter during the whole Three Kingdoms era. There have already been two versions of him in SGS (Neutral Heroes and Demi-God), but they have really outdone themselves this time. These two SP versions are both Demi-Gods, and pretty much insane!\n\n\nWhy is he an SP character? \nBecause it’s created for the SP mode: HuLao-Pass. HuLao-Pass Mode is designed according to the story of a famous battle in Romance of the Three Kingdoms. With regards to the HuLao-Pass mode, the game designers said: “Nowadays there are more and more expansions of SGS. People gradually concentrate more and more on the various and complicated abilities of new characters, and forget about the cultural background, the comprehension of the characters’ personalities, and enjoying the balance of the game. The design of HuLao-Pass Mode and this Demi-God version of Lu Bu are supposed to help players get back to the Three Kingdoms’ world and enjoy the simulated battle.”\n\n\n\nTranslated Description:\n“The Myth of the Formidable 最强神话 (zuì qiáng shén huà)” \n\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability] \nYou will always be at -1 distance in any range calculations. \n\n(Note: Same ability as Ma Chao 马超)\n\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability] \nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n\n(Note: Same ability as the original Lu Bu 吕布.)\n\n\n\n\nWhen your health decreases to 4 units, your character card has to be changed immediately into this next character card.\n\n\n\n\nTranslated Description:\n“The Furious God of Battle 暴怒的战神(bào nù de zhàn shén)”\n\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability] \nYou will always be at -1 distance in any range calculation.\n\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability] \nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n\nCharacter ability 3: “Asura 修罗(xiū luó)” \nAt the beginning of your turn, you can discard one on-hand card in order to discard one Time- Delay Tool Card that is in your Judgement Area. The card you discard must be of the same suit as the Time-Delay Tool Card.\n\nCharacter ability 4: “Divine Aura 神威 (shén wēi)” [Enforced ability] \nDuring your drawing phase, you can draw an additional 2 cards. Your on-hand card limit is increased +2.\n\nCharacter ability 5: “Divine Halberd 神戟 (shén jǐ)” \nWhen you have no weapon equipped, your ATTACK card can target up to 3 different players.\n\n\nTip:\nThere are no LIGHTNING 闪电 cards and no expansions SO FAR in HuLao-Pass Mode on  SGS online. Since this character is designed for HuLao-Pass Mode, the Time- Delay Tool Cards would only refer to ACEDIA 乐不思蜀.\n\n\nAbility's relation to story: \nMost of Demi-God Lu Bu’s abilities are extremely aggressive. They just represent his courage, bravery, and exceptional fighting prowess. Also, this Demi-God version of Lu Bu is designed for a battle with three other characters. That’s why he also has some efficient defensive abilities; for example, “Asura” can prevent him from being affected by ACEDIA, “Divinity” can let him have more cards to better defend himself during the game.\n\n\nAdditional info based on story: \nSince these character cards are designed for HuLao-Pass Mode, you really need to know what happened at HuLao-Pass then. Ricky has made an excellent write-up for this story, just check it out on Lu Bu’s page.\n\n\nLinks and resources: \n- Lu Bu Wiki\n- Battle of HuLao Pass Wiki\n- Asura Wiki\n\n\nHow to obtain this character? \nThose two cards are available in HuLao-Pass Mode on SGS online now! (Of course VIP only, and there is no way to see them in other modes) For obtaining the cards, purchase ZYZ magazine issue #8 (August 2011).\n\n\nContributing Writer:\nCherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǚ-bù-吕布-(sp008)","name":"Lǚ Bù 吕布 (SP008)","faction":"demi-gods","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi3xzlhRjxI886GJXfq42lfaHFVVjFMlz9oujECce7SUsnEyWUkacqXUgTE40S_HIV_vyq1zJyy6ECvwkIRcAGsfYrbmid92_t6YqchuroBW8oqwEois3y0HNfMwfTtbcGzi4n3YKYlP8cx/s320/splubu8.jpg","text":"\n\n\n\nWho is he?\n\nI guess you are already very familiar with him. Lǚ Bù 吕布, the strongest fighter during the whole Three Kingdoms era. There have already been two versions of him in SGS (Neutral Heroes and Demi-God), but they have really outdone themselves this time. These two SP versions are both Demi-Gods, and pretty much insane!\n\n\nWhy is he an SP character? \nBecause it’s created for the SP mode: HuLao-Pass. HuLao-Pass Mode is designed according to the story of a famous battle in Romance of the Three Kingdoms. With regards to the HuLao-Pass mode, the game designers said: “Nowadays there are more and more expansions of SGS. People gradually concentrate more and more on the various and complicated abilities of new characters, and forget about the cultural background, the comprehension of the characters’ personalities, and enjoying the balance of the game. The design of HuLao-Pass Mode and this Demi-God version of Lu Bu are supposed to help players get back to the Three Kingdoms’ world and enjoy the simulated battle.”\n\n\n\nTranslated Description:\n“The Myth of the Formidable 最强神话 (zuì qiáng shén huà)” \n\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability] \nYou will always be at -1 distance in any range calculations. \n\n(Note: Same ability as Ma Chao 马超)\n\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability] \nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n\n(Note: Same ability as the original Lu Bu 吕布.)\n\n\n\n\nWhen your health decreases to 4 units, your character card has to be changed immediately into this next character card.\n\n\n\n\nTranslated Description:\n“The Furious God of Battle 暴怒的战神(bào nù de zhàn shén)”\n\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability] \nYou will always be at -1 distance in any range calculation.\n\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability] \nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n\nCharacter ability 3: “Asura 修罗(xiū luó)” \nAt the beginning of your turn, you can discard one on-hand card in order to discard one Time- Delay Tool Card that is in your Judgement Area. The card you discard must be of the same suit as the Time-Delay Tool Card.\n\nCharacter ability 4: “Divine Aura 神威 (shén wēi)” [Enforced ability] \nDuring your drawing phase, you can draw an additional 2 cards. Your on-hand card limit is increased +2.\n\nCharacter ability 5: “Divine Halberd 神戟 (shén jǐ)” \nWhen you have no weapon equipped, your ATTACK card can target up to 3 different players.\n\n\nTip:\nThere are no LIGHTNING 闪电 cards and no expansions SO FAR in HuLao-Pass Mode on  SGS online. Since this character is designed for HuLao-Pass Mode, the Time- Delay Tool Cards would only refer to ACEDIA 乐不思蜀.\n\n\nAbility's relation to story: \nMost of Demi-God Lu Bu’s abilities are extremely aggressive. They just represent his courage, bravery, and exceptional fighting prowess. Also, this Demi-God version of Lu Bu is designed for a battle with three other characters. That’s why he also has some efficient defensive abilities; for example, “Asura” can prevent him from being affected by ACEDIA, “Divinity” can let him have more cards to better defend himself during the game.\n\n\nAdditional info based on story: \nSince these character cards are designed for HuLao-Pass Mode, you really need to know what happened at HuLao-Pass then. Ricky has made an excellent write-up for this story, just check it out on Lu Bu’s page.\n\n\nLinks and resources: \n- Lu Bu Wiki\n- Battle of HuLao Pass Wiki\n- Asura Wiki\n\n\nHow to obtain this character? \nThose two cards are available in HuLao-Pass Mode on SGS online now! (Of course VIP only, and there is no way to see them in other modes) For obtaining the cards, purchase ZYZ magazine issue #8 (August 2011).\n\n\nContributing Writer:\nCherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"}]