[{"id":"diāo-chán-貂蝉","name":"Diāo Chán 貂蝉","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgoIU3NV7sfR3B0Pxl3WtOT3Ef3aR97YT6_Typ0Hsq2STFPpwCvkuhsI6Egbl-1EJoa6ePsCSkLtF56U9slz7O49-hSAn-wfOxnytPRfjMriLaJd9qraEyDhRg7XV_aPzkHUt0PEICbiUTq/s320/qundiaochan.jpg","text":"\nTranslated description:\n\n\"The Dancer with Unrivaled Beauty 绝世的舞姬 (jué shì dè wǔ jì)\"\n\n\nWikipedia link: Diao Chan Wiki\n\n\n\nWho is she:\n\nRegarded as one of the 4 great beauties of ancient China, Diao Chan is one of the classic examples of the \"Beautiful Maiden Ploy 美人计\". The willing pawn of Wang Yun 王允 in his grand scheme to destroy the tyrannical Dong Zhuo 董卓, Diao Chan flirted with Lu Bu 吕布 while submitting herself to Dong Zhuo as his concubine. In doing so, she pitted godfather against godson, causing severe dissension and distrust amongst them. Dong Zhuo relents that he needs the incredible combat skills of Lu Bu to maintain his power, but the mercenarial Lu Bu had little to lose. Wang Yun further convinces Lu Bu to murder Dong Zhuo and take Diao Chan for himself, which he eventually does. In some versions of the story, Diao Chan is said to have truly loved Lu Bu but became distraught on knowing Wang Yun's scheme. The original version, however, seems to state that Diao Chan knowingly wanted to kill Dong Zhuo and participated actively in Wang Yun's ploy.\n\n\n\n\nCharacter ability 1: \"Seed of Animosity 离间 (lí jiān)\"\n\nDuring your action phase, you can discard one card (either on-hand or equipped) and select two male characters to undergo DUEL 决斗 with each other. This ability cannot be neutralized using NEGATE 无懈可击. Limited to one use per turn.\n\n\n\nNote that Diao Chan must select one of the male characters to be the first to use ATTACK 杀 on the other male character. If this first character does not or is unable to use ATTACK, he will suffer 1 unit of damage and the ability ends (the other male character need not use ATTACK). \n\n\n\nCharacter ability 2: \"Envious Moon 闭月 (bì yuè)\"\n\nIn the end of your turn, you can draw one additional card from the deck.\n\n\n\nAbility's relation to story:\n\n\"Seed of Animosity\" is one of the best matched ability to the story in the entire game. This ability completely embodies Diao Chan's persona in the story, which is simply using her beauty to cause two men to fight each other. \"Envious Moon\" comes from a longer proverb used to describe the 4 great beauties of ancient China. \n\n\n\n\"沉鱼落雁, 闭月羞花\" which means the fish stare at them till they forget to swim and sink to the bottom, the geese forget to flap their wings and fall to earth, the moon hides behind the clouds in envy, and the flowers slink low and bow the petals in shame. Why does Diao Chan get to take one extra card for being beautiful? The same reason Zhou Yu 周瑜 gets one more card for being handsome!\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Causing Lu Bu to kill Dong Zhuo and, thus, ridding the world of a super tyrant. To be blunt, Diao Chan is hardly known for anything else other than this achievement and her beauty.\n\n\n\n2. Cause of death - Unknown!! Many versions abound with regards to the fate of Diao Chan after Dong Zhuo's death. Some say she was killed while Lu Bu escaped, some said she died with Lu Bu after he was executed by Cao Cao 曹操. More extreme versions claim she was presented as a gift to Guan Yu 关羽 from Cao Cao for his temporary allegiance to the Wei Kingdom.\n\nFAQ and Disambiguation\n\n1. Would Diao Chan be a source of attack or is the player whom Diao Chan appointed to Duel with another player, the source?\n\nAns: The other player whom she appoints will become the source. Therefore it is very useful for pitting Ruler against Loyalist. Hopefully Loyalist die and Ruler discards everything.\n\n\n2. Can Diao Chan make Zhu Ge Liang and somebody else Duel when Zhuge has no cards on hand?\n\nAns: Nope. Elder Zhu Ge Liang cannot become the target of Duel even if it is her ability.\n\n\n3. If Diao Chan uses Seed of Animosity on Cao Cao and Cao Cao has no 'sha' (he is selected to attack first), then does Cao Cao takes the discard card as a source of damage?\n\nAns: The discard is simply to trigger the ability.It is not the source of damage so Cao Cao does not get the card.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"huà-tuó-华佗","name":"Huà Tuó 华佗","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiEb51GvwjxxTYRzxVCRZBZpcdJmkxfCXlDgCP8y4l-EyCb44LPw1EhpHoXhyyMknIWk7IIlfjdWACMjXOgR3SqlVVaqmlRMphbI4L8NxpRAr35bsTcnCmrj-6BFG8RxyZBhqRJuhbgFDmn/s320/qunhuotuo.jpg","text":"\nTranslated description:\n\n\"Miracle Physician 神医 (shén yī)\"\n\n\nWikipedia link: Hua Tuo Wiki\n\n\n\nWho is he:\n\nHis name has become synonymous with \"Miracle Doctor\" as he cured many strange sicknesses. Studies by historians said his medical techniques were hundreds of years ahead of his time. The Romance of Three Kingdoms story, however, deviates from history slightly and almost turns him into Super Doctor. Two prominent scenes showcase Hua Tuo's incredible healing powers: the first is his surgery on Guan Yu 关羽's arm and the second is his proposal to cure Cao Cao 曹操 of his migraine. Both of these scenarios will be described later in the \"Additional info\" section. Though his appearance in the story is brief, he carries significant impact. This effect is felt when Cao Cao regrets the death of Hua Tuo as his own son, Cao Chong 曹冲, becomes gravely ill. Without Hua Tuo's medical expertise, Cao Chong did not survive the illness.\n\n\n\n\nCharacter ability 1: \"Emergency Rescue 急救 (jí jiù)\"\n\nOutside of your turn, you can use any of your cards (on-hand or equipped) with the suit of \"hearts\" or \"diamonds\" as PEACH 桃. \n\n\n\nCharacter ability 2: \"Green Salve 青囊 (qīng náng)\"\n\nDuring your action phase, you can discard one on-hand card and allow any player to regain 1 unit of health. Limited to one use per turn. \n\n\n\nAbility's relation to story:\n\n\"Emergency Rescue\" could have some connection with him saving Guan Yu from the poison arrow. Though Guan Yu wasn't exactly on his deathbed yet, the wound was life-threatening and Hua Tuo did save him. \"Green Salve\", on the other hand, is very much linked to the story. Hua Tuo had with him a book of his works known as the \"Book of the Green Salve 青囊书\". This book contained numerous medical techniques of saving lives, but was destroyed when he died. Though not told in the story, the historical accounts mention that this book was burnt by Hua Tuo himself when the prison guard refused to accept it. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Removing the poison from Guan Yu's arm. Guan Yu suffered a poison arrow wound on his arm in the battle at Fan Cheng 樊城之战. When Guan Yu returned to camp, Hua Tuo was sought to heal him. In order to do so, Hua Tuo had to operate on Guan Yu and scrape the poison from the bone. Guan Yu refused to take any anaesthesia and took the operation without flinching. In fact, he was playing chess throughout the operation. Hua Tuo successfully removed the poison and Guan Yu was cured. \n\n\n\n2. Cause of death - Dying in the prisons of the Wei Kingdom. Cao Cao suffered from severe migraine and Hua Tuo was sought for a cure. Hua Tuo did propose a cure: cut open Cao Cao's head for an operation. Cao Cao was freaked out from a previous assassination attempt by another physician Ji Ben 吉本 and, therefore, thought Hua Tuo was blatantly out to kill him. Cao Cao sent Hua Tuo to the prisons where the old man in captivity soon after.\n\nFAQ and Disambiguation\n\n\n1. If Hua Tuo is hit with Lightning, does that mean he can't heal himself with a red card?\n\nAns: Yes that is right. Because a judgement is conducted within that turn, his 1st ability cannot activate. Therefore he can only use that actual PEACH card or WINE to save himself.\n\n\n2. Can Hua Tuo revive himself when he is killled?\n\nAns: In his turn, he can only revive himself with a PEACH or WINE card\nNote that when he is at brink-of-death, he CANNOT use his Green Slave ability  to revive. He can only use a PEACH or WINE. His Emergency Rescue ability also does not work in his turn. Outside of his turn , he can use Emergency Rescue. Hence an PEACH, WINE or red-suited cards will revive him.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǚ-bù-吕布","name":"Lǚ Bù 吕布","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj59dgt09V2j3qcRj09nrFKjEJwVnKkUX-fDGzm6sPdOKsDq0rZ1wnv91geqltjLByn9PS8lntMQr57FbORi8FUYba2HJOZeiz9vILRNPCYtQk9n44m67rRskrhXmLTnM-fAu4CjOFNNgZA/s320/qunlubu.jpg","text":"\nTranslated description:\n\n\"Ultimate Combat Skills - Personified 武的化身 (wǔ dè huà shēn)\"\n\n\nWikipedia link: Lu Bu Wiki\n\n\n\nWho is he:\n\nQuite possibly the best fighter in all of China in that era, Lu Bu was a formidable general that struck fear in his opponents. Yet for all his military prowess and combat ability, Lu Bu was not the smartest of people. Throw in a tinge of greed, a sprinkle of lust, and you have a riding, fighting disaster atop four hooves. Dong Zhuo 董卓 found that out the hard way. To win Lu Bu's favour, Dong Zhuo showered Lu Bu with expensive gifts such as the Red Hare 赤兔 horse and an assortment of jewels. Lu Bu came under Dong Zhuo's wing after all receiving all those goodies, then ended up murdering Dong Zhuo victim over a woman. After Dong Zhuo's death, Lu Bu became a minor warlord and led a series of battles in an effort to expand his territory. However his poor use of strategy and refusal to listen to advice ultimately caused his downfall.\n\n\n\n\nCharacter ability: [Enforced ability] \"Without Equal 无双 (wú shuāng)\"\n\nWhenever you use ATTACK 杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use. \n\n\n\nAbility's relation to story:\n\nThe link can actually be found in the subscript line written under his ability description. It is a phrase said by Chen Gong 陈宫, his advisor when Lu Bu became warlord, that reads:\n\n\n\n\"His courage and bravery, unsurmountable. His eagerness for battle, unprecedented. Yet brave but without cunning. Violent but without benevolence. 骁勇无敌, 善战无前. 然勇而无谋, 暴而少仁.\"\n\n\n\n无双 literal translates to \"Without Equal\" and refers to his incredibly combat skills. Thankfully, it does not seem to be sarcastic referring to his intellect as well.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Killing Dong Zhuo. Ok so maybe it's not a very glamorous view of Lu Bu to say it was his \"most famous achievement\" when he was merely a pawn of Wang Yun 王允's scheme, but the fellow did kill the tyrant and the world celebrated Dong Zhuo's death. Coming in second would be his securing a truce between Yuan Shu 袁术 and Liu Bei 刘备's forces by showing off his archery skills, but that seemed somewhat less spectacular in comparison, doesn't it?\n\n[Addendum] By popular demand, I have added the 1 VS 3 fight between Lu Bu VS Liu Bei 刘备 and company. In the days of Yuan Shao 袁绍's coalition against Dong Zhuo, many generals challenged Lu Bu, not none were his match. One of these generals was Gong Sun Zan 公孙瓒, who could hardly hold up a dozen bouts against the mighty Lu Bu. Out came Zhang Fei 张飞 who raced out to meet Lu Bu, thus saving Gong Sun Zan. The two were evenly matched when Guan Yu 关羽 joined in. 1 VS 2 and still Lu Bu held up strong. Liu Bei joined in the fray and it became 3 of the legendary heroes (all highly capable fighters) against 1 single Lu Bu. Though Lu Bu could match them 1 VS 3, alas he became fatigued and he retreated. Still, the entire coalition of thousands was watching the duel and everyone had little doubt of the fighting prowess of Lu Bu.\n\n\n\n2. Cause of death - Betrayed by his own men to Cao Cao 曹操 and executed. For all his fighting valour, Lu Bu became a coward in the face of death. When Lu Bu was under siege, he chose to stay by the side of his wives and not listen to his advisor, Chen Gong. He was also ill-tempered to his men, their low-morale fueling resentment for their leader. While Lu Bu was asleep, they stole the Heaven Scorcher Halberd 方天画戟 and bundled Lu Bu over to Cao Cao. Lu Bu asked Cao Cao to allow him to surrender and he would be at Cao Cao's service. However Liu Bei quickly reminded Cao Cao of the fate of Lu Bu's previous masters, and Cao Cao ordered Lu Bu executed without hesitation. Lu Bu pleaded for his life to no avail. In sharp contrast, Lu Bu's general Zhang Liao 张辽 cursed Cao Cao despite being bound for certain death. Cao Cao unbound Zhang Liao, and Zhang Liao then became one of Cao Cao's most able general in the years to come.\n\nFAQ and Disambiguation\n\n1.If Lu Bu uses the duel card,would the opponent have to use 2 attack cards to begin with?\n\nAns:Yes.Therefore the Duel would go something like this:\n\n       1.Lu Bu starts with Duel Card\n\n       2.Victim responds with 2 attacks\n\n       3.Lu Bu responds with 1 attack card\n\n       4.Victim responds with another 2 attack cards...etc.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yuán-shào-袁绍","name":"Yuán Shào 袁绍","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg-5aK6Fz2M5GXpZjPCfpDb1hN1TVj4R3tnkvUKqdF-fdq3whpc7LWFLoYpzBKyPvBxgSKttMdfXkcLwOBUG_9NT5YgP5YlitS2dMpGGx6iDWmwNAz6XT3evUXGtQXabYgC9zT6VIQZLQwl/s320/qunyuanshao.jpg","text":"\nTranslated description:\n\n\"Aristocratic Ancestry 高贵的名门 (gāo guì dè míng mén)\"\n\n\nWikipedia link: Yuan Shao Wiki\n\n\n\nWho is he:\n\nAt one point of time he became the most powerful warlord in all of China, thanks to a coalition of numerous warlords in an effort to overthrow the tyrannical Dong Zhuo 董卓. He was the most powerful because he was nominated to lead the entire coalition, akin to the modern day Secretary-General of the United Nations, thanks to his noble ancestry. His great-grandfather was an interior minister that served directly under the Emperor. However Yuan Shao's power was short-lived, as he very quickly lost the respect of the other warlords in the coalition. He became known as an incompetent leader that made poor use of his resources and was too indecisive to be effective. The coalition fell apart and Yuan Shao turned back to being warlord of the northern territories. He did not last very long as Cao Cao 曹操 sought to eliminate him and bring the entire northern China under his rule. \n\n\n\n\nCharacter ability 1: \"Chaos Strike 乱击 (luàn jī)\"\n\nDuring your action phase, you can choose to discard any 2 on-hand cards with the same suit as RAINING ARROWS 万箭齐发.\n\n\n\nCharacter ability 2: [Ruler ability] [Enforced ability] \"Bloodline 血裔 (xuè yì)\"\n\nYour limit for on-hand cards at the end of your turn increases by 2 for every one Heroes 群雄 character (other than yourself) still in play.\n\n\n\nAbility's relation to story:\n\nYuan Shao's use of arrows is already mentioned in my post on RAINING ARROWS 万箭齐发. As for \"Bloodline\", it has already been mentioned that Yuan Shao is descended from a high-ranking official. The game makers are simply borrowing that link to label this ability.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Leading the coalition of forces against Dong Zhuo. There were at least 10 different warlords in the coalition with troops numbering half a million or more. Even before Dong Zhuo took the Emperor hostage, Yuan Shao was adamant in killing off the corrupt officials that caused the decay of the dynasty. In a way, Yuan Shao is not a bad guy: he just does not make a very effective leader.\n\n\n\n2. Cause of death - Cao Cao defeated Yuan Shao at the battle of Guan Du 官渡之战, which became highlighted as a prime show of Cao Cao's superior strategy and tactics. Yuan Shao had a force many times larger than Cao Cao, but yet he suffered a terrible loss. Cao Cao analyzed Yuan Shao as being unwilling to listen to his advisors, stubborn, and tolerating general disunity under his rule. Yuan Shao did not die in battle, but he did not live long after either. As a show of respect for his former friend, Cao Cao paid his respects at Yuan Shao's tomb later on.\n\nFAQ and Disambiguation\n\n1.Can the ruler character card(i.e.yuan shao,liu bei,cao cao etc)use their ruler ability in game even though their role is not ruler?(i.e.they are rebel/loyalist/villian)\n\nAns:No they cannot.Ruler ability only applies when their role is Ruler.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"páng-dé-庞德","name":"Páng Dé 庞德","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_wvqe4VkSW-UmHUUaAUxgQyNdNJAoNPgSf5hPkZLlXGz8QgjCy_BwLPqWe1C823EpNaFho3nEWjv4c_f5JvLFl065VVbXuq3AbXCuP6bi8L9pgj5i9Mg2_w0kTSCJStrD7xYvLU8B0BpL/s320/qunpangde.jpg","text":"\nTranslated description:\n\n\"Ride and Rider as One 人马一体 (rén mǎ yì tǐ)\"\n\n\nWikipedia link: Pang De Wiki\n\n\n\nWho is he:\n\nThe rider on a white horse, Pang De is a very capable military general that served under Ma Chao 马超 and his father, Ma Teng 马腾. After the death of Ma Teng, Pang De and Ma Chao resisted the attacks of Cao Cao 曹操 but were unable to hold on to their city of Han Zhong 汉中. Ma Chao fled to join Liu Bei 刘备 in Shu Han 蜀汉 while Pang De surrendered to Cao Wei 曹魏. Cao Cao thought highly of Pang De and gave him a high position in the military. However at the battle of Fan Cheng 樊城之战, Pang De's loyalty came into question. This was because his old partner Ma Chao and his elder brother were aiding the enemy in that very siege. To prove his loyalty, Pang De kow-towed to Cao Cao till his head bled and brought along his own coffin into battle to prove that he would rather die than return defeated. Pang De did not succeed and was executed by Guan Yu 关羽.\n\n\n\n\nCharacter ability 1: [Enforced ability] \"Horsemanship 马术 (mǎ shù)\"\n\nYou will always have a -1 distance advantage (default \"-1 horse\" equipped).\n\n\n\nCharacter ability 2: \"Fearsome Advance 猛进 (měng jìn)\"\n\nWhenever your ATTACK 杀 is evaded by DODGE 闪, you can discard one of your opponent's cards (on-hand or equipped).\n\nNote that Pang De selects the card for discarding and not the opponent. \n\n\n\nAbility's relation to story:\n\nPang De has always been known for his superb horsemanship and is even nicknamed the White Horse General for his white steed. Therefore \"Horsemanship\" is no surprise. \"Fearsome Advance\" on the other hand, does not seem to have any appreciable link to the story. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Carrying his coffin into battle. The coffin is intended to send a message to Cao Cao that either Guan Yu or himself will be in the coffin by the end of the battle. This establishes his determination and loyalty to Cao Wei. It is also awesome fodder for a dramatized story.\n\n\n\n2. Cause of death - Pang De was eventually caught by Guan Yu when Fan Cheng became flooded due to the torrential rains. Pang De refused to kneel to Guan Yu or surrender. Guan Yu had no alternative but to execute him.\n\nFAQ and Disambiguation\n\n1. If Pang De attacks Zhao Yun and an \"attack\" is used to \"dodge\", does his ability still activate?\n\nAns:Yes it does.\n\n\n2.Does Pang De gets to pick up a card from the deck if the target Pang De attacks has only one dodge on his hand?\n\nAns: No.Pang De cannot draw a card from the deck using his ability. It should never happen.\n\nIf the victim has no more cards onhand but have cards equipped,the equipped cards can be dismantled too. If the victim has no cards left whatsoever, then Pang De will not get to use his ability.\n\n\n3.If Pang De attacks a character that has Eight Trigrams armor equipped, and the character successfully judges an auto-dodge,can Pang De then use his ability to destroy that armor?\n\nAns:Yes, he can.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yán-liáng-&-wén-chǒu-颜良文丑","name":"Yán Liáng & Wén Chǒu 颜良文丑","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgMo1Kjbz2eZXXG6uB8TjkIzOn02GKnsVI3SnWKzuroF7tgtrNhaqatUBjqukPsGsDRNX5NCmcyqd_hq22asmCdpGIYb9oTQaPwQE_YMFbuTEsEmhLRMxaBsKCFVMCB8J-po4juiPLD6uJ7/s320/qunyanliangwenchou.jpg","text":"\nTranslated description:\n\"Tiger & Wolf Brothers 虎狼兄弟 (hǔ láng xiōng dì)\"\n\nWikipedia link: Yan Liang & Wen Chou Wiki\n\nWho are they:\nThe top 2 military generals under Yuan Shao 袁绍, Yan Liang and Wen Chou were good friends and were said to be equal in combat skills. The story did not give them much air time, but enough mention was made to highlight their ability. Under the early coalition led by Yuan Shao, a formidable opponent called Hua Xiong 华雄 challenged the coalition and killed many generals. Yuan Shao lamented that both Yan Liang and Wen Chou were not around, else they would surely destroy Hua Xiong easily. Later parts of the story did not mention both Yan Liang and Wen Chou together in combat, but these two are typically associated. It does seem like their capabilities were over-promised as both fell victim to Guan Yu 关羽.\n\n\nCharacter ability: \"Dual Heroes 双雄 (shuāng xióng)\"\nDuring the drawing phase, you can choose to forfeit the drawing phase and opt for a judgement card to be flipped. Unlike usual judgement cards, this particular judgement card can be kept into your hand. Note the colour of the suit (black or red) of this judgement card. For the rest of your action phase, you can choose to use any on-hand card with a different colour from this judgement card as DUEL 决斗.\n\nAbility's relation to story:\nVery little relation can be drawn from the story linking DUEL to these two characters. All that is known is that both of them are commonly referred together as a pair, thus the name \"Dual Heroes\".\n\nAdditional info based on story:\n1. Most famous achievement - Neither of them had much notable achievement, except their leader Yuan Shao's praise for them.\n\n2. Cause of death - Both were killed by Guan Yu in battle. Yan Liang had his head severed by Guan Yu and brought back to Cao Cao 曹操 during the battle at Bai Ma 白马之战. Guan Yu was virtually unopposed as he charged straight towards Yan Liang. With one blow he struck down Yan Liang, then severed his head and brought it back by tying it around his horses neck. Wen Chou was killed in a subsequent battle. His troops fell into disorder after Cao Cao cunningly left numerous horses for Wen Chou's troops to plunder. Cao Cao's generals attacked in the midst of the disorder and Wen Chou was forced to flee. However, Guan Yu was waiting at his retreat route and they fought a few bouts. Wen Chou retreatedly hastily, but Guan Yu was riding the Red Hare 赤兔 of Lu Bu 吕布, whose speed allowed him to catch up to Wen Chou and slay him from behind.\n\nFAQ and Disambiguation\n\n1.Will Duel(black card) work on Jia Xu?\n\nAns:No.Once Duel heroes is used,YL&WC can choose to use on-hand cards as DUEL is a tool card,regardless of what the actual is.(For example:You use a black ATTACK card as DUEL.It is no longer seen as a basic card, but instead is now a tool card.) Therefore Jia Xu will still not be affected.\n\n\n2.Does the player gets to literally keep the judgement card or he just keeps it to create duels, then after it's discarded?\n\nAns: The player literally gets to keep the card.\n        For instance, if the judgement card was a PEACH, he gets to keep the PEACH card, and he can  \n        choose to use that PEACH card in his turn.\n        In short, his card intake for that round will be 1(instead of the usual 2), and that 1 card is the judgement \n        card.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-jiǎo-张角","name":"Zhāng Jiǎo 张角","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvJnnN2nJl63wcBZxl_taL60612ityKFH07rn1CTGHn2HyX-hWYeC2kOR_PbAGgilqWzgO6R756U_tgYNrnFK7ghS_kqhGob7iguerVCuG98y8HUbNeomRSLn5baU2yxAw5yUbcZgVVPG2/s320/qunzhangjiao.jpg","text":"\nTranslated description:\n\n\"General of Heaven 天公将军 (tiān gōng jiāng jūn)\"\n\n\nWikipedia link: Zhang Jiao Wiki\n\n\n\nWho is he:\n\nThe leader and inciter of the yellow turban rebellion, Zhang Jiao became a hero to the those suffering under the corrupt and decaying Han Dynasty 汉朝. Due to a terrible famine that hit China at around 180 AD, the people suffered terribly and yet were further tormented by corrupt and greedy officials. It was then that Zhang Jiao met a strange old man in a cave which gave him 3 books, said to contain the ways of a mysterious art. After mastering the books, Zhang Jiao could control the wind, rain, and lightning and became a sorcerer. Despite having these powers, Zhang Jiao won the hearts of the people by providing aid and supplies to those in need. It was thus that tens of thousands rallied behind Zhang Jiao in his bid to overthrow the Han Dynasty. He never succeeded however, and was defeated by those who were loyal to dynasty, namely Liu Bei 刘备 and Cao Cao 曹操.\n\n\n\n\nCharacter ability 1: \"Lightning Strike 雷击 (léi jī)\"\n\nWhenever you use a DODGE 闪 card, you can target any player to make a judgement. If the judgement card is of the \"spades\" suit, the target player suffers 2 units of lightning attribute damage. \n\n\n\nCharacter ability 2: \"Dark Sorcery 鬼道 (gǔi dào)\"\n\nYou can exchange the judgement card of any player before it takes effect with any of his \"spades\" or \"clubs\" suit cards (on-hand or equipped).\n\n(Note that the cards are exchanged, meaning Zhang Jiao can retrieve the original judgement card back into his hand.)\n\n\n\nCharacter ability 3: [Ruler ability] \"Amber Sky 黄天 (huáng tiān)\"\n\nAll Heroes 群雄 characters can give you one DODGE or LIGHTNING 闪电 card during their individual turns. \n\n\n\nAbility's relation to story:\n\nIn the story, there wasn't much mention of Zhang Jiao himself. From what is written, it is known that can he control the weather (like Storm from X-Men). Therefore \"Lightning Strike\" is a direct link. There is no mention of any form of deception or intervention such as \"Dark Sorcery\", however. \n\n\n\n\"Amber Sky\" actually has a link to the story. Part of the slogan of the Yellow Turban Rebels goes something like this:\n\n\n\n\"The Dynasty is dead, arise the Amber Sky 苍天已死, 黄天当立\"\n\n\n\nwhere Amber Sky is a celebratory designation that Zhang Jiao gave himself, akin to calling himself the Amber Emperor.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Inciting the Yellow Turban Rebellion and opening the epic Three Kingdoms story. Zhang Jiao appears in Chapter 1 of the story and his valiant efforts in galvanizing the people led to the rebellion. This rebellion is critically important as it marked the beginning of the end of the Han Dynasty, though the rebellion itself fizzled away quickly. \n\n\n\n2. Cause of death - Unknown! It was only written in a passing statement that Zhang Jiao had died, and no reference was made as to who killed him and how. The story then put the focus on Zhang Jiao's brother Zhang Bao 张包 and his battle with Liu Bei 刘备.\n\nFAQ and Disambiguation\n\n1. How do we arrange the judgement card exchange ability between Zhang Jiao and Si Ma Yi when they are in play?\n\nAns: The sequence  in which judgement tinkering works is as follow (according to SGS online game)\n\n-Imagine the players turns go anticlockwise from player A to B to C etc..Up to H. Now imagine player B is Si Ma Yi and player H is Zhang Jiao.\n\n-Say player A draws a judgement card ,the 1st tinkerer allowed to change the card is player B(Si Ma Yi) ie. following direction of gameplay. After that player H (Zhang Jiao) can change the judgement card that Si Ma Yi  laid down.\n\n-Once the ''cycle'' goes back to player A, the tinkering ends. Which means both tinkerers only have ONE CHANCE to change the judgement card , and who changes first is determined by their sequence  in the gameplay.\n\n\n2. Whose ability comes first when Zhang Jiao use Dodge against Pang De's attack?\n\nAns: Zhang Jiao performs lightning strike BEFORE Pang De gets to discard Zhang Jiao's cards . The reason for this is as follows (based on the chinese instruction on the cards):\n\nZhang Jiao's lightning strike  takes place before the conclusion of the DODGE 闪结算前 whereas Pang De's ability states when an Attack has been DODGED(杀被闪抵消时). Thus it appears that Zhang Jiao's lightning strike take precedence.\n\n\n3.Will Zhang Jiao's ability come into play twice if he uses a dodge card?\n\nAns: Yes, he can use Lightning Strike TWICE if he uses 2 dodge cards.\n\n\n4. If Zhang Jiao has the Eight Trigrams armor equipped , does that count as a dodge?\n\nAns: Yes it does. If Ba Gua Zhen judgement is Red, it is equivalent to having used a dodge, and Zhang Jiao can use Lightning Strike with it.\n\n\n5. I know that Zhang Jiao can use his ability to exchange judgement cards, but say he is a victim of Acedia and Rations depleted, since its equipped to him, can he use his ability to use those cardsto exchange the judgement cards?\n\nAns: Yes he can. For Ration's Depleted 兵粮寸断, the user of judgement needs to open a Clubs to dodge the effects so ''Zhang Jiao 张角'' an use his ability to ''cheat'' the effect. However , for ''Acedia 乐不思蜀 '' the user requires a Hearts to escape the penalties and ''Dark Sorcery  鬼道'' ONLY allows you to change the judgement card into black(Spades or clubs) which makes Zhang Jiao 张角 100% to fail judgement if he changes it.\n\n\n6. If Zhang Jiao is in a state of Rations Depleted ( which means the tool card is equipped to him) and if somebody attacks him, zhang jiao dodges, forces judgement. NOW since Rations Depleted is a dark suit card , and is equipped to him , can he use THAT card to exchange the judgement?\n\nAns: Time-Delay Tool cards such as ''Acedia 乐不思蜀'' and Lightning 闪电 belongs to no one regardless of its user and position. Reason being Time-Delay  Tool cards are still tool cards just that they stay in play until they take effect (eg. Guan Yu can't possibly use his Red Duel 决斗 card in the middle of a duel as an ''ATTACK 杀'' in the middle of duel if he runs out of ATTACK 杀)\n\nHowever , i may be wrong , so feel free to dispute my claim\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yú-jí-于吉","name":"Yú Jí 于吉","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-HPxDxdl4rxuEAV54zZs9KX1XhJspcAZWm6yZzhQBQ9yIY0ELiN2uYAs7Pfk8gZ7O4EmEfjpDdlhGw90_wRaHRPtbsTH8QZM3aA4CkIux_5hU5UQQy7bNePk9SzYHQwfkavo6Zvsq2yMu/s320/qunyuji.jpg","text":"\n\nTranslated description:\n\"Priest of Supreme Peace 太平道人 (tài píng dào rén)\"\n\nWikipedia link: Yu Ji Wiki\n\nWho is he:\nThis Daoist priest had only half a chapter's air-time, but his impact on the story was enormous. If not for Yu Ji, Sun Quan 孙权 would not have become ruler of the Wu Kingdom. While Sun Ce 孙策 was still alive, the officers of Wu Kingdom gathered around an old Daoist priest  one day. Sun Ce was very averse to superstition and became extremely upset that his people were listening to hocus-pocus nonsense. That Daoist priest, Yu Ji, was thus thrown into prison, which greatly alarmed many officers and citizens. Till then, Yu Ji has constantly been healing the sick with magic for free and has done a lot of social good. Sun Ce refused to pardon Yu Ji and ordered him executed. Alas, the magic of Yu Ji cursed Sun Ce and Sun Ce began seeing apparitions of Yu Ji everywhere he went. It was thus that Sun Ce went mad and died from a ruptured wound.\n\n\nCharacter ability: \"Bewilder 盅惑 (zhōng huò)\"\nWhenever you use a Basic Card (like ATTACK 杀, PEACH 桃 etc.) or Non-Time-Delay Tool cards (such as DISMANTLE 过河拆桥, NEGATE 无懈可击 etc.), you can verbalize the intended card but play the card faced down on the table. If nobody doubts the authenticity of the card, the card takes the effect as verbalized. If there is (are) any player(s) that doubt the authenticity of the card, the card must be flipped over to expose the true identity of the card.\n\n- If the card is real, every player that expressed doubted will lose 1 unit of health.\n- If the card is a fake, every player that expressed doubt gets to draw 1 card from the deck.\n\nRegardless whether the card is real or fake, the card is rendered useless as long as it has been flipped over UNLESS the card is both real and has a suit of \"hearts\", in which case the card still is effective.\n\nAbility's relation to the story:\nYu Ji never actually spread any stories or propaganda in his time alive, but Sun Ce simply refused to believe it. Thus the basis of the ability \"Bewilder\" comes from Sun Ce's accusation that Yu Ji was bewildering his citizens.\n\nAdditional info based on story:\n1. Most famous achievement - Controlling the weather. Yu Ji was asked by Sun Ce to prove that he was no trickster by summoning the rain amidst a drought. Yu Ji successfully brought the rain, which came in torrents and flooded the city, but still Sun Ce was not appeased.\n\n2. Cause of death - Executed in public by Sun Ce. After bringing the rain, Sun Ce ordered Yu Ji beheaded. His officers pleaded on behalf of Yu Ji, which enraged Sun Ce further. He questioned all within earshot if they were revolting because of this priest, and no one dare speak up after that. After Yu Ji was executed, Sun Ce had his body displayed in public for all to see, but the corpse mysteriously vanished the following day. Thereafter, Yu Ji haunted Sun Ce till he became mad and died.\n\nFAQ and Disambiguation\n\n1. Will a card be rendered useless or effective if it's true identity is ''heart'' peach but is verbalised as Attack Card?\n\nAns: The will be rendered useless because it was a bluff.\n\nThe sequence follows the following order of steps:\n\nStep 1 : Authentic or bluff?? Bluff=card rendered useless(regardless of suit),Authentic=Go to step 2\n\nStep 2: Is the authentic card of a heart suit?No=card rendered useless, Yes= card still effective.\n\n\n2. If i used an attack card that was'nt heart, and I said it was an attack, but people doubt it, they will get hit once,but the attack I used will not work anymore?\n\nAns: Yes that is correct.\n\n\n3. If I use an attack card, and no one guessed it was a bluff, it gets used as an attack card even if it is'nt a heart?\n\nAns: Yes that is also correct.\n\n\n4. If no one doubted the card, do you have to flip it over after the effect is used?\n\nAns: This is arguable. A friend of mine plays the online version, and in that version the bluff card is exposed after conclusion of effect. However in our ''real-life'' version, our house rules are a card that was never doubted will never be exposed. his prevents other players from counting probability. I'm calling this one as dependent on house-rules.\n\n\n5. Do we need to specify our ATTACK element if the enemy has Rattan Armor?\n\nAns: Yes. if the enemy has Rattan Armor, you will need to specify your ATTACK element. If you verbalise a FIRE ATTACK but in reality is a normal attack, it is considered that you lied.\n\n\n6. If he plays a card face down and it is the actual card and Cao Cao is on the field. Cao Cao declared it as a bluff, but since it was wrong would Cao cao take the card since Cao Cao is damaged?\n\nAns: No Cao Cao cannot take the card that is a fake. The reason is due to Cao Cao's ability description . He can only pick up the card that caused him damage. In Yu Ji's case, it is Yu Ji's ability that caused the damage, and not the fake card. This is identical to 貂蝉 Diao Chan using ''Seed of Animosity 离间'' against Cao Cao , where if Cao Cao suffers damage, he cannot pick up the card that Diao Chan used.\n\n\n7. If the bluff card was fake and suit of heart, and people called it, it is rendered ineffective and the players who called the bluff draw a card or they don't? Because it is a heart card?''\n\nAns: As long as it is a fake, the card will be rendered useless once the bluff is called. It does not matter even if it is heart-suit. The players who call your bluff get to draw 1 card each. The heart-suited card ONY works when the card is real.\n\n\n8. If Yu Ji plays Dodge facedown, even though it is real, and it gets doubted, does Yu Ji lose 1 life since his 'dodge' becomes useless, which is unable to dodge the attack?''\n\nAns: This is correct ONLY IF that dodge is not heart suit.\n\nOnce any card is under doubt and flipped over, it becomes useless(which in your scenario, the dodge is wasted and Yu Ji needs to use another dodge card to evade the attack) unless the suit of the card is heart, in which case the card is still effective(which in your scenario, if the dodge card flipped over is heart suit, Yu Ji does not need another dodge.)\n\n\n9. If SiMa Yi called his bluff , and it was a real card, and he gets hit, does he still get to take a card from Yu Ji, and is he able to take the bluff card?\n\nAns: Sima Yi cannot take any card from Yu Ji . The reasin is Yu Ji's ability causes the victim to ''lose a unit health''. It is akin to the victim being stupid enough to guess wrongly, and therefore the damage is due ti his own fault.\n\n\n10. Can Yu Ji bluff time delay cards such as Bing Liang Cun Duan , Le Be Si Shu, lightning etc?\n\nAns: Nope . Those are the only cards he cannot bluff.\n\n\n11. How does expression of doubt work? One after the other by turn order, or must everyone give an answer at the same time?\n\nAns: The official way that doubt is expressed is by turn order. The official way goes like this:\n\n1. Yuji plays a card upside down.\n2. Player using Yuji asks the player on his right, '' do you doubt this card?''\n3. Reply must be obtained before going to the next player.\n4. All players must be asked.\n\n\n12. Can the player that plays Yu Ji doubt his own card?\n\nAns: No he cannot.\n\n\n13. If Yu Ji 于吉 plays a hearts ''PEACH 桃'' and Cao Cao曹操 doubts it, so the card is revealed. Since the card is true and hearts , Yu Ji gains 1 life. Since the card is true, Cao Cao 曹操 loses 1 life and takes the peach. In this case Cao Cao 曹操 is in a sure win situation? Coz if Yu Ji 于吉 lies, Cao Cao 曹操 still gain one card.\n\nAns: Cao Cao CANNOT take the Peach card?\n\nThe reason is Cao Cao loses a unit of health due to Yu Ji's ability. It is not the Peach card that causes him to lose health.\n\nTherefore when Cao cao loses health whenever he guesses Yu Ji's cards wrongly he will never pick up any of the cards.\n\n\n.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"dǒng-zhuó-董卓","name":"Dǒng Zhuó 董卓","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj2WQAGxASjIzqvCC12ObEWY1ExFwtdyiQaazo2vP9tFLiISc6mWW-W5jseUcsTO6tMZsY2MJ4R9ASKOiC47LZThflISituyaxWhFNmdHnF7ZeDFFjFEK6wndgvJ-SH3iPXytlTE0Dbeanh/s320/qundongzhuo.jpg","text":"\n\n\nTranslated description:\n\"Demon King 魔王 (mó wáng)\"\n\nWikipedia link: Dong Zhuo Wiki\n\nWho is he:\nDespite the unpopularity of Cao Cao 曹操 or Si Ma Yi 司马懿, people give due credit to their accomplishments. Dong Zhuo, on the other hand, is unpopular to the point of hatred. He was a general with a bad name before he answered the call to rid the Emperor of the corrupt officials. In the ensuing chaos, the young Emperor and his half-brother was separated from their guards and loyalists. By a stroke of luck, Dong Zhuo found the Emperor and used the opportunity to seize power. He proclaimed himself Chancellor and brutally executed those who opposed him. Nobody, not even the Emperor, dared to speak out against him. From then on, the Imperial palace became Dong Zhuo's garden of sin. He ate and pampered himself as if he was Emperor, even slept on the Emperor's bed and raped the palace maids and concubines. His thirst for lust would become his downfall as a wedge was driven between him and his foster son (and his greatest military general) Lu Bu 吕布, thanks to the appearance of the beautiful Diao Chan 貂蝉.\n\n\nCharacter ability 1: \"Drown in Wine 酒池 (jiǔ chí)\"\nYou can use any of your on-hand cards with a suit of \"spades\" as WINE 酒.\n\nCharacter ability 2: [Enforced ability] \"Garden of Lust 肉林 (ròu lín)\"\nWhen you use ATTACK 杀 on a female character and vice versa, the targeted character needs to use 2 DODGE 闪 cards to successfully evade the attack.\n\nCharacter ability 3: [Enforced ability] \"Disintegrate 崩坏 (bēng huài)\"\nAt the end of every turn, if your health is not the least or amongst the least, you must lose 1 unit of health or reduce his maximum health by 1 unit.\n\nCharacter ability 4: [Ruler ability] \"The Tyrant 暴虐 (bào nüè)\"\nWhen other Heroes 群雄 characters cause any damage to other players, you can flip a judgement card. If the judgement card is the suit of \"spades\", Dong Zhuo will regain 1 unit of health.\n\nAbility's relation to story:\n\"Drown in Wine\" is based on him abusing his status and indulging in alcohol. It can be assumed that the palace is in large supply of wine and that Dong Zhuo will drink himself happily silly every night.\n\n\"Garden of Lust\" is interesting. We know that Dong Zhuo is every woman's nightmare: burly, ugly, smelly, lusty, but powerful. Female characters would be at a disadvantage against a brute like him, thus the penalty of 2 DODGE cards. However Dong Zhuo's downfall was also due to a woman! The game makers penalized him by according him the same disadvantage. Very clever on their part!!\n\n\"Disintegrate\" might be referring to his indulgent days ebbing away his ability to do anything else. The story never specifically pointed this out, but I suppose this is what the game-makers intended. Either that or they just needed a reason to justify giving him 8 units of health!\n\n\"The Tyrant\" has little basis in the story and is probably created to counter the effects of \"Disintegrate\"\n\nAdditional info based on story:\n1. Most famous achievement - Killing the \"Emperor\". Dong Zhuo replaced Emperor Shao 汉少帝 with Emperor Xian 汉献帝, then confined Emperor Shao and his mother. As the coalition led by Yuan Shao 袁绍 began stirring trouble for Dong Zhuo, he grew weary of keeping Emperor Shao alive. He forced the ex-Emperor, his mother and their servant to commit suicide by drinking poison.\n\n2. Cause of death - Killed by his foster son, Lu Bu. After Diao Chan is betrothed to Dong Zhuo, Lu Bu becomes irrational with jealousy. It became easy for Wang Yun 王允, the mastermind, to convince Lu Bu to kill Dong Zhuo and take Diao Chan for himself. By tricking Dong Zhuo into thinking that the Emperor was going to abdicate the throne to him, they managed to lure Dong Zhuo into the palace unarmed. The troops were ordered to kill Dong Zhuo, and in a panic Dong Zhuo cried out to Lu Bu for help. The disloyal Lu Bu promptly impaled Dong Zhuo by the throat.\n\n\nFAQ and Disambiguation\n\n\n1. Can Dong Zhuo use his 4th ability if he is not the Ruler?\n\nAns: No he cannot.\n\n\n2. When can wine be used?\n\nAns: Wine can only be used when his life reach ZERO. So when his health is 6, he cannot use Wine to increase his life. Only Peach can do that. On the other hand,Wine can be used at any time with Attack  to increase damage.\n\n\n3. Can a judgement card be drawn if Dong Zhuo is the ruler and a Hero character attacks him and caused a unit of damage?\n\nAns: Yes the Ruler ability disregards who the victim is . Therefore when any heroes character cause damage to anyone ,even to Dong Zhuo himself, he can flip a judgement card.\n\n\n4. If a hero does more than one damage(ie wine attack or barbarian), does he get to draw judgemnet based on each individual damage dealt, or just once?\n\n\nAns: If Barbarians was used as  \" Heroes  群雄 '' player, every single player that gets damaged will result in Dong Zhuo drawing judgement. If there was 7 other players who are damaged by Barbarians , Dong Zhuo can flip judgement 7 times. Same apply to Raining Arrows and other multi-player damage cards.\n\n\n\n\n\n\n\n5. What happens if Zhou Tai is in play, and his health is at -1, and Dong Zhuo's health is at 1, would he have to kill himself?\n\n\n\n\nAns: Yes. Provided Dong Zhuo has been around so long that his health and health limit has been reduced to only 1 unit . If Zhou Tai is still around in his perpetual brink of death status , Dong Zhuo would have to kill himself !\n\n\n\n\n\n\n\n6. If Dong Zhuo is the ruler then how much health he gets ?\n\n\n\n\nAns: He gets 9 units of health .\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"jiǎ-xǔ-贾诩","name":"Jiǎ Xǔ 贾诩","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgdJyLIR7mTRCxx1MCFCIpdwhfxRh3sUKU1BnE6r-eh0R81Rw0pzgMVcvM_nJYRPJoxZmjKI-VP8EoNiOeQmLSBGCBVqB0LaeAvjPirypRNRJUEFR3VYPjfKOZrVlsQkgMukHQYbu4CHmuw/s320/weijiaxu.jpg","text":"\n\n\nTranslated description:\n\"Cold-blooded Advocate for Murder 冷酷的毒士 (lěng kù dè dú shì)\"\n\nWikipedia link: Jia Xu Wiki\n\nWho is he:\nHis description portrays him as a mass-murderer, and history seems to back that up. After the death of Dong Zhuo 董卓, Jia Xu adviced Li Jue 李催 to take advantage of the chaos in Chang An 长安 and grab the Imperial power for himself. This would prove to be the biggest black mark on Jia Xu's life as Li Jue and Guo Si 郭汜 went on a rampage in Chang An, killing and abducting innocent civilians, burning and robbing property. Later historians place the blame squarely on Jia Xu for the holocaust. The fact is Jia Xu is an incredibly gifted advisor whose predictions have come true many times. The sad thing is his leaders did not always listen to him! While serving under Cao Cao 曹操, Jia Xu was one of the rare few who did not support the attack on Sun Wu 孙吴. Not heeding this advice, Cao Cao later met with disaster at Red Cliffs 赤壁之战. Years later while serving under Cao Pi 曹丕, Jia Xu again advised a defensive strategy instead of supporting Cao Pi's attack on either Sun Wu or Shu Han 蜀汉. Once again, his advise proved to be correct as Cao Pi was not victorious.\nCharacter ability 1: [Enforced ability] \"Unmitigated Murder 完杀 (wán shā)\"\nDuring your turn, with the exception of yourself, only characters who are on the brink of death (health equals zero or less) can use PEACH 桃.\n\nCharacter ability 2: [Single-Use Ability] \"Descend into Chaos 乱武 (luàn wǔ)\"\nDuring your action phase, you can force every player, other than yourself, to use an ATTACK 杀 on another player at the least distance away. If a player is unable to do so (no ATTACK cards to use or attack range cannot reach any player), the player will lose 1 unit of health. Recipients of the ATTACK need to use DODGE 闪 to evade. This ability will proceed in succession starting from the player on your right.\n\nCharacter ability 3: [Enforced ability] \"Behind the Curtain 帷幕 (wéi mù)\"\nYou cannot become the target of tool cards with the suit of \"clubs\" or \"spades\".\n\nAbility's relation to story:\nNo direct link is made to \"Unmitigated Murder\", though it can be inferred that the game makers want to add drama to this \"cold-blooded murderer\". \"Descend into Chaos\" is referring to the massacre at Chang An carried out by Li Jue and Guo Si.\n\n\"Behind the Curtain\" is interesting. Jia Xu happens to be the longest-living advisor in the Three Kingdoms Era, and the reason for this is rather unglamorous. He is remembered as someone who will save his own ass before the higher purpose. Numerous times he has switched allegiance as his leaders started to fail, finally ending up at Cao Wei 曹魏 till his death. Even then, Jia Xu stayed away from expressing emotions that would compromise his true thoughts. In his later years he became a recluse, and did not even speak in private to anyone else. The \"Curtain\" in this case is his silence and evasive character, making him less susceptible to ploys and schemes. Thus the ability is apt for him since it makes him impervious to a large number of tool cards.\n\nAdditional info based on story:\n1. Most famous achievement - Advising Li Jue to Guo Si to take the empire for themselves. Eventually Lu Jue and Guo Si tore each other apart and Jia Xu prudently distanced himself from them.\n\n2. Cause of death - Jia Xu died of old-age at the age of 77 years old. Not bad for a public enemy, don't you think?\n\n\nFAQ and Disambiguation\n\n1. For ability 1, does this mean if Jia Xu attack the RULER who begins with 1 life and drops to 0 , only the RULER can use PEACH to save himself , and that nobody else can use PEACH to save the RULER?\n\nAns: Yes only the RULER can save himself. It does not even have to be damage caused by Jia Xu . For example , if Jia Xu was a Loyalist and he attacks Zhang Jiao, but Zhang Jiao uses his Lightning strike ability to strike the ruler, whose health reduces to zero , nobody else except Jia Xu can use PEACH to save him. So this can be potentially disastrous if the consequences are not properly thought through.\n\n\n2. For Ability 2, Jia Xu  is 1 distance away from Player A, and Player B is 1 distance away to the right of Player A . If Jia Xu forces Player A to attack , and both Jia Xu and Player B are equidistant from Player A , who gets to choose who gets hit?\n\nAns:  The player who is executing the ATTACK gets to choose , which means there is a chance that Jia Xu himself  will be the target of ATTACK from the 2 players on his left and right .\n\n\n3. For Ability 3, what happens if a club Lightning passes through him ? Would it immediately move from the player to his left to the player to his right? Or would it be discarded as soon as the player on his left was done with it?\n\nAns: Assuming the direction of play is anti-clockwise , once the Lightning moves into Jia Xu's zone from the player to his left,it immediately skips him and move to the player on his right. The rules for removing Lightning from  play applies : only Dismantle ,Steal, or the Lightning strikes someone will the card be removed from the play area.\n\n\n4. How often can single-use abilities be used?\n\nAns: It can only be used once PER GAME.\n\n\n5. Can Jia Xu's tool card be Negated by other player?\n\nAns: Black negate do have an effect on Jia Xu's tool card. This is because the negate is use on the tool card and not on Jia Xu himself.\n\n\n6. Do barbarian cards has an effect on Jia Xu?\n\nAns: Both barbarian cards are black, therefore they have no effect on Jia Xu.\n\n\n7. Can a Dismantle target Jia Xu's horse and equipment count as targeting Jia Xu?\n\nAns: Using Dismantle on his equipment still counts as targeting Jia Xu( Since these belongs to him)\n\n\n8. Can Yu Ji use his ''Bewilder '' skill to play ''colourless'' Barbarian to attack Jia Xu?\n\nAns: Yes, Yu Ji cards when played faced down are all suitless and colorless .They will work on Jia Xu\n\n\n9. When Xiao Qiao uses Barbarian that is spade suit, will it be regarded as a Heart Barbarians by everyone including Jia Xu?\n\nAns: yes all of Xiao Qiao's ''spades'' cards are viewed as ''hearts'' .So even though she uses a spade Barbarian ,it will be regarded as a Heart' Barbarian by everyone .Therefore it will work on Jia Xu.\n\n\n10. If the second ability activates and someone gets hurt because he could'nt attack anyone(no attack or no range) does Jia Xu gets the rewards and punishment for causing that damage?\n\nAns: For 2nd ability (Descend into Chaos 乱武) if a player dies because he is unable to use Attack, nobody gets to draw any rewards or punishment.\nNote: If a player dies during this ability because he is a victim of another player's attack , the player that use the Attack becomes the source and  gets all the rewards/ punishment accordingly.\n\n\n11. During ''Descend into Chaos 乱武' ability, does the player being attacked need to use dodge or suffer yet another damage?\n\nAns: Yes . The player being attacked needs to use Dodge or suffer damage.\n\n\n12. Can Da Qiao deflect the attack skills for Jia Xu's Ability 2?\n\nAns: Yes, Da Qiao can use her ability normally.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"gāo-shùn-高顺","name":"Gāo Shùn 高顺","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikNqyDL6W6f-KW9FCxnMmZkLe75lN8mvQfmqgIznD8uDkzPgPZ_GF7CK3sLm07OSsXInIIaZAkoLWDwc4gJfqIcz5VhqqXLUfKm5iacIvCxyUwjaz9jQOEu_do-ms7PyqSs3rA3MC5irGw/s320/gaoshun.jpg","text":"\n\n\n\nTranslated Description:\nNo Siege is Unsuccessful 攻无不克 (gōng wú bù kè)\n\nWho is he:\nHis illustration looks scary enough. Is he some kind of ancient Chinese Ghost-rider on a horse? Maybe Vin Diesel behind a Slipknot mask, carrying a butcher knife as wide as a cow? What we know about Gao Shun is that he is a serious man of few words and strict discipline. Here is a military general in ancient China that abstains from alcohol, unheard of! He was one of the most respected generals serving under Lu Bu 吕布 and a man of integrity he was. Gao Shun took no bribes and put on no airs, but he had a fearsome presence that commanded immediate respect. The only thing he did less than talk (which he rarely did) was to drink wine. Gao Shun is also known to rebuke Lu Bu straight in the face when Lu Bu makes stupid decisions, but yet Lu Bu would not follow Gao Shun's advice. \n\nGao Shun has very little air time in the story, and most records of him are historical. Yet for what little air-time he was given in the story, Gao Shun was made partially responsible for one very prominent Wei general losing his eyeball. Can you guess which general?\n\n\nCharacter ability 1: Ambush 陷阵 (xiàn zhèn) \nDuring your action phase, you can Points Duel with another player. \n\nIf you win, you possess the following abilities till your turn ends.\n- Disregard any distance between you and that player\n- Disregard any equipped armor of that player.\n- You can use as many ATTACK 杀 cards as you wish on that player.\n\nIf you lose, you cannot use any ATTACK cards for the remainder of this turn.\n\nLimited to one use per turn.\n\nCharacter ability 2: Abnegation 禁酒 (jìn jiǔ) [Enfored ability]\nAll your WINE 酒 cards must be regarded as ATTACK cards. \n\nAbility's relation to the story:\n\"Ambush\" does not seem to relate to any one particular incident in the story. The ability does seem to point towards Gao Shun's famed attacking ability. My personal feel about this ability is that it is extremely offensive and a choice of the Rebels 反贼! Particularly those who are at a distance too far away to strike the Ruler 主公. So if you are the Ruler, beware any player who chooses this character. Keep him bound and toothless for as long as you can!\n\n\"Abnegation\" is a spin on Gao Shun's refusal to drink alcohol. The ability creator had a lot of different cards to replace WINE, but the choice to use ATTACK as a replacement was probably to further increase his offensive ability. Thankfully, the balance is he is unable to use WINE + ATTACK anymore, Phew!\n\nAdditional info from the story:\n1. Most famous achievement - In Lu Bu's heyday, Gao Shun was sent to bout with Xia Hou Dun 夏侯惇 when the latter was sent by Cao Cao曹操 as reinforcement to rescue Liu Bei 刘备. Both the able generals went equally matched for \"half a hundred bouts\" before Gao Shun appeared to weaken. Gao Shun turned away from the duel and retreated, but the blood-thirsty Xia Hou Dun gave chase. Unbeknownst to Xia Hou Dun, Gao Shun's compatriot Cao Xing 曹性 lay in ambush and shot an arrow that pierced Xia Hou Dun's eye. \n\nAs was already known, Xia Hou Dun yanked out the arrow with his eyeball still on it, promptly swallowed his own eyeball, then skewered Cao Xing's face with his spear. Gao Shun gave chase on a wounded Xia Hou Dun, and eventually succeeded in chasing off the Wei forces.\n\n2. Cause of death - As Lu Bu come under siege from Cao Cao, Lu Bu refused to take the advice of his advisor Chen Gong 陈宫. The indecision and poor choices of Lu Bu led to his downfall. Gao Shun, along with Chen Gong and Lu Bu were all captured and brought before Cao Cao. Gao Shun kept mum and never spoke a word, much less plead for mercy. Cao Cao then promptly executed him.\n\nWiki Link:\nGao Shun Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"chén-gōng-陈宫","name":"Chén Gōng 陈宫","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj9_ENH3JYgZtdFjfoZLYBXFvajRAxTyYBiftThbAzQIKwJv0gHr6BoYsTuKy-qeTxAq4WjyBz5kOxu3VSdkd34JYylTgLwAYcWvoh-y7TScacUb_zYtI8pBurnIdYylejFEe0gUcYhnit2/s320/chengong.jpg","text":"\n\n\nTranslated Description:\nUpright and Heroic 刚直壮烈 (gāng zhí zhuàng liè)\n\nWho is he:\nHere is an intelligent advisor with great capability that, regrettably, served under a mediocre leader, Lu Bu 吕布. Chen Gong aided Lu Bu with sound and prudent advice, but it was Lu Bu who chose not to heed them. Chen Gong would have preferred to work under a stronger leader like Cao Cao. Possibly one of the first few people to see Cao Cao 曹操’s ruthless nature, Chen Gong was first introduced to the story as a magistrate of a county. One fateful day, a lone fugitive stumbled into his county and was recognized by the guards on duty. This fugitive was none other than Cao Cao, wanted throughout the land for the attempted murder of Dong Zhuo 董卓. The guards brought Cao Cao in front of Chen Gong, where Cao Cao lied about his identity and claimed to be a merchant. Chen Gong put Cao Cao in jail and proclaimed that he would bring Cao Cao to Dong Zhuo and receive his reward.\n\nSecretly, however, Chen Gong had a lot more on his mind. Chen Gong despised Dong Zhuo and admired Cao Cao's courage in his murder plot. That very night, Chen Gong did the unthinkable and left his post as magistrate. He then escaped from the county with Cao Cao (the magistrate escapes with the fugitive!) in hopes of working with Cao Cao and achieve great things.\n\nHowever, just three days after the escape, Cao Cao would do something so unthinkable that Chen Gong would forever abandon his dreams of working with him. What heinous act did Cao Cao do? Read on to find out!\n\n\nCharacter ability 1: Brilliant Scheme 明策 (míng cè)\nDuring your action phase, you can give an equipment card or an ATTACK 杀 card to any other player (the recipient). The recipient must then choose between 1 of 2 options.\n\n1. This action would be viewed as having used an ATTACK on another player of your choice within the recipient's attacking range.\n\n2. Draw a card from the deck.\n\nLimited to one use per turn.\n\nCharacter ability 2: Cerebral Delay 智迟 (zhī chí) [Enforced ability]\nWhenever you receive damage during another player's turn, any ATTACK or Tool cards (except Time-delayed tool cards) have no effect on you until that turn ends.\n\nAbility's relation to story:\nThe mechanics of \"Brilliant scheme\" is not based on any particular strategy employed by Chen Gong in the story, however this ability is incredibly clever! It definitely does justice to the intelligent advisor that Chen Gong was in his lifetime. By selecting option 1 of the ability, Chen Gong is able to strike almost any player in the entire game (you can give the card to any player), without having to use an ATTACK during his turn. The nasty thing about this ability is that Chen Gong gets to pick who to attack AFTER the recipient chooses option 1. Chen Gong can easily flip sides if he is the DEFECTOR and backstab his teammates at the most crucial moment. Brilliant!!\n\n\"Cerebral Delay\" is quite messed up. According to the story, the words 智迟 was not a compliment to Chen Gong at all. It was used to describe Chen Gong as having fantastic analytical and intellectual capability, but needing to take a very long time before his strategies are conceived. In fact my initial translation for this ability was called \"Sluggish Wisdom\", which is a good fit to the story but a terrible clash for the ability mechanics. For whatever reason, the ability creator gave Chen Gong the ability to \"delay\" (\"abort\" is more accurate) damage dealt unto him. Thus I thought I would give the translation a touch of X-men while still keeping closely to the literal meaning of the Chinese words (智 = intellect, 迟 = late or to delay).\n\nAdditional info based on story:\n1. Most famous achievement - Technically what I shall write in this paragraph isn't an achievement, but more a significant highlight that burned into the reader's mind. After Chen Gong escaped with Cao Cao, they needed to find shelter and stay low. Cao Cao recommended that they stay over at his uncle's nearby. His uncle was an aged old man who, despite knowing that Cao Cao was a fugitive, immediately offered both of them shelter and lodging. As is Chinese custom throughout the years, wine is a necessity to welcome guests, what more people of stature such as Cao Cao and Chen Gong. The uncle promptly left to procure wine on his donkey. While the two fugitives sat, they overheard knives being sharpened in the adjacent room and someone saying \"bind before killing\". The overly paranoid Cao Cao feared they were being betrayed by his uncle. Both of them rushed into the household and slaughtered the entire family. All in all, eight innocent lives were murdered, after which the fugitives saw a pig in the backyard that was meant for the sacrifice.\n\nOnly then did they realize they were mistaken, but it was too late. Lives were lost, and they had to escape again. In the dark of night, they encountered his uncle making his way home after purchasing wine. The poor uncle, still oblivious to the fact that his entire family lay dead at home, insisted the pair stay for dinner before leaving. Cao Cao brandished his sword and promptly killed his uncle to silence the only witness, thence he spoke his most famous line:\n\n\"I would rather betray the entire world, than to have the entire world betray me.\"\n\nChen Gong realized he was on the run with a ruthless and cold-blooded monster, and he part ways with him the next morning while Cao Cao was still asleep. Their paths would cross again in the coming future.\n\n2. Cause of death - Despite giving Lu Bu prudent advice to counter Cao Cao's invading forces, Lu Bu chose to lull in indecision. The defeat of Lu Bu was inevitable, as Cao Cao's forces were dispatched with the sole purpose of crushing him. Chen Gong was captured and Cao Cao offered him a place to serve under his leadership. Chen Gong refused and chose death instead. Cao Cao was impressed by Chen Gong's integrity, and chose to take care of Chen Gong's family after beheading him.\n\nWiki Link:\nChen Gong Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cài-wén-jī-(lady-cai)-蔡文姬","name":"Cài Wén Jī (Lady Cai) 蔡文姬","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCZ5804AJzYs_8G2HvsuTDX1BqahVb-SVBZ7iM0N0cve_UGDpa4iXrjg7xOxKyrqemuVpY2jl8SlV8gB0B3X6oVoI2hFbrLut55C-844qhSEOTz1k5YM6acElG2a4Vj4OWxn0RAXeQsWlP/s320/caiwenji.jpg","text":"\n\n\nTranslated description: \n\"The Lone Dame in Foreign Lands 异乡的孤女 (yì xiāng dè gū nǚ)\"\n\nWho is she:\nLike a scene out of a Chinese horror movie, a lone damsel sits in the night out in the woods, strumming an ancient Chinese string instrument. Her long straight hair gently swaying along with the willows, her sharp face pale, white and mournful. Who is Lady Cai? What is her role in the story? Truth be told, the name Cai Wen Ji was complete new to me when I heard about this character in the Hills Pack. As it turns out, she was a very minor character, a musician and poet, but with a sad life story. Married at the age of 15 but widowed soon after, she was then held captive by the Xiong Nu 匈奴 clan chieftain for many years. He then made her his wife and she bore him children, but her heart had always yearned for home. It would be 12 years later before a particular famous warlord ransomed her... but only to fulfill his own agenda. This warlord would go on to become one of the most famous person throughout Chinese history. Who was this warlord? Read on the find out!\n\nCharacter ability 1: \"Dirge 悲歌 (bēi gē)\"\nEvery instance a player suffers damage from an ATTACK, you can discard a card (on-hand or equipped), and the player who suffered the damage flips a judgement card.\n\nIf the judgement is \"hearts\", the victim regains 1 unit of health.\nIf the judgement is \"diamonds\", the victim draws 2 cards.\nIf the judgement is \"clubs\", the attacker discards 2 cards.\nIf the judgement is \"spades\", the attacker flips his/her character card over.\n\nCharacter ability 2: \"Sorrow 断肠 (duan chang)\" [Enforced ability]\nThe player who kills you loses all of his/her character abilities until the end of the game.\n\nAbility's relation to story:\nThe ability mechanics do not have a direct link to the story, but the names of the abilities do. Both \"Dirge\" and \"Sorrow\" relates to the life of Lady Cai. After being imprisoned by the Xiongnu nomads, she composed a series of famous musical pieces known as the \"Eighteen Songs of a Nomad Flute 胡笳十八拍\". Later in her life, she wrote some poems with a sorrowful tone, lamenting her turbulent life. See? What did I tell you? The perfect character for a sorrowful female apparition!\n\nAdditional info based on story:\nMost famous achievement - Composing poems and pieces of music. Lady Cai was a talented poet and musician. After her unfortunate capture by Xiongnu nomads, she composed \"Eighteen Songs of a Nomad Flute\", a sorrowful song in the style of nomadic tunes.\n\nIt was 12 years later that she was ransomed Cao Cao 曹操, yet Cao Cao did so for his own objectives. She was to a become a pacifier to the spirits for her clan, as by that time Lady Cai was the last surviving member. Even then, Lady demonstrated her memory and was able to recite about four hundred of her father’s lost works of poem and songs.\n\nCause of death - Unknown. There has been no record of her death, but her legacy lives on. Almost 500 years later, a series of paintings were commissioned by the first emperor of the Song Dynasty called \"Eighteen Songs of a Nomad Flute\". It is said that some fragments of these 18 paintings survive till this day in Boston Museum of Fine Arts.\n\nWiki Link:\nCai Wenji Wiki\nEighteen Songs of a Nomad Flute\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zuǒ-cí-左慈","name":"Zuǒ Cí 左慈","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPXvzNobkozss1Tu8cyS5B-t9Tyhh6sRpD9_rPL1OKMmV3KyvmWqqPGkqkO3q6uD39EbjXyUWRh3bpvOckUhvqYJ7YXVSeJVuz5Z3oTcUF4Ii6oSAaHQfWAke-GZA0mtBvF5cwYKi-MGse/s320/zuoci.jpg","text":"\n\n\nTranslated description: \n\"The Mystical Immortal 迷之仙人 (mí zhī xiān rén)\"\n\nWho is he:\nEver watched \"X-Men\" the movie? Remember the villain femme fatale known as \"Mystique\"? Well, here's the SGS version of Mystique! Without doubt one of the most interesting but controversial characters in SGS, Zuo Ci is currently the most popular character in the Hills Expansion Pack. But who is the real Zuo Ci, and why does he have X-Men like abilities? Alas, that question is very difficult to answer!\n\nIn the information available about Zuo Ci, be it on Wikipedia or on sites about Chinese \"history\", Zuo Ci has very little factual information left today. Whatever facts there are, they are diluted in the vast quantities of myth that surround this strange old man. For example, Zuo Ci was said to have lived to 300 (!) years old, and can walk through walls. There! See?? David Copperfield was not the first to walk through the Great Wall after all!!\n\nCharacter ability 1: \"Shapeshift 化身 (huà shēn)\"\nAfter everyone has selected their character cards, you select two unused character cards randomly from the deck. Select one of these two characters and place it before you, then state one of that character's abilities (excluding Single-use ability, awakening ability and ruler ability). You will obtain the stated ability, the allegiance, and the gender of this character until you have replaced it. At the beginning and end of each turn, you can replace the character with another character and/or re-state another ability.\n\nCharacter ability 2: \"Germinate 新生 (xīn shēng)\"\nFor every 1 unit of damage you receive, you can acquire another new character card for \"Shapeshift\".\n\nAbility's relation to story:\nA wonderful link to the story... err... myth. Zuo Ci was said to wield the ability to shapeshift into anything. According to both historical texts and ROTK, he used this ability to escape from Cao Cao 曹操. When Cao Cao sent his troops to arrest Zuo Ci, he concealed himself among a flock of sheep. The game mechanics allowed the immortal to \"shapeshift\" as other characters, using their abilities freely in the game. To learn more about Zuo Ci's strange abilities, read my previous post on Mystic Cipher.\n\nThe phrase \"新生\" literally means “new life” in Chinese. It was said that he told his apprentice that he would make a mystical potion in the mountains, and he left this world as an immortal afterwards. However, the game mechanics do not grant Zuo Ci the ability to resurrect like Pang Tong, but he can get a new form to shapeshift instead. For this reason, this ability was initially translated as \"Metamorphosis\", to show the ability of “getting a new form” while suiting the literal meaning. On the other hand, I felt that the game creator was alluding to the biological ability to regenerate and grow. I think of it as chopping a leech in two, then ending up with two live leeches instead, double the trouble! Thus I translated this ability as \"Germinate\" instead.\n\nAdditional info based on story:\nMost famous achievement - Teasing Cao Cao with his sorcery, which forms the basis of this character's ability. Zuo Ci was said to be able to transform into sheep, or into any other person on the street. Eat that David Blaine!!\n\nCause of death - Unknown. Perhaps he isn't dead. He's supposed to be immortal... right? *Eyes that sheep in the zoo suspiciously*\n\nWiki Link:\nZuo Ci Wiki\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"diāo-chán-貂蝉-(sp002)","name":"Diāo Chán 貂蝉 (SP002)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi62JADybjF_OAQe9aiW6yxupLBPwfJBsQgX-P5-tJdooS34bYqcQYJpMiZxrLw3XtOpv4YctISNFZ2dBBTGwvAmzB-OPvX5UgaEq0D0FEg_MTlAXCX2SqRY5TxAQbuKEplBqtCe79smumD/s320/spdiaochan.jpg","text":"\n\n\nTranslated description:\n\"The Dancer with Unrivaled Beauty 绝世的舞姬 (jué shì dè wǔ jì)\"\n\nWhy is she an SP character?\nI would love to say that some sexually-charged up SGS fanatic demanded for a sexier Diao Chan from YOKA. I would also love to say that YOKA is giving SGS a complete erotica makeover and the next character is Zhen Ji 甄姬 in a bikini.\n\nBut no, these aren't the reasons why this 2nd version of Diao Chan was released. The reason is as bland as chewing on cardboard.\n\nAfter the 1st issue of Zhuo You Zhi 桌游志 (ZYZ) was published, it was said that YOKA decided to keep with the promotion of giving away a new character card with every issue. They had on hand this alternate drawing of Diao Chan and decided to release it with the 2nd issue of ZYZ. That's all.\n\nBummer. I would have loved to see Sun Shang Xiang in a bunny suit.\n\nCharacter ability 1: \"Seed of Animosity 离间 (lí jiān)\" \nDuring your action phase, you can discard one card (either on-hand or equipped) and select two male characters to undergo DUEL 决斗 with each other. This ability cannot be neutralized using NEGATE 无懈可击. Limited to one use per turn.\n\nCharacter ability 2: \"Envious Moon 闭月 (bì yuè)\" \nAt the end of your turn (after the discard phase), you  can draw one additional card from the deck.\n\nWhat's different from the original character?\nOnly the drawing has changed. This alternate drawing has been affectionately referred to as the \"out-of-bathroom\" Diao Chan 出浴貂蝉. But why didn't they just give her a bathrobe and nothing else then? Aww!!!\n\nEverything else about this character is identical to the original Diao Chan. Her abilities and allegiance remain the same, thus this character would inconspicuously blend into your current set unnoticed.\n\nHow to obtain this character?\nPurchase ZYZ magazine issue #3 (March 2011). This issue is also out of print. You can probably get your hands on it if you got LOTS of dough to spare.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"gōngsūn-zàn-公孙瓒-(sp003)","name":"Gōngsūn Zàn 公孙瓒 (SP003)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiSQeQIShQ_9s948W_bxz1ZcZHyA-4n-Ep8nEWbFBu4Pk5m2854NjlNvwvIbndvc1Hm_gigGI_GFa4A6D8I2-2yU_3xPpIGU6KxJbVIvJDV8EmiH499569JtwZMxeIxiwnRSBPCztQulVF0/s320/spgongsunzhan.jpg","text":"\n\n\nTranslated Description\n“The Whitehorse General 白馬將軍 (bái mǎ jiāng jūn)”\n\nWho is he?\nAmong the starry sky composed by the heroic legends during the period of the Three Kingdoms, the Whitehorse General Gongsun Zan was like a bright meteor, illuminating the darkness in the north part of China. However, coming in a hurry like a real meteor, he disappeared from history in a hurry as well. Between his\ndiligence, good looks, education, and a noteworthy resonant voice, he caught the eye of a royal member of the Han dynasty, who married his daughter to him. He spent the first half of his life crusading against the nomadic tribes in northern China, and each tribe there was afraid of his name. He had a strong preference for white horses: he chose three thousand horsemen as his elite troops and allocated the soldiers with white horses, earning his title of Whitehorse General. But alas how did such a handsome and competent General fall to such dramatic ruin? Read on to find out!\n\nWhy is he an SP character?\nUnlike characters with SP versions due to a change of allegiance (like Sun Shang Xiang 孙尚香), or minor revisions (like Diao Chan 貂蝉's portrait), Gongsun Zan is a new addition. As such, his abilities don’t allow the same level of cooperation as other characters (e.g. Liu Bei 刘备, Zhuge Liang 诸葛亮 and Huang Yueying 黄月英, etc.). KayaK, one of the founders of SGS, said: “People should not compare the abilities of the SP characters with the normal ones, it’s not comparable. I know that Gongsun Zan’s abilities may be way too weak comparing to other expansions, but that’s why we chose him to be a SP character, it’s a proper way to introduce him to the game.”\n\nOk KayaK, we get the idea. Now let's bring on the firepower!\n\nCharacter ability: “Righteous Cavalry 义从 (yì cóng)” [Enforced ability] \nWhen your health is more than 2 units, you have -1 distance in any range calculations. When your health is equal or less than 2 units, you have +1 distance in any range calculations.\n\nAbility's relation to story\nThe design of Gongsun Zan’s ability reflects perfectly the character’s whole life experience: first half of his life as a brave young general and last half of his life as a cruel conservative dictator. When Gongsun Zan was just deployed to Youzhou (a state in northern China, including a part of Beijing, a part of Tianjin and the south part of Liaoning Province), he led his Whitehorse cavalry to quell rebellions and won honor; in his last years he just locked himself behind the solid walls and stored lots of grain with him - only\nwomen and boys under seven years old were allowed to come into his fortress.\n\nAdditional info based on story:\n1. Most famous achievement - Gongsun Zan was famous for his preference of white horses and his Whitehorse Cavalry. At first the Cavalry was just his personal guards, then it became the top 1 light cavalry during the Three Kingdoms period. With these excellent mounted troops, he even made the Huns, who have been always famous for their horsemanship, be afraid of meeting him and his Whitehorse cavalry.\n\n2. Cause of death - I would say the real cause of his death was his vanity, cruelty and tyranny. He used to be a hardcore warmonger, and then he lost all his fighting spirit and his mercy. In the end he was surrounded by Yuan Shao 袁绍 in the luxury grave he had made for himself and finally committed suicide. The legend of the Whitehorse Cavalry faded away in history as well.\n\nWiki Link: \nGongsun Zan Wiki\n\nUsage Tips:\nThe ability of Gongsun Zan relies on the range calculation (both attack and defense). So even if you were sitting beside him with a crossbow in your hand, after making his HP drop to 2, you could not keep attacking anymore. But for the characters whose abilities don’t rely on range, like Xiahou Yuan 夏侯渊, Zhou Yu 周瑜 and Diao Chan, that wouldn’t be a problem. And a series of AOE from Cao Cao 曹操 would be a death threat to Gongsun Zan as well. Interestingly, the ability of Yuan Shao, who killed Gongsun Zan in history, can help him kill Gongsun Zan in the game easily too.\n\nHow to obtain this character?\nHe is available on SGS online now! (But VIP only) For obtaining a card, purchase ZYZ magazine issue #4 （April 2011).\n\nContributing Writers:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yuán-shù-袁术-(sp004)","name":"Yuán Shù 袁术 (SP004)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgf9rZKnq2ruHEy-Ut-oE4oB_w9Cvc8ndnEyqrO8Ut0nyLQNprTjM1Nja4x-pxi8j9yflfvttTOHcSd5S6v-HIQaWnXGIYtkKzV-a0L2_zS7CzjoIzgTXDCVV_tiWLcgcBch4wQEpU5wFIV/s320/spyuanshu.jpg","text":"\n\n\nTranslated Description \n“The Emperor of Zhong Dynasty 仲家帝 (zhòng jiā dì)”\n\nWho is he?\nAn overweening ambitious younger brother. A terrible general. An opportunist. An immature politician. Alas, a daydreamer without a happy ending. Born from a noble, rich, powerful and ancient family as the only son of the first wife, Yuán Shù seemed to have nothing to worry about in his life. But even with such little talent, he was arrogant enough. He considered himself as the only right person to conquer the world, that’s why he couldn’t even get along well with his half-brother, Yuan Shao 袁紹. He was always searching for the right opportunity, and he finally found it when Dong Zhuo 董卓  was defeated by Sun Jian 孫坚. The imperial seal (the symbol of the legitimate ruler in China) was in the Sun family’s hand, but Sun Jian was quickly killed and Yuan Shu put Lady Sun under house arrest to force the seal out of  Sun Ce 孫策's hands. After getting the seal, he declared himself emperor under his short-lived Zhong Dynasty in 197, which instantly made him everyone’s enemy.\n\nWhy is he an SP character?\nCherry: I honestly don’t know! Because his family name is Yuan? one of the biggest noble families in ancient China? Because he’s Yuan Shao’s younger brother? Because he had such a terrible reputation at that time? Because he is one of the only two characters during the Three Kingdoms period that had absolutely no good titles according to all the Chinese historians? (The other would be Dong Zhuo of course) Or, just because his character abilities are super difficult to translate and to explain in English? But there is at least one thing for sure, that no matter in real history or in the SGS game, he is just an annoying and troublesome guy. Wondering why? Just play and find out yourself!  \n\nRicky: I guess one possible reason is because there are only so few \"unlikeable\" characters in the story. Like Cherry mentioned, there is the ancient Chinese equivalent of Jabba the Hutt, Dong Zhuo. The only other would be the useless and selfish Yuan Shu. No better way to shame him for all eternity by giving him horrid playability in a card game.\n\nCharacter ability 1: “Mediocrity 庸肆 (yōng sì)” [Enforced ability]\nDuring your drawing phase, you draw an extra X cards, X being the total number of allegiances still in play. During your discard phase, you must discard at least as many cards as there are allegiances still in play. If you have less cards than there are allegiances, you must discard all of them.\n\nNote: Allegiance here refers to Shu, Wei, Wu, or Heroes.\n\nCharacter ability 2: “The Pseudo-Emperor 偽帝 (wěi dì)” [Enforced ability]\nYou possess the ruler ability of the current ruler.\n\nAbility Tips:\n1. X, in Yuan Shu’s case, does NOT mean the total amount of players, but number of Allegiance. For example, before your drawing phase starts there are Shu, Wei, Wu and Heroes characters alive, you draw 6 cards (X = 4, so additional 4 cards on top of your normal 2 cards). \n\n2. During your discard phase, if there’s only a Shu, Wei and Heroes left in the game (3 allegiances), you must discard at least 3 cards, BUT you must also discard any number of cards in order to keep your hand equal to or less than your current health units. You can choose to discard your equipped cards.\n\n3. Example: During your discard phase there are 3 allegiances in play, you have 2 equipped cards and 5 on-hand cards, and you have 3 units of health. You can choose to discard your 2 equipped and 1 of your on-hand cards (to match the ability constraint of 3 cards discarded), but you’ll still need to throw away one more card because your total on-hand cards is higher than your current health. Or, you can keep your equipped cards and throw away 3 on-hand cards, reducing your number of on-hand cards to below your current health and complying with the constraint of your ability. Any mix of discarded equipped and on-hand cards is possible, as long as it obeys both the specific ability rule and the game’s general rule.\n\n4. Another example: During your discard phase you have 1 card on-hand and 1 equipped, and there are 3 allegiances left in the game. You need to discard both your cards, which means you would have absolutely NOTHING left.\n\n5. Yuan Shu doesn’t have any RULER ability! (The frame of his card is white, not yellow as the other characters that have ruler abilities.) “The Pseudo-Emperor” is just his ability. If the current ruler has no ruler ability, or you choose Yuan Shu as the ruler, you would have only his first ability. And in any case, you would always be considered as a neutral hero.\n\n6.The ruler ability you have would be exactly the same as the current ruler. For example, the current ruler is Cao Cao 曹操, you can use “Royal Escort 护驾”, which means you can ask any Wei character, including Cao Cao himself, to use DODGE 闪on your behalf when applicable.\n\nAbility's relation to story\nHis first ability “Mediocrity” represents perfectly his personality but mixed with an overindulgent lifestyle. He is just an ordinary person with little intelligence, but he’s too greedy, always dreaming about the things he cannot handle. Finally, because of his overindulgence, he lost everything including his own life. Although he declared himself as an emperor, he never got recognized even by his own forces. Ironically, he still hasn’t been recognized 1800 years later! In SGS, although he has the ability “The Pseudo-Emperor”, he is still not one of the ruler characters.\n\nAdditional info based on story:\n1. Most famous achievement – Being arrogant and stupid? Stealing the imperial seal? Declaring himself emperor when the emperor of Han Dynasty was still alive? Fighting against his brother? Making his people poor and starve all the time? Well, I suppose his biggest achievement is having absolutely no achievement. He was nothing but a son from Yuan family, was that fortunate? Or unfortunate? \n\n2. Cause of death - After declaring himself emperor, he was besieged by all the warlords at that time, especially Cao Cao, Liu Bei 刘备 and Lü Bu 吕布. In 199, he gave the imperial seal to his brother Yuan Shao, and tried to seek refuge. Yuan Shao sent his son Yuan Tan 袁谭 to Yuan Shu's rescue, but it was too late, Yuan Shu's forces were destroyed by Liu Bei. Yuan Shu died of grief shortly thereafter.\n\nWiki Link:\nYuan Shu Wiki\n\n\nUseful Tips:\n1. Always keep in mind that you need to discard more cards than others, so don’t use your cards too indulgently. Otherwise you might find yourself with nothing left after your discard phase.\n\n2. You are the only character in SGS that can discard equipped cards during your discard phase, so make good use of your equipment: choose the proper ones and save the others for your discard phase; if you are injured, don’t forget to throw the equipped Silver Lion Helmet 白銀獅子away to get 1 unit of health back.\n\nHow to obtain this character?\nOh he’s one of the most popular characters on SGS online now! (Of course VIP only, or you can just buy it in SGS online market) For obtaining a card, purchase ZYZ magazine issue #5 (May 2011).\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"mǎ-chāo-马超-(sp011)","name":"Mǎ Chāo 马超 (SP011)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZtQJ1pF0FUxlJnSSn4YYWqvz_0yPm6CNE2Kkusx2eYIyCmaxMfPWCYxMgJMrxWWPNLeUCkBYjWDdpRrS96GMLMmiqi4nelCF0IIYHlUhomWekXoQd7bm68JcdrOMsX2PxyKMicoTF-vtT/s320/sp+machao.jpg","text":"\n\n\nTranslated Description:\n\"The Lion of the West 西凉的猛狮\"\n\nWho is he?\nCao Cao 曹操 once said: “If Ma Chao does not die, I am going to meet a terrible end.” That gives you an idea of how strong Ma Chao was. He was one of the Five Tigers in Shu Kingdom in fiction, which was pretty close to factual history. Prior to that, Ma Chao was extremely aggressive fighting against his nemesis, the man who slew his entire family: Cao Cao. That explains why he eventually decided to join Liu Bei’s campaign.\n\nWhy is he an SP character?\nHe used to be one of the biggest warlords in west and had a strong reputation even before he met Liu Bei. Thus for completing the whole world of Three Kingdoms in SGS, YOKA released this \"younger\" version of Ma Chao.\n\nCharacter ability1: “Horsemanship 马术 (mǎ shù)” [Enforced ability] \nYou will always be -1 distance in any range calculations.\n\nCharacter ability2: “Iron Calvary 铁骑(tiě jì)”\nWhenever you use ATTACK 杀 on any target player, you can choose to flip over one judgement card from the deck. If the judgement card is of a red-suit (hearts and diamonds), the ATTACK cannot be evaded with DODGE闪.\n\nAdditional info based on changes:\nNothing changed but his drawing, just like most other SP characters. Too bad about the Magneto-looking helmet though.\n\nWiki Links:\n- Ma Chao Wiki\n\nHow to obtain this character?\nHe isn’t available on SGS online so far! For obtaining a card, purchase ZYZ magazine issue #11 (November 2011).\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"huá-xióng-华雄","name":"Huá Xióng 华雄","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhQ6n9sCgTgj82Tt4bpDh_6oQMzySYhlzz20Ui8Mc0UM_jD8DWe-E_IKIzEO08VKBsm-OsxGqVUyRo4dKzNnvx8-qJQrqD0MZZ6GBFjxmOD4ttMVDF7OPCLhVGv4PR9W_hRkptM59yGKLkd/s320/huaxiong.jpg","text":"\n\n\nTranslated Description:\n\"Demon General 魔将 (mó jiàng)\"\n\nWho is he:\nOn one hand, Hua Xiong is an almost insignificant character in the entire story. You know he is not important by the speed at which he was killed by Guan Yu 关羽, no different from those nameless wrestlers who get trounced by the famous wrestling stars within 5 minutes.\n\nOn the other hand, Hua Xiong very nearly changed the entire course of history early in the Three Kingdoms period. The day before he was cut down by Guan Yu, Hua Xiong came very close to slaying Sun Jian 孙坚, and that could have distorted the future of Wu Kingdom 吴国.\n\nIn the story, Hua Xiong was credited as being a strong combatant, just shy of Lu Bu 吕布's abilities. I guess there was a need to let the heroes of the story (the 3 sworn brothers) take precedence and thus he appeared for a grand total of one miserable little chapter before his head was served on a platter. Wouldn't you be pissed if you were him?? Little wonder that he is one pissed off Demon!\n\nCharacter Ability 1: \"Reckless 恃勇(shi yǒng)\" [Enforced ability]\nEvery instance that you suffer damage from a red ATTACK 杀 or WINE ATTACK 酒杀, your maximum health limit is reduced by 1.\n\nAbility's relation to story:\nHua Xiong was a strong combatant serving Dong Zhuo 董卓. According to records, he looked like a loathsome American superhero (or supervillain), with a body as strong as a tiger, his waist as powerful as wolves, his head as fierce as leopards and his arms as aggressive as gorillas. In fiction, he was assigned as the protector of Si Shui Pass 汜水关, killing many generals of the coalition. He was eventually killed by Guan Yu in a single slash, to reflect Guan Yu's strength. Six max health relates himself to Dong Zhuo. “Reckless” refers to his defeat over Guan Yu. Nevertheless, he lacks playability…\n\nHow to obtain this character:\nHua Xiong is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"liú-biǎo-刘表","name":"Liú Biǎo 刘表","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8_xdJaH1UyAPsK3lhb1Pc_NkTyPJUwecKTEdzIIbmIiiUhUAEdAqxvt-toYai5guZ8SV41o6bfg7cxzOam4wRXukkxO5Rlr3a3uKTz1R4veggP4DYNaCh86D2lOgCzeErz2X_0oLypZ9P/s320/liubiao.png","text":"\n\n\nTranslated Description:\n“Lord of Southern Han 跨蹈汉南 (kuā dǎo hàn nán)\"\n\nWho is he:\nOne extremely important person in the Three Kingdoms era who, serendipitously, created Liu Bei 刘备's power which immortalized the legends of Shu Kingdom. In a nutshell, if not for Liu Biao, Liu Bei would have died prematurely and Cao Cao 曹操 would likely have taken over China.\n\nLiu Biao is a distant-uncle of Liu Bei who ruled over the strategic stronghold of Jing Zhou 荆州. It was Liu Biao's forces that killed Sun Jian 孙坚, father of Sun Ce 孙策 and Sun Quan 孙权. When Cao Cao began to rise to power, Liu Bei betrayed Cao Cao and fled, seeking refuge with Liu Biao. Liu Biao agreed to shelter Liu Bei, however Liu Biao was not highly respected due to his indecisiveness and his inability to exploit his talented generals. Zhuge Liang 诸葛亮 even told Liu Bei not to rest hopes in his uncle for the preservation of the Han dynasty, and that Liu Bei is a much stronger leader himself.\n\nConsequently, Liu Biao came under extreme pressure from Cao Cao's marauding forces sweeping south, and Sun Quan's forces thirsting to avenge his father. He fell sick and died soon after. To add insult to injury, Liu Biao's intention was to let his elder son inherit his position, but his will was changed by his wife and his second son laid claim instead. Soon after, his weakling second son succumbed to pressure from Cao Cao.\n\nCharacter Ability 1: \"Self-preservation自守 (zì shoǔ)\"\nDuring the drawing phase, you may draw additional X number of cards (X being the number of units of health lost thus far), than skip your action phase.\n\nCharacter Ability 2:  \"House of Royalty 宗室 (zhōng shì)\" [Enforced ability]\nFor every allegiance still in play, your on-hand card limit is increased by +1.\n\nAbility's relation to story:\n“Self-preservation” refers to his personality and action. He preserved himself from the conflicts of Cao Cao and Yuan Shao 袁绍. He withdraws from invasion to make Jing Province prosper. Therefore, he can draw more cards (showing prosperity) at the cost of action (without the ambition to invade others).\n\n“House of Royalty” refers to his bloodline. He was a member of the royal family.\n\nAs you may observe, both abilities have relationship with Yuan Shao and Yuan Shu 袁术. Both Liu Biao and Yuan Shu can draw loads of cards because they both govern a prosperous region, which on-hand cards represent resources. Liu Biao can store more cards like Yuan Shao, because they are both born of high rank. Liu Biao is a clansman of the royal family, while Yuan Shao comes from the noble Yuan family. Yuan Shao can only store more cards when he is the ruler, but Liu Biao can store more cards regardless of his role, similar to Yuan Shu (Yuan Shu possesses the ruler ability regardless of his role).\n\nHow to obtain this character:\nLiu Biao is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhao-yun-赵云-(*sp001)","name":"Zhao Yun 赵云 (*SP001)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEir2ECiTtXp7pzR7AB8xWj0tFNKvSyrcI7vi4ThyxrcbXeqCRcFq9Fl_J9CaOqpY-w1J55ILZQztMihBGyEAWyzzV4ayjCxlCQEcyZvmexi-e5dtb0ECiQ7CDozWGkPcdFthM7_32owPml5/s320/2411471_01.jpg","text":"\n\n\nTranslated description:\n“The Vanguard on a White Horse 白马先锋 (bái mǎ xiān fēng)”\n\nWho is he:\nFor goodness sake, this is Zhao Yun! I'm pretty sure you do not need me to describe who he is. But just in case you do, here's a one-sentence summary.\n\nZhao Yun is one of Liu Bei 刘备's most accomplished generals, but while he was younger he was part of Gongsun Zan 公孙瓒's army, thus the Neutral Heroes allegiance here.\n\n\nWhy is he an SP character:\nI'm going to be politically incorrect here. I do NOT think that Zhao Yun needs an SP version. The official reports state that the SP versions are an upgrade so that the original characters will not fall behind.\n\nRubbish!\n\nThe original Zhao Yun is still strong as heck, and has one of the best abilities ever created in this game: creative, adequate, simple. So why do they need to make Zhao Yun unbalanced? Well, I guess everyone will have their opinion. Who knows? I might just like this character after I lay my hands on it.\n\nOr maybe not.\n\nCharacter ability 1: \"Dragon Heart 龙胆 (lóng dǎn)\"\nAll ATTACK 杀 and DODGE 闪 cards can be used interchangeably.\n\nCharacter ability 2: \"Formation Piercer 冲阵 (chōng zhèn)\"\nWhenever you use or play an on-hand card to activate “Dragon Heart”, you can immediately take an on-hand card from the opponent.\n\nNote: \"Opponent\" here refers to either the player who caused you to activate \"Dragon Heart\" (the player that uses \"Raining Arrows 万箭齐发\"), or the person on the receiving end of \"Dragon Heart\" (you use DODGE as an ATTACK on that player).\n\nAdditional info based on changes:\nThis is the young Zhao Yun serving Gongsun Zan, the Whitehorse General. According to Zhuo You Zhi magazine, his 3 units health reflects his immaturity while his new ability reflects his contributions in The Battle of Jie Bridge 界桥之战. In that battle, Yuan Shao 袁绍 rained arrows on Gongsun Zan and almost decimated his entire army. When Gongsun Zan’s was on the brink of collapse, the young Zhao Yun charged into Yuan Shao’s vast army and single-handedly killed Yuan Shao’s general with one strike, with time left to spare to save Gongsun Zan's rear-end.\n\nTrivia:\nZhao Yun became the 3rd character with more than two character cards in SGS. The first was Zhuge Liang 诸葛亮 and the second one was Lu Bu 吕布. Note that the card of young Zhao Yun is two-sided and slightly smaller than the usual character cards. This card is not meant to be shuffled into the character's deck, but rather to be substituted for the original Zhao Yun card if the player chooses to use him.\n\nWiki Links:\nZhao Yun Wiki\n\nHow to obtain this character?\nPurchase the 13th issue of Zhuo You Zhi magazine to get this limited character card as a free gift!\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"diao-chan-貂蝉-(*sp002)","name":"Diao Chan 貂蝉 (*SP002)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZXe7Zaz4Jq5ZDiiTxT6qHG8PZe64LrrJa5FrlJz4UjqPdV5IhrYG7ZzxCTtyHwZDroy_gii2a_uYagjxRPgRzb4xCEjZ1K9TPXjY_6s48tMJp1xFr8ZOug3msT9gMdanLFn7ti2GUALY_/s320/diaochan2012_front.jpg","text":"\n\n\n\n\n\nTranslated Description:\n\"The Malevolent Puppeteer 暗黑的傀儡师 (àn hēi dè kuǐ lěi shī)\"\n\nWho is she:\nThere is only so much I need to say about Diao Chan. She's probably one of the top 10 most famous people in ROTK, as well as in SGS! In the previous version, the artwork is more kiddy, wide-eyed, bambi-like.\n\nNot anymore.\n\nMeet the succubus of ancient China. If looks alone couldn't kill, she can easily seduce another man that gladly will. Personal opinion? I prefer matured, crafty, sadistic women. This Diao Chan... I like.\n\nWhy is she an SP character?\nTechnically speaking, Diao Chan is already over-exposed in SGS. Her 2011 SP version created quite a stir, as so many wanted a glimpse of her fresh out of the shower. Her original ability \"Seed of Animosity 离间\" was perfect as well. Do we really need another Diao Chan?\n\nWell if you read into her new ability in this evil version, it is just absolute evil and merciless. It kind of makes the male victim seem like a useless empty shell really. The closest example I can think of to describe what I feel about the new Diao Chan are the \"Mermaids\" in Pirates of the Carribean: Fountain of Youth. Beautiful, seductive, and absolutely deadly. Oh I love it!\n\nCharacter Ability 1: Soul Surrender 离魂 (lí hún)\nIn the action phase, you can discard one card and flip over your character card. If you do so, you can acquire all the on-hand cards of one male character. At the end of the action phase, you must return that male character one card for every remaining health unit that he has.\n\nLimited to one use per turn.\n\nCharacter ability 2: Envious Moon 闭月 (bì yuè)\nAt the end of your turn, you can draw one card from the deck.\n\nAdditional Info based on changes:\nHer new ability is dangerous both towards her enemy and herself. She can 'focus' her charm towards a male character, claiming their \"soul\" (ie: his on-hand cards) and leaving him totally vulnerable. If you can injure him heavily, or even kill him, good for you. This ability is especially powerful when she gains damaging cards like DUEL 决斗, BARBARIANS 南蛮入侵, RAINING ARROWS 万箭齐发, etc.\n\nAnd let's not forget the carnage she can unleash with the Ancient Scimitar 古锭刀 equipped.\n\nHowever, this ability comes at a cost. Discard one is no big deal since she can easily take over her victim's cards, but flipping her character card will cost her one full turn. \"Envious Moon\" will grant her some extra defense, but one extra card for one turn lost can only do so much.\n\nHow to obtain this character:\nPurchase the 13th issue of Zhuo You Zhi magazine to get this limited character card as a free gift!\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"pang-tong-庞统-(*sp004)","name":"Pang Tong 庞统 (*SP004)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVAwbRT-tVnT_5iYBzPy0xQ4czdCyfaoVCh9F55fgmRhv4WgOgPHpgJ00orVNNNSpN0PtQrqgIE51I4f7mnuwHcmKGUxQTpSe3h9IL46UoBjuCJFOJ5sHc9Nz9VE1BNDauWmP1qvSp_qke/s320/pangtong.jpg","text":"\n\n\nTranslated Description:\n\"Genius of Jing Chu 荆楚之高俊 (jīng chǔ zhī gāo jùn)\n\n(Note: Jing Chu is the ancient name for the area that is Hubei province today.)\n\nWho is he:\nThe first time I came across the original Pang Tong character, a friend commented that his \"Nirvana 涅槃\" resurrection ability was to compensate for the early death of this historically important person. Yet somehow, despite being given \"one life more\" than others, the old Pang Tong could never quite live up to expectations of such a brilliant man.\n\nI think this \"upgrade\" has been well deserved and the tweak has made him seem slightly over-powered. Oh well! Consider it payback for all the neglect that the old Pang Tong suffered. Finally, the phoenix has truly risen!\n\nWhy is he an SP character?\nPang Tong was probably one of the most under-powered characters in the original deck, and subsequently also one of the most under-utilized. I must say that I do adore his \"Shackle 连环\" ability from last time, though this complete makeover is most appreciated.\n\nCharacter ability 1: \"To Hell with Work 漫卷 (màn juàn)\"\nWhenever you are about to receive a card, you must place that card in the discard pile. If this happens within your turn, you can pick up any one card with the same number (Ace to King) from the discard pile and place it in your on-hand cards.\n[Updated 25/04/2012]  \n\nCharacter ability 2: \"Plastered 醉乡(zuì xiāng)\" [Single-Use ability]\nAt the beginning of your turn, you can flip over 3 cards from the top of the deck and place them on your character card. You cannot use or play any card of the same \"type\" (basic card, tool card, weapon card, etc.) as those placed on your character card. All cards of the same type also have no effect on you. For every turn henceforth, you must flip over another 3 cards and place them on your character card, until any 2 cards placed on your character card has the same number (Ace to King). When that happens, all the cards on your character card will go into your on-hand cards.\n\nAdditional info based on changes:\nAccording of ZYZ magazine, his two abilities comes from the story of Pang Tong clearing100 days of leftover work in one afternoon (RoTK Chapter 57). When Pang Tong first joined Shu,  Liu Bei 刘备 sent him to a magistracy to work. Yet in his new position, Pang Tong refused to work (to hell with work!). Scrolls of complaint were accumulated on the table for 100 days and the town was in disarray. Upon hearing this news, an angry Liu Bei sent Zhang Fei 张飞 to check him out. When Zhang Fei arrived, he was surprised to find Pang Tong drunk (plastered). However Pang Tong promptly cleared his 100 days of leftover work in one afternoon without the slightest mistake.\n\nOne interesting trivia here is that both of the abilities have been drawn into the portrait illustration. \"To hell with work\" can be seen with him tossing scrolls worth of work over his shoulders, which is a literal depiction of 漫卷 (Translated: to toss scrolls into the air like you couldn't care less). \"Plastered\" can be seen with him holding a big drinking bowl, a huge vat of wine to his left, and a smile so wide you would think he was at the pub on Friday night.\n\n[Updated 25/04/2012] Left this portion out when I first writing up this article. \"To Hell with Work\" paints a nice analogy, because when someone gives you work, you toss it away like you don't care. In this case, when someone gives you cards, you toss it away too! The mechanism for \"Plastered\" is a smart way for the creator to simulate the character getting drunk. You basically lose a few of your body psychomotor functions after having a drink too many, and this ability replicates that by making you almost useless after \"drinking\" 3 cards. Drink some more and you have the fighting ability of wallpaper. The not-so-children-friendly twist to this is that after drinking a ton of wine, the ability jolts you with a massive stack of cards and you instantly regain all your abilities.\n\nThat... doesn't quite happen in real life.\n\nHow to obtain this character:\nPurchase the 15th issue of Zhuo You Zhi magazine (April 2012) to get this limited character card as a free gift! Or simply click here to purchase it separately through Sino-Games.com!\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"gān-níng-甘宁-(*sp009)","name":"Gān Níng 甘宁 (*SP009)","faction":"heroes","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXda2u-8qhP3QhSU5xNRdZpqwlnej3T911IyKYXUPIOD9B1z8h3c1dK4Pwg47H2sknipvU3L_HFxswLI1PWftRPFsFEyuTfzczDTobytOjQKPUKlxbwA5JRice4XjPmgN4T_SqYPQnXFaY/s320/ganningsp.jpg","text":"\n\n\nTranslated Description:\n\"The Crow with Bells 怀铃的乌羽 (huái líng dè wū yǔ)\"\n\n Why is he an SP character?\nJust as there was a time before Captain Jack Sparrow became \"Captain\", there was a time before the Gan Ning that we know became a proper soldier. You might already know that Gan Ning was a pirate before he joined a proper military. What you probably didn't know was the head-hunter style dress up that he adorned whilst he was plundering the lands; bone-ornaments to adorn their hair and silver bells around their waists. You could almost imagine an aboriginal cannibal from some far-away tropical rain forest. Now how's that for a rags to riches story?\n\nCharacter ability 1: Silver Bells 银铃 (yín líng)\nDuring your action phase, you can discard 1 black-suited card and select another player. If you do so, you acquire 1 card from that player, then place that card on top of your character card. This card will then be known as ”Brocade 锦\". (Max number of Brocades = 4)\n\nCharacter ability 2: Militant's Might 军威 (jūn wēi)\nAt the end phase of your turn, you can discard 3 \"Brocades\" into the discard pile. If you do so, you must ask one player to choice between 1 of 2 options:\n\n1. Display 1 DODGE 闪 card, which you then take and pass to any player.\n\n2. Lose 1 unit of health, after which you select 1 card from that player's equipped items area and move that card out of the game. Once that player's turn has ended, that card that was moved out of the game shall be returned to its original position.\n\nAbility's relation to story:\nJingle bells, anyone? According to records, Gan Ning's victims were so traumatized by his plundering that they shudder in fear whenever they heard the jingling of bells. I guess the ability somewhat symbolizes \"robbing\" another player. Better yet, they gave the loot a fancy-smancy name 锦, which is expensive embroidery and fabric.\n\n\"Militant's Might\" is just a random name for an ability, I guess. I could be wrong.\n\nHow to obtain this character?\nGan Ning (2012) is now available on Sino-Games.com! Click here to purchase.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"}]