[{"id":"liú-bèi-刘备","name":"Liú Bèi 刘备","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhOjLu7CEVVzkDnwqJlOCifTc3n9RpNfxB5vhnDz2gSwMScxOvsfUAWQbs9yhfgpRsQa-6-Vctxy7LF0cW28Ew32-YzAJUDDWoR7AbJNDsGGQbDmUY3PsrBLOEAWqZkDfW9Ov60zRReacGG/s320/shualiubei.jpg","text":"\nTranslated description:\n\"The ambitious leader in tumultuous times 乱世的枭雄 (luàn shì dè xiāo xióng)\"\n\n\nWho is he:\n\nThe \"good\" guy. Liu Bei is the founding ruler of the Kingdom of Shu Han 蜀汉 during the Three Kingdoms Era. The impression of Liu Bei amongst people today depends on which side of the fence they are on. If they are fans of Shu Han and its chivalry, they would say Liu Bei was a benevolent leader, well-loved by his people. If they are not fans of Shu Han, they would say he was too soft and too kind. Either way, the fact is that you cannot possibly know Romance of the Three Kingdoms without knowing Liu Bei.\n\n\n\nCharacter ability 1: \"Benevolence 仁德 (rén dé) \"\nYou can give any amount of on-hand cards to any amount of players in his turn. If the total number of cards given away is 2 or more, you regain 1 unit of health.\n\n\n\n\nCharacter ability 2: [Ruler Ability] \"Rouse 激将 (jī jiàng)\"\nYou can ask any Shu 蜀 character that is in play to use an ATTACK 杀 card for you.\n\n(The attack is considered as being \"used\" by Liu Bei even though the card itself comes from another player. This means the attack properties such as range and element is based on Liu Bei, not the player that issued the card. Of course, Shu characters in play can choose not to use an ATTACK card for him.)\n\n\n\n\nAbility's relation to Story:\n\nLiu Bei is regarded as the benevolent leader in Romance of the Three Kingdoms, usually generous and kind to his followers. The ability to give cards to any player mirrors Liu Bei's generosity.\n\n\n\n\nMatching weapon: \"Gender Double Swords 雌雄双股剑 (cí xióng shuāng gǔ jiàn)\"\n\nLiu Bei's actual weapon in Romance of the Three Kingdoms is a \"pair of ancient swords 双股剑\" and does not have anything to do with gender. The word \"gender 雌雄\" was added by the game makers so as to give this weapon its gender specific ability.\n\n\n\nAdditional info based on Story:\n\n\n\n1. Most famous achievement - Built up the Kingdom of Shu Han despite humble beginnings as a straw-weaver.\n\n\n\n2. Cause of death - Official records is due to dysentery, though the legend goes that he fell sick due to despair and regret for his massive loss at the Battle of Yiling 夷陵之战. Prior to that battle, Liu Bei launched a massive attack on the Kingdom of Sun Wu 孙吴 against Zhu Ge Liang 诸葛亮's advice to avenge the death of his sworn brothers Guan Yu 关羽 and Zhang Fei 张飞. Liu Bei was eventually defeated by Lu Xun 陆逊 and loss nearly all of Shu Han's generals.\n\n\n\nWikipedia links: \n\n\n\n* Liu Bei Wiki\n\n* Battle of Yiling 夷陵之战\n\n\n\n\n\n\nTactics: [By Jonkow]\nRuler (A)\nLiu Bei is a fantastic ruler character(duh, he is after all a ruler-type character...) Anyway, with the \"Benevolence\" he becomes more resilient and harder to kill since he can easily heal 1 hp every turn and after he identifies his allies and enemies he is basically in control of the whole game. Even if his allies are not \"shu\" members, he can easily make use and abuse the fact that he can simply give the cards he drew to his allies to get them to use it on his behalf and simultaneously heal 1 hp making it both difficult to kill him and also difficult to kill his allies. With his \"Rouse\" abiliy, he can just ask his \"ATTACK\" allies to use \" ATTACK \" for him. If you don't understand how awfully overpowering this ability is, you can just imagine him getting Huang Zhong, Guan Yu, Ma Chao, Zhao Yun, Ma Dai and Zhu Rong to use \" ATTACK \" for him.\nPS. If one of your enemies happen to be Zhuge Liang with the \"empty city\" skill just give him a non-\"ATTACK\" card and watch his face contort into a mix of both horror and disgust...\n\nLoyalist (A-)\nIncredible-but-not-as-awesome-as-ruler. He can do the same as above, just give cards to your \"Ruler\" and viola! you get a tough loyalist+ruler combo, however its not very wise to get the ruler to do your dirty job for you since its the \"Loyalist's\" job to get his hands dirty anyway. =)\n\nRebel (B)\nSince we have already established that Liu Bei is a support character i shall not bore you with the details about how he can support. Basically the same formula as above.\n\nDefector (B-)\nNow, Liu Bei in my opinion is a REALLY fun defector character to use. Before you are discovered, you can give players some useless cards to make them think you are their ally while healing yourself when you are attacked. But what if you are discovered? No fear, ya can just \"bribe\" the losing side since Liu Bei is such an awesome support character and everybody loves Liu Bei. However, take extra caution to maintain the balance of the game since if the game starts getting loopsided, you are sure to be the first to die... But nontheless its still incredibly fun to play as a Liu Bei defector.\n\n\n\nFAQ and Disambiguation:\n\n\n''Benevolence''\n1. Can Liu Bei choose not to increase health after giving 2 cards or more?\nAns: No.\n\n2. Can the receiving player refuse to accept the cards?\nAns: No.\n\n''Rouse''\n1. If a Shu Character uses an ATTACK in response to Liu Bei's  ''Rouse'' who suffers the penalty of retaliation or receives the rewards for a kill? The Shu Character who used the ATTACK, or Liu Bei?\nAns:  Liu Bei . He is the source of the attack and will receive all the penalties/rewards.\n\n2. If no player responds, can Liu Bei still use an ATTACK card ?\nAns: Yes if he has not used any ATTACK  prior to using ''Rouse''.\n\n3. If no player responds, can Liu Bei change a different target player and use ''Rouse'' again?\nAns: Yes.\n\n4. If no player responds, can Liu Bei use ''Benovelence'' to give other players cards before using ''Rouse'' again?\nAns: Yes.\n\n5. Is there a limit to the number of times this ability can be used in a turn?\nAns: It depends. As long as an ATTACK card has not been used in Liu Bei's turn to attack another player, ''Rouse'' can be used repeatedly.\n\n6. Can the ATTACK used by a Shu Character (in response to ''Rouse'') carry that character's ability attributes? Eg. Can Ma Chao use ''Iron Calvary '' with his ATTACK?\nAns: It depends on the ability. ''Rouse'' only allows the character to use ATTACK on behalf of Liu Bei. Guan Yu and Zhao Yun can use their abilities to produce an ATTACK card but Ma Chao's ''Iron Calvary'' ability occurs on top of producing the ATATCK card and is therefore not allowed .\n\n7. Can the Shu Character use his weapon attributes when he uses ATTACK?\nAns: Only ''Serpent Halbert'' attribute is allowed since it only involves producing an ATTACK. All other weapon ability's that add-on to the ATTACK is not allowed.\n\n8. Will Liu Bei's weapon attributes be effective when another Shu Character responds to ''Rouse''?\nAns: Yes, as long as it fullfils the ability criteria . Eg: ''Heaven Scorcher Halbert'' ability cannot be used since it is not Liu Bei's card that is used.\n\n9. If Liu Bei equipped ''Serpent Halbert'' , can a Shu Character use any 2 characters as an ATTACK?\nAns: No. The ATTACK card needs to be produced by the character. Remember that producing the ATTACK card is not the same as the weapon ability. (I know its a little confusing)\n\n10. After a Shu Character uses ATTACK in response , can Liu Bei still use an ATTACK card himself  in that turn?\nAns: No. The ATTACK card by the character is considered used on behalf on Liu Bei , so it counts as Liu Bei having already used an ATTACK card in his turn.\n\n11. Can Liu Bei give away the equipped cards?\nAns: No. He can only give his on-hand cards.\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"elder-zhūgě-liàng-暮年诸葛亮","name":"Elder Zhūgě Liàng 暮年诸葛亮","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjsaJkcuhVEoKLvEKII3Q1huuBNpOiJNrcQPSU5V4Y5GkK3103YZNZNWGsZLbDdPm9EWjvqEIOwgRjLtHmDolIV87ZR72HxmiEVGTUrYfsotuMfTjPd8u_lQ6tC7EWX0pgvkB96kfw-wpc6/s320/shualaozhuge.jpg","text":"\nTranslated description:\n\"Prime minister who has passed his prime 迟暮的丞相 (chí mù dè chéng xiàng)\"\n\n \n\nWho is he:\n\n\nThe star of the show, but definitely not the star of the card game. In this San Guo Sha 三国杀 card game there are not 1, not 2, but 3 Zhu Ge Liang to choose from. This elder version is the most subdued and the least god-like. The other 2 are just simply unfairly powerful. Just in case you do not know who Zhu Ge Liang is, he is the military strategist cum intellect extraordinaire to Liu Bei 刘备 and the Kingdom of Shu Han 蜀汉. There is just TOO MUCH to read about Zhu Ge Liang, and i'll leave that to your own reading on Wikipedia.\n\n\nCharacter ability 1: \"Star Gazing 观星 (guān xīng)\"\nAt the beginning of your turn, you can view X number of cards from the top of the deck (X equals to the number of players still in play with X having maximum of 5). Of these X cards, you can choose any number of cards to place at the top or at the bottom of the pile. You can also rearrange the order of the cards.\n\n\nCharacter ability 2: \"Empty City 空城 (kōng chéng)\" [Enforced ability]\nWhen you have no cards on hand, you cannot become the target of ATTACK 杀 or DUEL 决斗.\n\n\n\nAbility's relation to story:\n\nIn Romance of the Three Kingdoms, Zhu Ge Liang is given almost god-like powers that can predict the changes in weather, accurate to within the day that wind directions change. He is able to make these predictions from his knowledge of reading the stars, thus the game ability to \"predict\" what cards are coming up next with his \"Star Gazing\" ability. Ok so its outright manipulation of the cards coming up next, but heck might as well dramatize it more!\n\n\n\nThe \"Empty City\" ability comes from the famous ploy he uses to fool Si Ma Yi 司马懿. As all his troops have been sent out in missions, he was unable to defend himself from Si Ma Yi's attack of his current location (Xi Cheng 西城). In classical reverse psychology, Zhu Ge Liang empties the city, opens the city gates wide to welcome the invaders, and calmly plays the zither atop the gate in full view of the enemy. Si Ma Yi suspects an ambush and thus retreats. To replicate that effect, the game makers gave the player using Elder Zhu Ge Liang unsusceptibility to ATTACK and DUEL when the player has no more cards left to defend himself or herself.\n\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Borrowing arrows with straw boats? There really isn't ONE famous achievement because he has so many!\n\n\n\n2. Cause of death - During a ritual ceremony to extend his life (no kidding!), Wei Yan 魏延 barges in and disturbs Zhu Ge Liang. He dies soon after from the effects of the disturbance.\n\n\n\n\n\n\nWikipedia link: \n\n\n\n* Zhu Ge Liang Wiki\n\n\n\n* Empty City Ruse 空城计\n\n\nTactics [By JonKow]:\nRuler (B+)\n(Elder) Zhuge Liang in my opinion is a pretty normal ruler character, there isn’t really any added bonus when he is the ruler except for the fact that “Empty city” makes him pretty much difficult to kill. With the rattan armour addition he is basically invulnerable to all attacks except “lightning” and character effect damages. Being difficult-as-hell-to-kill just makes him an awesome character for all roles and not just as a ruler. The “Star Gazing” ability gives Zhuge Liang the ability to control the cards he draws as well as probably the next player’s cards. As usual this ability is incredible and every role would benefit from it.\n\nLoyalist (B+)\nWell if your ruler is your “next” player, he is in for a treat, you can support your ruler by giving him the best cards via “Star Gazing” Well, like the above, nothing special.\n\nRebel (B)\nNow Zhuge Liang is not a very good rebel character to play. You might think that “hey, Zhuge Liang is so difficult to kill, he must be overpowered!” Well the way I see it, the rebels are generally easy to identify in a game, having a difficult to kill character would only induce your enemies to kill your allies, as much as you being able to assist them while being difficult-to-kill seems like a good idea, your allies might not be able to survive the heat and would soon be defeated leaving you facing whatever is left of your enemies. The lack of offensive abilities makes Zhuge Liang not very suitable for the role of a rebel.\n\nDefector (B)\nAs much as how I like to play as a defector, and how awesome Zhuge Liang is, I can’t really say that he is a good defector, yes he is good support, he is difficult to kill, but there isn’t really much of a game when he is the last player left. I mean seriously, how much can you do when your star gazing is only limited to 2 cards and you have simply no offensive abilities. \n\nFAQ and Disambiguation:\n\n\n\nStar Gazing\n\n1. Which comes first? \"Star Gazing\" ability or Judgement?\n\n\n\n\nAns: The ability comes first. Therefore Zhu Ge Liang is able to manipulate the judgement card to his favor.\n\n\n\n\n\n2. Can he place all the cards that were gazed at the bottom of the deck, and not leave any at the top?\n\n\n\n\nAns: Yes.\n\n\n\n\n\n\n\n3. Can this ability still apply when it is a 1-on-1 situation?\n\n\n\nAns: Yes. He can still gaze 2 cards, rearrange them, or place them at the bottom if he chooses.\n\n\n\n\n\n\n\nEmpty City\n\n1. When Zhu Ge Liang has no more on-hand cards, can he be targeted for Diao Chan 貂蝉's \"Seed of Animosity 离间\" ability?\n\n\n\n\n[Updated 2nd Feb 2011] Ans: No. He cannot be targeted for Duel even if it is Diao Chan's ability.\n\n\n\n\n\n2. During the midst of a DUEL, if Zhu Ge Liang runs out of on-hand cards, does the \"Empty City\" ability activate?\n\n\n\nAns: No. \"Empty City\" means he cannot be the target of DUEL or ATTACK. During DUEL, the card has already been activated, thus the DUEL goes on even if Zhu Ge Liang has no more cards on-hand. If he is unable to produce another ATTACK in the midst of the DUEL, he receives damage.\n\n\n\n\n\n\n\n3. Does RAINING ARROWS 万箭齐发, BARBARIANS 南蛮入侵 or tool cards other than DUEL have an effect on Zhu Ge Liang when he has no on-hand cards?\n\n\n\n\nAns: Yes. \"Empty City\" only prevents ATTACK and DUEL. Other tool cards are still effective.\n\n\n\n\n\n4. Say a player equips \"Green Dragon Crescent Blade 青龙偃月刀\" and attacks Zhu Ge Liang, who has only 1 DODGE on-hand. After 1 ATTACK, Zhu Ge Liang uses his DODGE and no longer has anymore on-hand cards, but the weapon ability states that another ATTACK can be use if the previous was dodged. So can the second ATTACK be used on Zhu Ge Liang?\n\n\n\nAns: No. A second ATTACK card is executed after Zhu Ge Liang has activated his \"Empty City\" ability, therefore Zhu Ge Liang cannot be targeted for the second attack.\n\n\n\n\n\n5. If he has no card in hand and has Rattan Armor equipped, is he completely immune to all damage?\n\n\n\n\n\nAns: No. If someone were to shackle him then channel damage across, his will still suffer damage\n\n\n\n\n\n\n\n\n6. Is it possible for Zhu Ge Liang to blacken all the cards at the bottom of the deck for Zhen Ji using his Star Gazing ability?\n\n\n\n\n\n\n\n\nAns: Yes it is. But you will need to consider number of players and characters that can increase draw rate(such as Guo Jia and Xun Yu). It is not easy, but possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhào-yún-赵云","name":"Zhào Yún 赵云","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOrZSAOCJ6gVNNvPV0ZiBUPn9x4lO1RqnuXmCe8tzBEOwPfU0v3Dzfw-wVYqNy7mFR3T5mHWp_Aa28OziAIzbzyvrWhLad1bxCtNel_B4P1Kzr1Zy0vnHIi50xi0IQxCWheKydUX_h1Z3X/s320/shuazhaoyun.jpg","text":"\nTranslated description:\n\"The young general 少年将军 (shào nián jiāng jūn)\"\n\n\nWho is he:\n\n\nThe hunk in Romance of the Three Kingdoms, Zhao Yun is portrayed like the Antonio Banderas of ancient China, complete with sword wielding abilities equal to Zorro (or probably better?). Always the general of Shu Han 蜀汉 that appears to save the day when their need is crucial, Zhao Yun is arguably one of the most well-liked characters in the entire story. If you expect this character to have abilities to be feared in the card game, then you are right.\n\n\nCharacter ability: \"Dragon Heart 龙胆 (lóng dǎn)\"\nAll your ATTACK 杀 and DODGE 闪 cards can be used interchangeably.\n\n\nAbility's relation to story:\n\nScant relation to the story, really. We all know Zhao Yun is a really good fighter, so I guess it was natural to make his ability skewed towards attack. But the cool thing about Zhao Yun's \"Dragon Heart\" ability is he has a much stronger evasive ability than most players. Compared to Guan Yu 关羽 and Zhang Fei 张飞 who can heap loads of attack damage, Zhao Yun has an abnormal amount of ATTACK cards at his disposal but also has an incredible amount of DODGE as well! You kind of get the impression that the game makers want us to think that Guan Yu and Zhang Fei are pure brute strength while Zhao Yun has more dexterity and flexibility.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Zhao Yun's rescue of Liu Shan 刘禅 at the Battle of Chang Ban 长板. This story is the stuff of legends. Zhao Yun is separate from Liu Bei 刘备 in the chaos after Cao Cao 曹操 attacks. Liu Bei's generals reported seeing Zhao Yun dash in the direction of the enemy alone, inferring that Zhao Yun has deserted Liu Bei and joined the enemy. Liu Bei would have none of it and believed Zhao Yun must have some plan up his sleeve. True enough, Zhao Yun ran into the enemy to search for Liu Bei's wife and son, Liu Shan, who was missing as well. After finding Liu Shan but not being able to rescue Liu Bei's wife, Zhao Yun dashes back towards Liu Bei, encountering literally thousands of enemy troops alone. One versus a few thousand, Zhao Yun manages to slay over 50 of Cao Cao's generals and hundreds of troops before successfully escaping. When Liu Shan was finally presented back to Liu Bei, Liu Bei tosses the baby on the ground, exclaiming that his son's life was not worth endangering his great general.\n\n\n\n2. Cause of death - Zhao Yun died of old age, which was a remarkable feat not to have died in battle in that era. He remained undefeated in battle till his death. Most of the other Shu Han generals were all killed in action.\n\n\n\n\n\nWikipedia link:\n\n* Zhao Yun Wiki\n\n\n\n\n\nFAQ and Disambiguation:\n\nDragon Heart\n1. When Zhao Yun has equipped Serpent Halberd 丈八蛇矛, can he use any 2 on-hand cards as DODGE (since interchangeable with ATTACK)?\n\n\nAns: No. Equipment effects are not interchangeable under Dragon Heart, only the cards themselves.\n\n\n2. When equipped with EIGHT TRIGRAMS 八卦阵, can he choose to activate judgement to flip a red card and use as ATTACK (since interchangeable with DODGE)?\n\nAns: No. Refer to 1.\n\n\n3. If Zhao Yun uses DODGE as an ATTACK card, will there be any elemental attribute to the ATTACK?\n\nAns: No. They will be viewed as normal ATTACKs.\n\n\n4. If Liu Bei uses \"Rouse\"(Shua Characters use ATTACK on his behalf), can Zhao Yun use a DODGE card as ATTACK for him?\n\nAns: Yes.\n\n\n5. If Zhao Yun equips Eight Trigrams 八卦阵 , can he use it to generate Dodge but used as an Attack?\n\n\nAns: The official FAQ answer is no,though this point is still widely contested.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"guān-yǔ-关羽","name":"Guān Yǔ 关羽","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgCVt-NtLlhmhbxXp-mweytmSvJova3avOYayq-OK5XodOesg_FxDVC2WJ4GVzZiMBxyNXdpIbVt_zcZ2KJN9p1iuXgU2AAEYPIJS7VYm2WQscP0Y5qUl7_89YY1AOTqQfW1_HuYaoGBh7d/s320/shuguanyu.jpg","text":"\nTranslated description:\n\"Bearded Gentleman 美髯公 (měi rán gōng)\"\n\n\nWho is he:\n\n\nHe is a god. No kidding. The legend of Guan Yu and his strong sense of chivalry and brotherhood has transcended two millenia and is still widely revered today in Chinese culture. Mention his deity name \"Guan Gong 关公\" and most elder chinese would relate to you legendary stories of Guan Yu's strong sense fairness, justice and brotherhood. The 2nd eldest among the three sworn brothers, Liu Bei 刘备, Guan Yu and Zhang Fei 张飞, Guan Yu is usually the most rational. Of course, his combat ability is incredible and his weapon the \"Green Dragon Crescent Blade 青龙偃月刀\" has become the stuff of legends.\n\n\n\nCharacter ability: \"Warrior Saint 武圣 (wǔ shèng)\"\nYou can use any card with a \"heart\" or \"diamonds\" suit as an ATTACK 杀 card.\n\n\nAbility's relation to story:\n\nLike most of Shu Han 蜀汉's \"combat\" characters in the San Guo Sha 三国杀 card game, there is only a superficial link between their character ability and the story. In the case of Guan Yu, the game makers decided to make it easy for Guan Yu to attack other players. Unlike Zhao Yun 赵云 who has an advantage in dodging, Guan Yu's advantage only lies in attack. Perhaps its the game makers' way of paying tribute to Guan Yu's courage and raw power.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - I'm putting my personal opinion into this one. Despite all the battles won by Guan Yu, I remember him best for his role in letting Cao Cao 曹操 escape. When nearly all hope was lost for Cao Cao after the huge loss at Battle of Red Cliffs 赤壁之战, he had the ill-fortune to be confronted by Guan Yu. Cao Cao knelt down before Guan Yu and said it was his fortune to die in the hands of the respected Guan Yu, rather than in the hands of some other unknown character. However Guan Yu let Cao Cao go because he was once indebted to Cao Cao, who spared his life in a reversal of fortunes many years before. The key thing to remember here is that Guan Yu is liable for punishment by death for this chivalrous act, yet he still let Cao Cao go. Now that is a classic example of chivalry indeed.\n\n\n\n2. Cause of death - Guan Yu was captured by troops from the Kingdom of Sun Wu 孙吴 after his own men deserted him. Guan Yu had severely underestimated his enemies and left the city of Jing Zhou 荆州 poorly guarded. While he was away attacking Cao Ren 曹仁 at Fan Cheng 樊城, the troops of Lu Meng 吕蒙 moved in and captured Jing Zhou. Guan Yu's men, who were mostly from Jing Zhou, deserted him to return to the safety of their family. Guan Yu was then captured at Mai Cheng 麦城. He was executed together with his son Guan Ping 关平 since they refused to surrender.\n\n\n\n\n\nWikipedia link:\n\n* Guan Yu Wiki\n\n\n\n\nFAQ and Disambiguation:\n\nWarrior Saint\n1. Can Guan Yu use an equipped item that has a red suit as ATTACK?\n\nAns: Yes, with conditions. If the ATTACK to be used requires the item's ability or range, then it CANNOT be used. Eg: the target is distance 5 away from Guan Yu, then Guan Yu cannot use his equipped weapon (assuming red suited +5 distance) as ATTACK since that would mean the weapon's range is forfeited. 2nd Eg: Guan Yu equipped red-suited Zhu Ge Crossbow 诸葛连驽 and has already used an ATTACK card in that turn. He cannot use the Zhu Ge Crossbow card as an ATTACK since that would mean he is using 2 ATTACKS in a turn and he requires the Zhu Ge Crossbow to be equipped when he uses more ATTACK cards.\n\n\n2. If Guan Yu uses a red-suited card (eg: PEACH) to ATTACK Cao Cao 曹操 and causes him damage, does Cao Cao keep the red-suited card that was used? (eg: In which case he gains a PEACH?)\n\nAns: Yes Cao Cao keeps the red-suited card.\n\n\n3. With regards to a target equipped with Ren Wang Shield 仁王盾, is any red-suited card used as an ATTACK by Guan Yu considered a red-suited ATTACK card?\n\nAns: Yes. As long as the card is red-suited and used as ATTACK, they are considered red-suited ATTACK cards.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"huáng-yuè-yīng-黄月英","name":"Huáng Yuè Yīng 黄月英","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhK_yXZAAQzkF_tj78yYr3uklMFjw2PKpXeoEv_WYs-6AUwrvkIkJhoBE9HcK6vTU277TfcbH-nCh7vBg1k45WbpVYU43d2D7A_tO1bOWgloBUwMBXV7K2SOe_fRDxMxosrpu_DI7mIZ387/s320/shuhuangyueying.jpg","text":"\nTranslated description:\n\n\"Veiled heroine 归隐的侠女 (guī yǐn dè xiá nǚ)\"\n\n\n\n\nWikipedia link: Huang Yue Ying Wiki\n\n\n\n\nWho is she:\n\nThe wife of Zhu Ge Liang 诸葛亮, Huang Yue Ying is a minor character in Romance of the Three Kingdoms. Apparently the name Huang Yue Ying may be a fictional one altogether since no historical records exists of Zhu Ge Liang's wife's real name. Some say she is even smarter than Zhu Ge Liang, but most would agree she is usually remembered for being ugly. So ugly, in fact, that she hid her face behind veils under the shadow of moonlight. In the card game, Huang Yue Ying is one of the most popular characters to use. She can be deadly when luck runs in her favour, and the odds usually side her since all she needs are tool cards.\n\n\n\n\n Character ability 1: \"Assembling Wisdom 集智 (jí zhì)\"\n\nEverytime you use a tool card (except time-delay tool cards), you can immediately draw another card from the deck.\n\n(This is valid even if the tool card is used outside of that player's turn (such as when NEGATE 无懈可击 is used). This is the ability that makes her very deadly. When Huang Yue Ying has a hand-full of tool cards, her turn seemingly never ends. Although she can only ATTACK 杀 once, tools can be used without restriction. She can draw 3 cards when she uses DRAW2 无中生有.)\n\nSpecial note about her skill \"Assembling Wisdom\" when using IRON SHACKLES 铁索连环. When the card is played as \"RE-DRAW 重铸\", Huang Yue Ying cannot draw take 2 cards instead of 1 from the deck. This is because \"RE-DRAW\" is not considered using the card, but simply exchanging it for another. This information is acquired from the official game forum, though the post is all in Chinese. Click here to visit the post.\n\n\n\nCharacter ability 2: \"Genius 奇才 (qí cái)\"\n\nThere is no range restriction on all your tool cards.\n\n(This means she can use STEAL 顺手牵羊 and RATIONS DEPLETED 兵粮寸断 on any character in play.)\n\nAbility's relation to story:\n\nBoth of her abilities are based on her superior intellect. Exactly how smart is she? *shrug* There does not seem to be any parallel of her character abilities in the story though. \n\n\nAdditional info based on story:\n\n1. Most famous achievement - Getting herself married to Zhu Ge Liang?! Since the story goes that she is ugly as heck, that is quite an accomplishment don't you think? Like I mentioned, Huang Yue Ying is usually remembered for hiding her face behind veils to conceal her hideousness to potential suitors.\n\n\n\n2. Cause of death - Wikipedia says she died after the Battle of Wu Zhang 五丈原之战. I'm not all too familiar with this one. Any corrections and contributions appreciated! Leave me a comment!\n\n\n\n\n\n\n\nFAQ and Disambiguation:\n\n\n\n\n1. Does stealing/dismantling Huang Yue Ying's cards let her draw a new card?\n\n\n\n\n \n\n Ans: No it does not. She only gets to draw a new card if she is the user of the tool card ( ie: when she is the one using STEAL or Dismantle) . But if other players use tool cards on her, she cannot draw another card.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"mǎ-chāo-马超","name":"Mǎ Chāo 马超","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi2j3cVl10rGDd9ipJZko-OgjFs1LVh2JR9-Km9MjKIWAOcW-eyZei62x6krM2k46vuo4HJ4vhW_8gY-bt7z7_NrVR5f_PYogAW3F5TMUAWGVQ18Qc-GMLAyDAjNOzofewLZNp7nI_5pXxP/s320/shumachao.jpg","text":"\nTranslated description:\n\n\"Lone horseman that can outmatch a thousand troops 一骑当千 (yì qí dāng qiān)\"\n\n\nWikipedia Link: Ma Chao Wiki\n\n\nWho is he:\n\nThe valiant general known for his horsemanship and combat ability, Ma Chao is one of Shu Han 蜀汉's 5 greatest generals. Typically depicted riding a horse, he initially led rebellions against Cao Cao 曹操 before eventually finding his place under Liu Bei 刘备. Ma Chao was highly regarded by Zhu Ge Liang 诸葛亮 as an all-rounded civil and military leader.\n\n\n\n\n Character ability 1: \"Horsemanship 马术 (mǎ shù)\" [Enforced ability]\n\nYou will always be -1 distance in any range calculations.\n\n(This means that when he equips a \"-1 horse\", he will have a physical distance advantage totaling -2.)\n\n\n\nCharacter ability 2: \"Iron Calvary 铁骑 (tiě jì)\"\n\nWhenever you use an ATTACK 杀 on any target player, you can choose to flip over one judgement card from the deck. If the judgement card is of a red-suit (hearts and diamonds), the ATTACK cannot be evaded with DODGE 闪.\n\n\n\nAbility's relation to story:\n\nHis \"Horsemanship\" ability is a given. Both him and Pang De 庞德 are known for their skilled horsemanship from the moment they appeared in the story. \"Iron Calvary\", however, is probably just an added skill by the game makers so as to tackle the \"dodgy\" characters, such as Zhang Jiao 张角, Younger Zhu Ge Liang 卧龙诸葛亮 and Zhen Ji 甄姬. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Probably the uprising he led against Cao Cao, where he very nearly captured Cao Cao alive. Cao Cao retaliated by executing over 100 of Ma Chao's family and extended family members. Though the uprising gave him prominence and respect from the kingdom of Shu Han, the death of hundreds of his family members due to his uprising would haunt him and disgrace him. It even led to an aborted marriage.\n\n\n\n2. Cause of death - Ma Chao succumbed to illness and died. In the story version, Liu Bei dies before Ma Chao, however it seems the actual historical version of events was Ma Chao died earlier and even wrote a parting letter to Liu Bei. \n\nFAQ and Disambiguation\n\n1. Does Ma Chao's judgement effect take place if he uses DUEL on someone and vice-versa?\n\nAns: No, the judgement effect does not take place. This is because during a DUEL, there is no need for the opponent to use Dodge.\n\n\n2. Can Iron Calvary be used AFTER the opponent has used a Dodge?\n\nAns: No it cannot.\n\n\n3. Must Iron Calvary be used immediately after using ATTACK?\n\nAns: Yes it must. The judgement must come before the opponent uses Dodge.\n\n\n\n\n\n\n\n\n\n\n\n\n\n:\n\n\n\n\n\n\n\n         \n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-fēi-张飞","name":"Zhāng Fēi 张飞","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFV_P0vlnTN_recfVekWmPHRuDpvpWWLIt5tb22Ha5fonw3JiJ2zDIw5aQNqb2snEv5GZvOaQ__4B-M0BiRGvV4qMIhCOWCck7ronmmNaLvBjB0rSLtt6Sh6BLXE_7YZFPvLZ3uO8oqW-A/s320/shuzhangfei.jpg","text":"\nTranslated description:\n\n\"A thousand men can't stop him 万夫不挡 (wàn fū bù dǎng)\"\n\n\n\n\nWikipedia link: Zhang Fei Wiki\n\n\n\n\n\nWho is he:\n\nThe ruffian. The impulsive. The brute. Zhang Fei is the youngest amongst the 3 sworn brothers. Compared with his 2 elder sworn brothers, Liu Bei 刘备 and Guan Yu 关羽, Zhang Fei tends to get in trouble for his quick temper and his love for alcohol. Some say his fighting ability is the strongest of the three. Zhang Fei is probably amongst the 5 most famous and popular characters in Romance of the Three Kingdoms. One of the reasons for that is the fact that he may well be the only comedic character in the entire cast of over 1000 characters in the story. Judging by most portraits of him, you wouldn't be blamed if you thought you was half-man, half-woolly mammoth.\n\n\n\n\n Character ability: \"Berserk 咆哮 (páo xiāo)\"\n\nYou can use as many ATTACK 杀 cards as you wish during your turn.\n\n(Effectively, Zhang Fei has the Zhu Ge Crossbow 诸葛连弩 equipped by default. He will always have the \"Berserk\" ability regardless of what weapon he has equipped.)\n\n\n\nAbility's relation to story:\n\nThe literal translation for 咆哮 means \"roar\". Zhang Fei is famous for his loud roar that scared away an entire Cao Wei 曹魏 army. That, however, has nothing to do with the game character's ability to repeatedly use ATTACK. You kind of get the feeling that the game makers based the ability of Shu Han 蜀汉's generals not so much on their historical basis, but more for the completeness of the game mechanism (ie: \"it would be nice if a player could do THIS... let's allow Zhang Fei to do that\").\n\n\nMatching Weapon: Serpent Halberd 丈八蛇矛 (zhàng bā shé máo)\n\nThis weapon is a wonderful match for Zhang Fei. The most irritating thing that can happen to a strong attacking player like Zhang Fei is to have no ATTACK cards on-hand to use. The Serpent Halberd allows him to use ATTACK by discarding any 2 cards. The flip side is Zhang Fei rarely has the opportunity to accumulate more than 6 on-hand cards. Still, sometimes all it takes to end the game (and save the world) is to be able to ATTACK twice consecutively. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Ask any Chinese in the know what is Zhang Fei's most awesome achievement and they would undoubtedly say \"scaring the shit out of Cao Cao 曹操's army at the bridge of Chang Ban 长板桥\". He roared so loud that one enemy general fell off his horse and died while 10,000 enemy troops ran away in fear. For more on this story, read my write-up on DISMANTLE 过河拆桥 or on Wikipedia!\n\n\n\n2. Cause of death - Zhang Fei's brutish and unreasonable nature makes him a terrible superior to work with. After Guan Yu died, Zhang Fei ordered Zhang Da 张达 and Fan Jiang 范疆 to prepare mourning clothes for his entire army within 3 days. Both of them pleaded that it was impossible to accomplish. Zhang Fei put down an ultimatum: that they would be beheaded if it was not done in 3 days. Fearing for their lives, Zhang Da and Fan Jiang cut off Zhang Fei's head while he was asleep and surrendered themselves to the Kingdom of Sun Wu 孙吴.\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"younger-zhū-gě-liàng-卧龙诸葛亮","name":"Younger Zhū Gě Liàng 卧龙诸葛亮","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgtXcdDI8IPH9mlxH-mOojezfO2fjABsrUQvNc3K6_cR8yZClqipktnO8YW__LDp1oS-4ku5X5SpWx1dNx788VeG6tBz1LqKbUmxcoqiWkgrVZALvveoECVCxxinKgotOdfX-0eSPKwM1IF/s320/shuzhuge.jpg","text":"\nTranslated description:\n\n\"Hidden dragon 卧龙 (wò lóng)\"\n\n\n\nWikipedia link: Zhu Ge Liang Wiki\n\n\n\nWho is he:\n\nThe second of three versions of Zhu Ge Liang in the card game, Younger Zhu Ge Liang depicts the ridiculously omniscient Zhu Ge Liang in the early days of his career with Liu Bei 刘备. Not to say that his \"powers\" got any weaker with age, but it does seem like the writer of Romance of Three Kingdoms (Luo Guan Zhong 罗贯中) intended for Zhu Ge Liang to appear with a bang. This was the Zhu Ge Liang that literally frustrated Zhou Yu 周瑜 to death. However since a lot of the background on Zhu Ge Liang will be repeated in all three versions of the character, I'll take the opportunity to talk about his days just prior to joining Liu Bei.\n\n\nCharacter ability 1: \"Eight Trigrams Formation 八阵 (bā zhèn)\" [Enforced ability]\n\nWhen no armour is equipped, you will always have the protection of the EIGHT TRIGRAMS 八卦阵 armour by default. \n\n\n\nCharacter ability 2: \"Arson 火计 (huǒ jì)\"\n\nAll your on-hand cards with a red suit (\"hearts\" or \"diamonds\") can be used as BLAZE 火攻 during your action phase.\n\n\n\nCharacter ability 3: \"Scient 看破 (kàn pò)\"\n\nAll your on-hand cards with a black suit (\"clubs\" or \"spades\") can be used as NEGATE 无懈可击.\n\n\n\nAbility's relation to story:\n\nZhu Ge Liang actively trained the troops of Shu Han 蜀汉 during lull periods. His mastery of military formations gained the respect of many of his adversaries, not least Si Ma Yi 司马懿 in the later years. The Eight Trigrams Formation is one of the most famous that Zhu Ge Liang used very well. \n\n\n\nArson was used by him from the very first battle he oversaw, which resulted in huge losses for the enemy. Later, both him and Zhou Yu came up with the same idea to use fire against Cao Cao 曹操 at the battle at Red Cliffs 赤壁之战.\n\n\n\nOf course, Zhu Ge Liang was depicted as so god-damned smart that every teeny weeny little action of his enemies, he understood their intent. His 3rd ability \"Scient\" plays on the fact that no tool or ploy works on him, since he can see through it all instantly. Smart ass.\n\n\n\nMatching weapon: \"Feathered Fan 朱雀羽扇 (zhū què yǔ shàn)\"\n\nThough the feathered fan is Zhu Ge Liang's prized item in the story, the weapon in this game is not a perfect match for his abilities. Feathered Fan brings the same advantage to any other player anyways. Besides, with half the entire deck being of red-suited cards, Younger Zhu Ge Liang has more than enough fire attribute offensives as it is!\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - In his younger days, before joining Liu Bei, Zhu Ge Liang was sort of a guru in his hometown. The story depicts the countryside where Zhu Ge Liang lived to be similar to Barney-the-purple-dinosaur land; everyone smiling and singing happily. Though no direct link is made between their state-of-mind and Zhu Ge Liang's presence there, nonetheless it makes for more interesting story-telling to believe that was the case. He would have chosen to stay as a happy farmer for the rest of his life had Liu Bei not paid him repeated visits.\n\n\n\n2. Cause of death - Same as the write-up for Elder Zhu Ge Liang 暮年诸葛亮. (How many different causes of death could there be for one person?!)\n\n\n\n\nFAQ and Disambiguation:\n\n\n\n\n\n1. Does his default Eight Trigrams work against the Blue Steel Blade?\n\n\n\nAns: No it does not.Blue Steel Blade overrides all armor including his default Eight Trigrams.\n\n\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"páng-tǒng-庞统","name":"Páng Tǒng 庞统","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjJWaFZjB3irx0FfV-OGle1vzRWEZphXdxwzBhgHw1g8n1AS0KF1kKIU8DkPzFWy2WFrO_-xH1BSLdQi3oMALfVme-8uPuNHwSFa19hwtOsM_X9eXhUxQaFeItKuHpU_sfifLaU7pxl3sBS/s320/shupangtong.jpg","text":"\nTranslated description:\n\n\"Rising Phoenix 凤雏 (fèng chú)\"\n\n\nWikipedia Link: Pang Tong Wiki\n\n\n\nWho is he:\n\nThe second smartest person of the era, but also probably the ugliest in looks. Pang Tong is supposedly Zhu Ge Liang 诸葛亮's equal in the brains department. Where Zhu Ge Liang is given the nickname \"Hidden Dragon 卧龙 (wo long)\", Pang Tong is given the nickname \"Rising Phoenix 凤雏 (feng chu)\". However his hideous looks made some doubt his ability, such as Sun Quan 孙权. Pang Tong is credited as the critical link behind Cao Cao 曹操's spectacular defeat at battle of Red Cliffs 赤壁之战, but he did not live very long to share his talents. Imagine how the world would have been different had Pang Tong lived a decade longer, where both he and Zhu Ge Liang were helping Liu Bei 刘备.\n\n\n\n\n Character ability 1: \"Shackle 连环 (lián huán)\"\n\nEvery on-hand card that has the suit of \"clubs\" can be used as IRON SHACKLES 铁索连环.\n\n(This also means that card, regardless of its original function, can perform RE-DRAW 重铸, ie: discarded and replaced with a new card from the deck).\n\n\n\nCharacter ability 2: \"Nirvana 涅盘 (niè pán)\" [Single-use ability]\n\nWhen you are on the brink of death, you can choose to discard all your cards (both on-hand and equipped) and resurrect yourself. You will have 3 units of health after resurrection and can immediately draw 3 cards from the deck.\n\n(This ability can only be used once. A symbol or marking (unspecified in the instructions) should be used to inform all players that \"Nirvana\" has already been used once.)\n\n\n\nAbility's relation to story:\n\n\"Shackles\" is a perfect match for Pang Tong since he practically masterminded the shackling of Cao Cao's ships at the battle of Red Cliffs. The shackles turned out to be the key reason for the blaze which wiped out Cao Cao's troops. You can read more about this incident in my write-up on IRON SHACKLES.\n\n\n\n\"Nirvana\" is an interesting ability. Players have commented that the game makers are making up for Pang Tong's early death by allowing him to resurrect in the card game. Then again, a lot of other characters died early but the game makers never gave them resurrection abilities. I mean look at Guo Jia 郭嘉, he was an exceptional advisor and died young. No second-life for him in this game! \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Tricking Cao Cao into shackling all his ships together prior to the battle of Red Cliffs, such that when Zhou Yu 周瑜 set the ships ablaze, there was no escape! Pang Tong is also credited as the main motivator behind Liu Bei's occupation of the west, which became the stronghold for Shu Han 蜀汉.\n\n\n\n2. Cause of death - Pang Tong was ambushed by arrows as he led troops to attack Luo Cheng 罗城. Liu Bei decided to send Pang Tong by the shortcut, where ambushes were to be expected, even though Liu Bei himself was the combat personnel and Pang Tong was an advisor. The location of Pang Tong's death is called Luo Feng Po 落凤坡, which translates to Valley of the fallen phoenix. How apt.\n\n\nFAQ and Disambiguation\n\n1. If Pang Tong is the Ruler, does he get reincarnated with 4 health units or just 3?\n\nAns: After reincarnation , he gets only 3 units health. But as a ruler, his max health is still 4 units. Therefore he can use one PEACH card to increase to 4 units of health.\n\n\n2. Does Pang Tong gets to pick a new character for his second life?\n\nAns: No. You must still remain as Pang Tong.\n\n\n\n\n\n\n\n\n \n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"huáng-zhōng-黄忠","name":"Huáng Zhōng 黄忠","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9AR2N7KWa8ttvKpj5ThKHLOcz7HnMISWkw1R3zQjmzPxYGje6vdo5oVLzXlhB9AEl0ejob3-69GWyiRkWQd0D8poqCbm1KMQZANRCf_48lxVxJgwvLGS_0-b3RSirjHv5Rs3UXWXHw4Qz/s320/shuhuangzhong.jpg","text":"\nTranslated description:\n\n\"Old but vigorous 老当益壮 (lǎo dāng yì zhuàng)\"\n\n\n\n\nWikipedia link: Huang Zhong Wiki\n\n\n\n\n\nWho is he:\n\nQuite possibly the oldest general by age in Romance of the Three Kingdoms. By the time of his fatal injury that he sustained in combat, Huang Zhong was already 75 years old. His age is probably exaggerated, much like many of the other details in the story. In fact, no record exists that could determine his age. The legend of Huang Zhong is, therefore, 80% influenced by Romance of the Three Kingdoms and not so much by true history. Nonetheless, Huang Zhong was an incredible general, very powerful in combat and deadly accurate with the bow and arrow. The game makers of San Guo Sha 三国杀 really put his attacking abilities to the extreme! More about his character abilities below.\n\n\n\n\n Character ability: \"Fearsome Archer 烈弓 (liè gōng)\"\n\nIn the action phase, your ATTACK 杀 cannot be evaded by DODGE 闪 under the following 2 circumstances:\n\n\n\n1. The number of on-hand cards of the target player is less than or equal to your attacking range.\n\n\n\n2. The number of on-hand cards of the target player is more than or equal to the units of health you have remaining.\n\n\n\nWith a little extrapolation of the possibilities, you will notice that when Huang Zhong has only 1 unit of health left, any target player he uses ATTACK on cannot DODGE. \"Undodgeable\" ATTACK by Huang Zhong is therefore possible anytime his health remaining is less than or equal to his attacking range.\n\n\n\nAbility's relation to story:\n\nI wonder if the game makers are helping Huang Zhong make up for his age by giving him such an extreme character ability. Nothing close to this kind of combat prowess (where enemies cannot escape his attacks) is described in the story. A thin link to the story is possible when you consider that Huang Zhong is a celebrated archer. Perhaps the game makers wanted to give this famous archer the advantage by matching his weapon. Read about his matching weapon below.\n\n\n\nMatching weapon: \"Unicorn Bow 麒麟弓 (qí lín gōng)\"\n\nOkay okay, don't send me hate mail! I know that the 麒麟 is not a unicorn! You can read more about that in the trivia section of the UNICORN BOW post. Anyway, this is Huang Zhong's weapon and it is quite obvious what a huge advantage this weapon gives him. UNICORN BOW has an attacking range of 5, which means when Huang Zhong equips this weapon, your opponent needs to have at least 6 cards on-hand to be able to DODGE your ATTACK! Very few characters can hold that many cards outside of their turn! Off-hand I can only think of Lu Meng 吕蒙 and Cao Ren 曹仁. Do add on other characters by leaving me a comment!\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Although his biggest credit was killing the Cao Wei 曹魏 general Xia Hou Yuan 夏侯渊 at the battle of Mount Ding Jun 定军山之战, I prefer to think that honor is equally shared with his advisor Fa Zheng 法正. \n\n\n\nInstead I feel his most memorable achievement was his chivalry when Guan Yu 关羽 battled him in their first meet. At that time, Huang Zhong was defending the city of Chang Sha 长沙 from the forces of Liu Bei 刘备. Guan Yu was sent to duel with Huang Zhong, both of them ferocious but chivalrous. Huang Zhong purposely shot an arrow that hit Guan Yu's helmet instead of killing him, for he had grown to respect Guan Yu very quickly. Guan Yu killed Huang Zhong's horse in battle, but instead of taking advantage, Guan Yu let Huang Zhong rest and find another suitable horse to do battle again. The next day, Huang Zhong repeatedly took shots at Guan Yu with his bow, but did not load any arrows, as a subtle way of thanking Guan Yu. Eventually, Huang Zhong surrendered to Liu Bei after being rescued by Wei Yan 魏延 after Han Xuan 韩玄 ordered Huang Zhong executed for disloyalty.\n\n\n\n2. Cause of death - Huang Zhong was shot by a poisoned arrow in an ambush laid by Pan Zhang 潘璋. This happened after Guan Yu's death and Liu Bei led a campaign against the kingdom of Sun Wu 孙吴 for revenge. Huang Zhong did not die in battle, but his old age caused him to succumb to his wounds later that night.\n\n\n\n\nFAQ and Disambiguation\n\n\n1. Does it matter how many cards the opponents have if Huang Zhong is equipped with the Unicorn Bow?\n\nAns: No it does not matter. That is because every player will either have 5 cards or less on-hand (smaller/equal to Unicorn Bow's range) or 4 cards or more(greater/equal to Huang Zhong's health). Thus all attacks by him are undodgeable once his unicorn bow is equipped.\n\n\n2. Is there a need for both circumstances  for his ability to be fulfilled ? Or will either do?\n\nAns: No. If either 1 of the cicumstances is fulfilled, the attack cannot be dodged.\n\n\n3. Does Huang Zhong's ability still work when he is the victim of DURESS outside of his turn?\n\nAns: No his ability no longer works. This is because his ability only works in the action phase of his turn.\n\n\n\n \n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"wèi-yán-魏延","name":"Wèi Yán 魏延","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiC7RMsxRcwEwa3XyBSdWRlc9w3q8ikTPpseWhi_iS1N6pLgz6ia2qPIQxOcY9n-OIXPzCZHLcU3jN5n1MJ1g3oPv12qWLdQOtKp-HvyVfwBb4AloKODKxzQUsv9KsKuHgB8lkhTS4KWzFy/s320/shuweiyan.jpg","text":"\nTranslated description:\n\n\"The blood-thirsty lone-wolf 嗜血的独狼 (shì xuě dè dú láng)\"\n\n\nWikipedia link: Wei Yan Wiki\n\n\n\nWho is he:\n\nWe all know a rebellious kid back in school who just refused to listen to instructions. Wei Yan is a competent Shu Han 蜀汉 general who was similar to that kid. Though not an outright rebel, Wei Yan always had that streak in him that made him difficult to lead. If there was a phrase that he would say, it would probably go along the lines of \"Why should I (bla bla)...\". In true dramatic fashion, Wei Yan became the \"bad guy\" when he revolted against Zhu Ge Liang 诸葛亮 and Shu Han. In today's world, he would probably make a pretty successful entrepreneur! \n\n\n\nCharacter ability: \"Insanity Streak 狂骨 (kuáng gǔ)\" [Enforced ability]\n\nWhenever you cause damage to any player within physical range of 1, you regain 1 unit of health for every 1 unit of damage caused.\n\n(Taking this to the extreme, Wei Yan can regain 4 units of health if he has equipped \"-1 horse\", uses BARBARIANS 南蛮入侵, and the 4 players to his immediate left and right all suffer damage. Since this is an enforced ability, he cannot choose not to absorb health.)\n\nAbility's relation to story:\n\nA vampirical character is fun to have in a game, though there is no mention of any blood-sucking characters in Romance of the Three Kingdoms. Of course, Wei Yan was never a vampire and wasn't even portrayed anywhere near one. So this ability is purely just for gaming sakes.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - The rescue of Huang Zhong 黄忠 from execution at the city of Chang Sha 长沙. Wei Yan got pissed off by Han Xuan 韩玄's distrust of Huang Zhong and decided to take matters into his own hands. He killed Han Xuan, rescued Huang Zhong, then surrendered the city to Liu Bei. Huang Zhong went on to become one of Liu Bei 刘备's most important generals. If not for Wei Yan, there would be no legend of Huang Zhong. \n\n\n\n2. Cause of death - After Zhu Ge Liang died, Wei Yan openly revolted against Shu Han. Zhu Ge Liang, being all godly and smart, knew that Wei Yan was going to revolt once he died. Therefore he tipped off Wei Yan's partner Ma Dai 马岱, and laid a trap. In the midst of open revolt, Wei Yan challenged Shu Han's forces and shouted \"Who dares to kill me?\". Ma Dai happily decapitated him from behind.\n\n\nFAQ and Disambiguation\n\n1. If Wei Yan uses BARBARIANS and everyone who is in play is damaged, will Wei Yan be able to heal himself through his ability?\n\nAns: Yes, but only from those within his physical range on his left and right.\n\n\n2. Would Wei Yan heal himself if he uses Fire/Lightning attack on a player that is shackled to other characters?\n\nAns: Yes he would ONLY if the ATTACK successfully cause damage to a player within a range of 1.\n\n\n3. Does Wei Yan's ability still apply if he causes damage to himself?\n\nAns: Yes, because he falls within his own physical range of 1. See next question for more details.\n\n\n4. If Wei Yan attacks Xiao Qiao and she transfers the damage back to Wei Yan, how should this be resolved?\n\nAns: Follow this sequence below:\n\n1. Wei Yan damage Xiao Qiao (eg: 2 units)\n2. She transfers back to Wei Yan.\n3. Wei Yan suffers his own damage first.(lose 2 units) IMPT! If Wei Yan in on the vrink of death, he must be rescued first before step 4 activates.\n4. Wei Yan regains 2 units of health due to his ability.(total, no loss in health)\n5. Wei Yan draws cards for Xiao Qiao's deflect.Number of cards calculated based on his health after step 4.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"mèng-huò-孟获","name":"Mèng Huò 孟获","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi0M05dPVk78vZ3MHZPZiuPiiVm4_1_2GNroB_gu-dJvwWCdorEzSMxue3bhMvMTGr9g5M37EDcrhswrfZ_ADkS7DHwxqX_WOKuD5U12ah0TLZRG0vanFu86Pw3cJZ7L0fnK9zPDvzXLAXz/s320/shumenghuo.jpg","text":"\n\n\nTranslated description:\n\"King of the Southern Barbarians 南蛮王 (nán mán wáng)\" \n\nWikipedia link: Meng Huo Wiki\n\nWho is he:\nAfter the Kingdom of Shu Han 蜀汉 had been established in the west for several years, Meng Huo invaded Shu Han from the south. By this time, Liu Bei 刘备 had died and Zhu Ge Liang 诸葛亮 made all the major decisions as Prime Minister. Meng Huo sarcastically commented that the occupation of Shu Han over the western lands was a barbaric act, thus Meng Huo was going to claim back the land where their ancestors roamed. Zhu Ge Liang decided that an all-out war would exhaust supplies as well as cause too many innocent casualties. He also predicted that even if Shu Han was victorious, the barbarians would retaliate or harbour thoughts of revenge, thus it was best that Meng Huo and his people can be subdued by winning their respect. Meng Huo attacked Shu Han on different occasions but Zhu Ge Liang outsmarted him every single time, capturing Meng Huo but freeing him. Every time Meng Huo blamed external circumstances for his defeat and refused to acknowledge Zhu Ge Liang was the stronger. In the end, Zhu Ge Liang captured Meng Huo 7 times before Meng Huo finally gave in and subdued his people. From then on, the barbarians never invaded Shu Han again and were loyal to Zhu Ge Liang.\n\n\n Character ability 1: [Enforced ability] \"The Smoking Gun 祸首 (huò shǒu)\"\nThe tool card BARBARIANS 南蛮入侵 has no effect on you. You will be the source of any damage caused by the use of BARBARIANS.\n\n(This means any follow-up ability (retaliatory or advantageous) of other characters will target Meng Huo instead of the character who played the card.)\n\nCharacter ability 2: \"Arise Again 再起 (zài qǐ)\"\nDuring the drawing phase, iIf you are not at full health, you can choose to give up the drawing phase and, instead, flip X number of cards from the deck (X being the amount of health you have lost thus far). Of these X cards, you will regain 1 unit of health for every card with the suit of \"hearts\". The cards with \"hearts\" will be discarded while the remaining cards that were flipped will be kept into your hand.\n\nAbility's relation to story:\nMeng Huo's abilities have direct links to the story. He is the King of the Barbarians, therefore it is no surprise that his is \"the smoking gun\" for any damage caused by BARBARIANS. \"Arise Again\" probably has links to being released by Zhu Ge Liang 7 times. Meng Huo had the \"never say die\" attitude that pushed him to attack Shu Han repeatedly, despite so many failed attempts.\n\nAdditional info based on story:\n1. Most famous achievement - Repeatedly attacking Shu Han, but ultimately was not Zhu Ge Liang's match. Still, most would have given up after the 2nd or 3rd attempt. Meng Huo kept on fighting for 7 times.\n\n2. Cause of death - The story does not further mention Meng Huo after he admits defeat, however historical records state that Meng Huo might have become an official in Shu Han and he died of old-age. Word of caution though, the historical (real) Meng Huo deviates significantly from the story. He was never caught 7 times by Zhu Ge Liang, and he was not even a barbarian, much less the barbarian king.\n\nFAQ and Disambiguation\n\n1. For Meng Huo's ''Arise Again'' ability, can the flipped card be tinkered by Si Ma Yi/ Zhang Jiao?\n\nAns: No. This is because it is not a judgement card.\n\n\n2. If another player uses BARBARIANS and damages Xia Hou Dun, does Xia Hou Dun's ''An eye for an eye'' ability target the user of the card or Meng Huo?\n\nAns: It would target Meng Huo.\n\n\n3. Does the player used Barbarians have to use an attack to save himself since Meng Huo is the source of damage?\n\nAns: No the player who uses the Barbarians card NEED NOT use an ATTACK card for himself.\nUSER of the card > The player who uses the barbarians card will never need to use ATTACK to save himself.\nSOURCE OF DAMAGE > The player whom all reward and punishment will go to due to barbarians.\n\n\n4. Must the cards flipped for ''Rise Again'' be shown to everyone?\n\nAns: Yes. Everyone will get to see all the cards flipped out.\n\n\n5. If Meng Huo is Ruler and someone uses BARBARIANS and kills the Loyalist, must Meng Huo discard all his cards?\n\nAns: Yes\n\n\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhù-róng-祝融","name":"Zhù Róng 祝融","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEis6rD9Vh6YZMmAwdug4dcb98D-7wEMRmVOMPN8NyQXPfbN4-ITLOZ7uqNGxiI1ehWriNZU4W8K9ccFFSSibBK1rBrVe95UxVDZHACtd9RRTeJtQp0u3HhrXjKpLerw_lFhn9xS78EHf8ym/s320/shuzhurong.jpg","text":"\n\n\nTranslated description:\n\"The Savage Queen 野性的女王 (yě xìng dè nǚ wáng)\"\n\nWikipedia link: Zhu Rong Wiki\n\nWho is she:\nThe only female in the entire Romance of Three Kingdoms story to ever take part in battle, Zhu Rong is one fearsome woman. Not only was she brave, she was also capable in combat and intelligent. Wife of the Barbarian King, Meng Huo 孟获, she led an army to invade Shu Han 蜀汉 after her husband was cowed by Zhu Ge Liang 诸葛亮's advancing troops. She did so well in battle, in fact, that she captured 2 of Shu Han's generals; Zhang Yi 张嶷 and Ma Zhong 马忠. Her next opponents were the highly decorated generals Zhao Yun 赵云, and Wei Yan 魏延. Both these generals fled without much of a fight, but Zhu Rong smelled a rat and did not give chase. She was no fool as Shu Han had a trap set for her indeed. Yet when Wei Yan turned back to hurl insults at her, her emotions got the better of her and she gave chase. She fell into Shu Han's trap and was captured. By then, she had already left a deep impression as a woman not to be messed with.\n\n\n Character ability 1: [Enforced ability] \"Giant Elephant 巨象 (jù xiàng)\"\nThe tool card BARBARIANS 南蛮入侵 has no effect on you. When any other player uses BARBARIANS and the card's effects are concluded, you will acquire the BARBARIANS card that was used.\n\nCharacter ability 2: \"Fearsome Blade 烈刃 (liè rèn)\"\nWhenever your ATTACK 杀 successfully damages your target player, you can choose to \"Points Duel\" with that same target player. If you win the Points Duel, you gets to take 1 card (on-hand or equipped) from the target and keep for yourself.\n\nAbility's relation to story:\nContrary to what the game makers want you to conclude, Zhu Rong did not ride on a \"Giant Elephant\". That privilege was reserved for King Mu Lu 木鹿大王, an ally of the Southern Barbarians. Zhu Rong is good at taming elephants and use them in war, as well as calling them back after war.\n\n\"Fearsome Blade\" could be referring to Zhu Rong's incredible knife throwing skills. It is said that she never misses at her throwing. Of course, it also has little to do with the ability mechanics of grabbing a card from the opponent. It is probably just paying tribute to her skill.\n\nAdditional info based on story:\n1. Most famous achievement - Riding out to attack Shu Han and capturing Zhang Yi and Ma Zhong. Significant as this was for showing her ability, this entire scene was described in only 1 paragraph in the story.\n\n2. Cause of death - Unknown. Zhu Rong is fictional character that the story teller added for effect. There is no record of her existing and definitely no record of her death. Thus with the closing of the chapter on Zhu Ge Liang subduing Meng Huo, no more mention is made of Zhu Rong.\n\n\nFAQ and Disambiguation\n\n\n1. If Cao Cao is damaged by a BARBARIANS card, who gets the card? Zhu Rong or Cao Cao?\n\nAns: Cao Cao will get the card. This is because Zhu Rong only gets the card after all effects have been concluded while Cao Cao gets any card that causes him damage immediately.\n\n\n2. Is it possible to create a loop between Cao Cao and Zhu Rong using BARBARIANS card?\n\nAns: Yes.\n\nLoop start: Any player uses barbarians. Cao Cao chooses to suffer 1 damage, and picks up the barbarians card. This takes precedence over Zhu Rong since he can pick it up immediately once he suffers damage where as Zhu Rong needs to wait till all effects are concluded.\n\nLoop propagation 1: Cao Cao uses the barbarians he picked up. After all effects concluded, Zhu Rong picks the barbarian card.\n\nLoop propagation 2: Zhu Rong uses the same barbarians card she picked up. Cao Cao suffers damage again and picks up the card.\n\nLoop End:\n\n1. Cao Cao does not pick up the card(running low on health or forcefully negated by someone else.\n2, Barbarians card gets dismantled or stolen or used in another form.\n3. Game is over (objective met)\n\n\n4. If Zhu Rong attacked one of the Qiao sisters and they passed the attack off to someone else, would Zhu Rong points-duel the new target, or the intended Qiao?\n\nAns: Zhu Rong's ability should be used on the character that suffers the damage. Which means the Qiao's will not be affected by the ability, but instead the player whom she passed the damage to will be subjected.\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"fǎ-zhèng-法正","name":"Fǎ Zhèng 法正","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiEoctZ2zRGwUSFAsqOi83MQEdwF1UA8mVeav_QOtStvKXeHSIcjF7WqjBoAF70MFuFas97UwoX04JJHPZWWU-aKSebsjax27ivkHV2iTsMxIxjZT6JjR22E8au9DEI4VFeGqapkY1UfhuY/s320/fazheng.jpg","text":"\n\n\nTranslated Description:\nThe Wind beneath Shu Kingdom's Wings 蜀汉的辅翼 (shǔ hàn dè fǔ yì)\n\nNote: 辅翼 actually means \"wings that support\".\n\nWho is he:\nSome say he's a mercenary that cares more for his own benefits. Others say he is loyal and steadfast in his support of Liu Bei 刘备. Yet everyone would agree that Fa Zheng is one talented and intelligent individual. To put things into perspective, the true roles of Zhu Ge Liang 诸葛亮, Pang Tong 庞统 and Fa Zheng needs to be clarified. Though Zhu Ge Liang is widely celebrated for his god-like intellect, history records show that he was more a brilliant minister and statesman than a strategist. Pang Tong and Fa Zheng, on the other hand, are the true thinkers and conjurers. Pang Tong and Fa Zheng never did work together though. By the time Fa Zheng joined Shu Kingdom, Pang Tong was already dead.\n\nSo who exactly is Fa Zheng and how did he end up joining Liu Bei? Fa Zheng was one of the key personnel responsible for Liu Bei invading the western state of Xi Chuan 西川 that set up the Shu Kingdom. Fa Zheng worked closely with Zhang Song 张松 (the person responsible for giving the Atlas of Shu to Liu Bei) and was the brains behind the ploy that supplanted Liu Zhang 刘璋 with Liu Bei. In the time after, Fa Zheng was so highly regarded by Liu Bei that Liu Bei gave Fa Zheng something that he never gave any other Shu loyal.\n\nWhat did Liu Bei give to Fa Zheng that was so unique? Read on to find out!\n\n\n [2011 Old version]\nCharacter ability 1: Reciprocation 恩怨 (ēn yuàn) [Enforced ability]\nWhenever any other player regains your health by 1 unit, that player can draw 1 card. Every instance that any other player deals you damage, that player must give you an on-hand card of the \"hearts\" suit, or else that player will lose 1 unit of health.\n\nCharacter ability 2: Artifice of the Masses 眩惑 (xuàn huò)\nIn your action phase, you can give one on-hand card with the suit of \"hearts\" to any other player, then take any 1 card from that player and immediately give it to another player. Limited to one use per turn.\n\n(Note: For \"Artifice\", after you take 1 card from the player, you can choose to keep it in your on-hand cards. The words \"give it to another player\" includes yourself.)\n\n[2012 New version]\nCharacter ability 1: Reciprocation 恩怨 (ēn yuàn) \nWhenever you receive 2 or more cards from another player, you can allow that player to draw 1 card. Whenever you have received 1 unit of damage, you can make the source of the damage give you 1 on-hand card, or he/she loses 1 unit of health.\n\nCharacter ability 2: Artifice of the Masses 眩惑 (xuàn huò) \nIn the drawing phase, you can forgo drawing cards and force another player to draw 2 cards, then let that player use an ATTACK on another player of your choice that is within his/her attacking range. If the player does not abide by your instructions, you will receive those 2 cards that the player drew.\n\nAbility's relation to story:\nThe ability \"Reciprocation\" is supposed to reflect Fa Zheng's mercenary tendencies, where he will readily reciprocate in kind or with harm to whomever shows him the same. This is debatable though, as the evidence of that personality trait just isn't overwhelming. So even though there is a link to the story, its the story itself that might be somewhat corrupted.\n\n\"Artifice of the Masses\" has its roots in a particular story, which took place after Liu Bei overthrew Liu Zhang at conquered the West. Near the dying days of Liu Zhang's rule, one minister of Liu Zhang, known as Xu Jing 许靖, decided to surrender early to defect to Liu Bei. Unfortunately Xu Jing was unable to carry out his defection as planned. After Liu Zhang was overthrown, Liu Bei decided not to retain Xu Jing because of his display of cowardice and disloyalty. But Fa Zheng decided to intervene. In truth, Xu Jing was a well known person but supposedly average in capability. For Liu Bei not to employ Xu Jing would be sending the message that Liu Bei does not value capable men. Thus Fa Zheng insisted that Liu Bei retain Xu Jing, despite his unstellar abilities, so as to pull a hoax on the masses and create the illusion that Liu Bei treasures his human talents.\n\nHow does the game mechanics of \"Artifice\" link to the story? Well... there isn't much of a link! The original ability creator mentioned that this ability mirrors Fa Zheng's use of trickery and confusion to fool everyone else. A fantastic ability for the Defector to use, though it was little to do with history.\n\nAdditional info from the story:\n1. Most famous achievement - The battle of Mount Ding Jun 定军山之战 where he assisted Huang Zhong 黄忠 in defeating Xia Hou Yuan 夏侯渊. In that battle, Huang Zhong had set up his camp at a higher vantage point than Xia Hou Yuan, which pretty much frustrated Xia Hou Yuan enough to launch an assault. Fa Zheng advised Huang Zhong not to advance, but to simply hold his ground till he gives the signal. When Xia Hou Yuan's forces became weaker after failing to penetrate Huang Zhong's defenses, Fa Zheng gave Huang Zhong the signal to strike, where Huang Zhong brought down Xia Hou Yuan with one swift strike.\n\n2. Cause of death - Fa Zheng died from an illness in the year 220 AD. He was only 34 years old. Liu Bei was so devastated by the loss of Fa Zheng that he wept for days. Liu Bei then decided to do something which he has never done before, and would never do again. Liu Bei conferred on Fa Zheng the only posthumous title he has ever given anyone. \"The Winged Marquis 翼侯\" became Fa Zheng's posthumous title, which is related to the translated description at the top of this write up.\n\nWiki Link:\nFa Zheng Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"mǎ-sù-马谡","name":"Mǎ Sù 马谡","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhJ5lH3bclJ_zGKZIopUC50-5oAOf26_BEa9IUEqS7aELmHY64ypNAIGOaMTYzK6nKCXqiWYgBJWu5id_OX6wsXzqTCMsGbePowu-HM4seq-2JPqS-4YuIzTOHZTtcxNvmZz56zGl4xu-V3/s320/masu.jpg","text":"\n\n\nTranslated Description:\nThe Conceited Talent 怀才自负(huái cái zì fù)\n\nWho is he:\nImagine having to sent your good friend to the gallows. That was how Zhu Ge Liang 诸葛亮 must have felt when he ordered the beheading of his good friend, Ma Su. Throughout most of his life, Ma Su was a loyal general and tactician to Shu Kingdom 蜀国. His military knowledge was incredibly impressive, and Zhu Ge Liang became fast friends with him, often discussing military tactics and matters from dawn till dusk. In fact it was said that a couple of Zhu Ge Liang's military victories were tactics proposed by Ma Su. So trusted was Ma Su that Zhu Ge Liang made Ma Su his very own advisor!\n\nYet just before Liu Bei 刘备 died, Liu Bei warned Zhu Ge Liang that Ma Su was not as capable as he seems. Zhu Ge Liang chose not to listen, and entrusted Ma Su with an extremely important mission in their Northern expeditions. That was when the turning point occurred, that led to Ma Su receiving capital punishment. What exactly happened in that expedition? Read on to find out!\n\nCharacter ability 1: Winning Hearts 心战 (xīn zhàn)\nIn your action phase, if your number of on-hand cards exceeds your maximum health units, you can view the top 3 cards of the deck. Of these 3, display any number of cards that are of the heart suit, then keep them in your hand. Replace the remainder of the 3 cards (if any) in any order back on the top of the deck. Limited to once per turn.\n\nCharacter ability 2: Tears of Reluctance 挥泪 (huī lèi) [Enforced ability]\nThe player that kills you must discard all his or her cards (both on-hand and equipped) immediately.\n\nAbility's relation to story:\n\"Winning Hearts\" actually refers to Ma Su's philosophy of winning the hearts and minds of the enemy through non-military means. Yet the ability title is a wordplay to make a connection with the suit of hearts in this game. There does not appear to be any direct correlation between his philosophy and the mechanics of the ability.\n\n\"Tears of Reluctance\" has strong links to the famed phrase \"Zhu Ge Liang sheds tears of reluctance as he executes Ma Su 诸葛亮挥泪斩马谡\". It has decent links to the story since losing Ma Su was a big loss to Zhu Ge Liang. Though tragic, this mechanics of this ability is probably more aptly described as \"Curses of Frustration\" by other players.\n\nAdditional info based on story:\n1. Most famous achievement - In the Battle of Jie Ting 街亭之战, Ma Su was to face the formidable Zhang He 张郃 from Wei Kingdom. Despite Ma Su's military knowledge, he made an elementary error of placing his forces atop a hill to gain a vantage point, yet being isolated from his source of water. His follower, Wang Ping 王平, cautioned against his strategy and pointed out the critical flaw, but Ma Su failed to take heed. Sure enough, Zhang He exploited the flaw and cut off Ma Su's troop from the water supply. Once Ma Su's troops were thirsty and weak, Zhang He crushed his enemy easily. Ma Su barely escaped from the battle with his life, but his army was completely decimated. He returned to Zhu Ge Liang in defeat. \n\n2. Cause of death - The severity of Ma Su's blunder was apparent. The Fort of Jie Ting was strategically important to Shu, and Ma Su's defeat quickly led to further losses of adjacent cities. Zhu Ge Liang was furious that Ma Su, a man of such glib tongue and quick with military wisdom, should so utterly fail. After promising to take care of Ma Su's children, he sentenced Ma Su to death whilst brushing away tears of sorrow. In the minutes that follow, other generals came to plead with Zhu Ge Liang that a talent such as Ma Su be spared, so as not to lose any advantage to the enemy. However Zhu Ge Liang was adamant that Ma Su be executed to abide by the Laws of the military. After the beheading was done, the head of Ma Su was brought to Zhu Ge Liang as proof of his death, and Zhu Ge Liang wailed more than ever. He cried both for losing a close friend, as well as failing to listen to Liu Bei's last words.\n\nWiki Link:\nMa Su Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xú-shù-徐庶","name":"Xú Shù 徐庶","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYUhTG_j67OLjopcWO-3iMV5ENEYAmKvCWxiwJXZQIkonH8-JkL22LG5Nd4x2etaDSa19VwGmhnyju3-ED_0GvQAsm7VvP6W5DcUhCYmK1LSxr30Ydu6PkFFUcd9yd5JEzjxlpd8CW2bW2/s320/xushu.jpg","text":"\n\n\nTranslated Description:\nThe Loyal Gallant 忠孝的侠士 (zhōng xiào dè xiá shì)\n\nWho is he:\nBy now you probably know how significant Zhu Ge Liang 诸葛亮 was to Liu Bei 刘备 and the entire era. Yet if not for Xu Shu, Zhu Ge Liang would probably still be a simple scholar residing in peaceful solitude. Xu Shu was one of the friends of the mysterious Si Ma Hui 司马徽 and was Liu Bei's first military advisor. In his first military role for Liu Bei, Xu Shu helped crush Cao Ren 曹仁's forces and sent Cao Ren weeping back to Cao Cao 曹操 in shame. Upon knowing that Liu Bei has found a formidable advisor, Cao Cao made plans to entice Xu Shu over to Wei Kingdom 魏国.\n\nDid Cao Cao succeed? Did Xu Shu betray Liu Bei and hop over to Wei Kingdom?\n\nAs you can see, Xu Shu's character colours are in blue, representing that he belongs in the Wei camp. But strangely, his allegiance is Shu 蜀, as can be seen in the red 蜀 character in the upper left corner and his red life units. This is the ONLY character in the entire SGS game that has this abnormal colour coding.\n\nWhy is this the case? Read on to find out!\n\n[2011 Old version]\nCharacter ability 1: Silence 无言 (wú yán) [Enforced ability]\nWith the exception of Time-delayed tool cards, all other tool cards used by you have no effect on all other players. Similar tool cards used by all other players have no effect on you.\n\nCharacter ability 2: Dragon's Advocate 举荐 (jǔ jiàn)\nIn the action phase, you can discard up to 3 cards, then allow 1 other player of your choice to draw an equal number of cards from the deck. If you discard no less than 3 cards of similar type (basic, tool card, equipment card), you regain 1 unit of health. Limited to once per turn.\n\n[2012 New version]\nCharacter ability 1: Silence 无言 (wú yán) [Enforced ability]\nAll damage caused by, or received from, tool cards is prevented.\n\nCharacter ability 2: Dragon's Advocate 举荐 (jǔ jiàn)\nWhen the ending phase of your turn begins, you can discard 1 non-Basic card (ie: Tools cards, equipment cards, etc). If you do so, you let another player choose 1 of the following 3 possible actions:\n\n1. Draw 2 cards.\n\n2. Regain 1 unit of health.\n\n3. Flip over the character card such that it faces right-side up, and rotated in the vertical orientation (ie: chains are broken).\n\nAbility's relation to story:\nThe concepts of both ability are related closely to the story, however the mechanics are not congruent. \"Silence\" mirrors Xu Shu's refusal to offer Cao Cao any advice whatsoever after hopping over to Wei Kingdom. However it is clear that the mechanics of this ability provides a high level of immunity against all other characters, and not just against Cao Cao. Besides, Xu Shu refusing to advise Cao Cao almost got him killed instead of offering him protection.\n\nXu Shu never offered any advices to Cao Cao(cannot use TOOL CARDS against others). In RoTK, Xu Shu found out that Pang Tong wanted to shackle Wei’s ships to burn them all, but he does not remind Cao Cao. Instead, he stayed away from the battlefield to keep himself safe from the fire, so he is immune to other players’ TOOL CARDS. \n\nI gave the ability translation \"Dragon's Advocate\" a slight twist. The direct translation of 举荐 means \"to recommend\". But put into the context of the ROTK story, Xu Shu made one of the most important recommendations of all chinese history: he recommended Zhu Ge Liang and Liu Bei to each other. At that time, Zhu Ge Liang was known by his moniker \"Sleeping Dragon 卧龙\", thus the name of this ability deserves the Dragon prefix.\n\nSimilar to \"Silence\", the \"Dragon's Advocate\" ability does have its links to the story. Discarding your cards and allowing another player to draw mirrors Xu Shu's departure from Liu Bei (and withholding his ability thence forth) while creating an opportunity for Zhu Ge Liang. However this ability is not specific towards any character related to the story (such as Liu Bei, Zhu Ge Liang or Cao Cao). Regaining 1 unit of health is completely unrelated to the story/\n\nAdditional information based on story:\n1. Most famous achievement - Getting tricked by Cheng Yu 程昱 to leave Liu Bei and join Cao Cao. Cheng Yu was one of Cao Cao's advisors and was tasked to entice Xu Shu over to Wei Kingdom. Knowing that Xu Shu is a very filial son, Cao Cao summoned Xu Shu's mother and wanted to win her over, so that she could convince Xu Shu to hop over to his side. Unexpectedly, Xu Shu's mother cursed and insulted Cao Cao, so much so that Cao Cao ordered her executed for her insolence. Cheng Yu quickly intervened and instead ask Cao Cao to treat her like a guest. Cheng Yu then wrote a false letter, in it Xu Shu's mother uses loneliness and old age to convince Xu Shu to return to her side, which happens to be in the Wei Kingdom. Xu Shu reluctantly decides to leave Liu Bei and thus went over to Cao Cao's camp.\n\nHowever, upon seeing her son arrive in Wei Kingdom, Xu Shu's mother was enraged! She repeatedly scolded Xu Shu for being so stupid as to have fallen for such a simple ploy, at the same time giving up the opportunity to serve a noble such as Liu Bei. She leaves the room in anger, while Xu Shu ponders in disappointment. Within minutes, a maid alerts Xu Shu to terrible news. In a final act of defiance, Xu Shu's mother hangs herself, and thus Xu Shu is deeply overcome with sorrow. Although he is officially with Wei Kingdom, he never offered any advice to Cao Cao in his time there.\n\n2. Cause of death - Unknown. The widely accepted view is that Xu Shu died of either old age or sickness. There was no mention of him dying in battle or anything honorary. In fact ever since his mother's death, Xu Shu received very little attention due to his reclusion.\n\nWiki Link\nXu Shu Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"liú-shàn-刘禅","name":"Liú Shàn 刘禅","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgeerq1vfmNKtusrtojTLFDFsZceTRzKSnrRViKp2faWJJ4s2hT6HjzwZRjEk6vW2zT5cChyphenhyphenZ5SkGcqewzcC9iuURdHzguKJt0cUEpIsCaJkBq1g_b3tuCtiAMfxxgyugo3S7ttuh8V1FQ1/s320/liushan.jpg","text":"\nTranslated description: \n\"The King with a Laissez-faire Destiny 无为的真命主 (wú wéi dè zhēn mìng zhǔ)\"\n\nWho is he:\nLikely one of the most despised characters in the entire era, Liu Shan is the son and successor of Liu Bei 刘备. He took over the reins of the Shu Kingdom from an early age of 16 (the year that Liu Bei died), and is infamous for his inability as a ruler... or at least that is what the story wants us to think. There was a huge chunk of history missing between the years Liu Shan first ruled Shu till the fall of the kingdom 40 years later. In the absence of recorded facts, myths and rumours have not been kind to Liu Shan and painted a picture of an indulgent and indecisive ruler. Ultimately, the kingdom of Shu so painstakingly created by Liu Bei, Zhuge Liang 诸葛亮 and gang, was destroyed during Liu Shan's reign. Legend has it that Liu Shan's intellect was compromised when his own father threw the baby Liu Shan on the ground! Why would Liu Bei do such a thing? Read on to find out!\n\nCharacter ability 1: \"Relish 享乐 (xiǎng lè)\" [Enforced ability]\nWhenever other player targets an ATTACK 杀 at you, he/she must discard a basic card, or that ATTACK has no effect on you.\n\nCharacter ability 2: \"Devolution 放权 (fàng quán)\"\nYou can skip your action phase. If you do so, you can discard an on-hand card at the end of your turn and let another player go an extra turn.\n\nCharacter ability 3: \"Eiron 若愚\" [Ruler ability] [Awakening ability] \nAt the start of your turn, if your health is the least or among the least, you must raise your maximum health by 1 unit, regain 1 unit of health and permanently acquire get the ability \"Rouse 激将\".\n\n(Note: \"Rouse\" is Liu Bei's Ruler ability, where Shu characters can use an ATTACK on his behalf.)\n\nAbility's relation to story:\n\"Relish\" refers to Liu Shan’s lifestyle. Liu Shan was interested in playing and having fun, but never in politics. He continued to relish his material wealth and abundance even after the downfall of Shu. However, some say his indulgent lifestyle was all just a ploy to keep him away from danger. Even though he was captured by Wei forces, he was given nobility in Wei's courts and allowed to enjoy his final years in peace. The mechanics of this ability cleverly shields Liu Shan from ATTACKS, allowing him (you) to stay safe and happy.\n\n\"Devolution\" refers to his political strategies. He allowed his trusted officials to handle all state affairs, regardless of their capability. When he gave the power to wise people like Zhuge Liang and Jiang Wei 姜维, the Shu kingdom was efficient and strong. However, it proved to be a mistake to give such powers to Huang Hao 黄皓, the corrupt and incapable eunuch who Liu Shan trusted. The Shu kingdom quickly became chaotic, and ultimately crumbled. The game mechanics allows Liu Shan to \"devolute\" his action phase, granting an extra turn to another player that you trust. Don't make the same mistake as Liu Shan! Watch out for the defectors!\n\n\"Eiron\" is interesting. It comes from the Chinese phrase “大智若愚 (still-water runs deep, or the smartest people usually seems the dumbest)”. Although Liu Shan was thought to be an incompetent leader, some historians thought he was just feinting the fool. When Liu Bei was still alive, Zhuge Liang praised Liu Shan as benevolent, clever and receptive. Some historians also believe that when Sima Zhao 司马昭 invited him to a banquet (the banquet that became the basis of ACEDIA 乐不思蜀), Liu Shan played the fool without ambition so as to protect himself. Sadly, whether he really was a fool or a cunning actor, we will never know. In this game ability, however, Liu Shan need not feign the fool forever, but can unveil his disguise as a powerful leader as capable as Liu Bei.\n\nAdditional info based on story:\n1. Most famous achievement - Losing his \"brain cells\" when Liu Bei tossed him. Ok perhaps that's not exactly an achievement, but it's still very significant in popular folklore. At the battle of Chang Ban 长板之战, Zhao Yun 赵云 risked life and limb to rescue the baby Liu Shan from Wei forces. When Liu Bei saw the wounds that his beloved general suffered to save his son, Liu Bei tossed his baby to the ground and proclaimed \"To preserve that suckling I very nearly lost a great general!\" It is said that Liu Shan suffered a concussion as a result of Liu Bei's over-drama, and hence became \"stupid\" for the rest of his life.\n\n2. Cause of death - Old age. After living in captivity in Wei, Liu Shan never did think much about his own kingdom that he lost. All he seemed to care about was living a carefree life and having ample play-time. Thus Liu Shan was never again regarded as a threat and he was left to while away his remaining 8 years of his life under soft-captivity. He was aptly given the title \"The Duke of Peace and Comfort 安乐公\". Because of this, he has become almost synonymous with the sin of Acedia. He was aged 64 when he died.\n\nWiki Link:\nLiu Shan Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"jiāng-wéi-姜维","name":"Jiāng Wéi 姜维","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh7bCZDE4zwyPIlUKPbE_gTSF3wtn_9ZFQy5bxjYK3A2aC4P4yJRzSRXCWkmCEcQDXigEBvhcqcaqBBDiupoDANZB6UCe6zOattOyDDBoLMZLlZkWATlw4U464hM9uRpv-Ww-47wrbRBGnO/s320/jiangwei.jpg","text":"\n\n\nTranslated description: \n“The Protégé of the Dragon 龙的衣钵 (lóng dè yī bō)”\n\nWho is he:\nHe was to be the ultimate general. Said to have the charisma of Liu Bei 刘备, wisdom of Zhuge Liang 诸葛亮 and fighting ability of Zhao Yun 赵云, Jiang Wei was the only remaining hope for Shu in the dying days of the kingdom. Yet, as history would tell us, Shu was the first of the two major powers to be exterminated, what more while Jiang Wei was General-in-chief. What happened? While many would point to the incapable ruler Liu Shan 刘禅 who did not give Jiang Wei the support he needed, Jiang Wei himself was criticized as being reckless and single-minded. Nonetheless, Jiang Wei was a brilliant general that would truly have done Shu a lot of good had he been born 20 years earlier whilst Zhuge Liang and Liu Bei were still in power. Ultimately, Jiang Wei would be forced to surrender to Wei under instruction from Liu Shan, but his fighting spirit and loyalty would not be extinguished! He would go on to plan a grand coup that would have revived Shu, yet he died in the process. What happened? Read on to find out!\n\nCharacter ability 1: “Taunt 挑衅 (tiǎo xìn)”\nDuring the action phase, you can pick a player that is able to strike you using ATTACK 杀. That player must use an ATTACK on you. If the player does not do so, you can discard one of his/her card. Limited to once per turn.\n\nCharacter ability 2: “Recommence the Legacy 志继 (zhì jì)” [Awakening ability]\nAt the start of your turn, if you have no on-hand cards, you must regain 1 unit of health or draw 2 cards, then reduce your maximum health by 1 unit, and permanently acquire the ability “Star Gazing 观星”.\n\n(Note: \"Star Gazing\" is Elder Zhuge Liang's ability where he can view the top few cards of the deck at the start of his turn)\n\nAbility's relation to story:\nBefore Jiang Wei became the leading General of Shu, he was under the command of Fei Yi 费祎. Jiang Wei recommended taking up the offensive against the Wei Kingdom like Zhuge Liang once did, but Fei Yi was dead against the idea. Instead Fei Yi sent Jiang Wei to harass the Wei forces numerous times at the border, probably as a reminder that Shu forces are not sitting idle. This is probably the relation to the ability “Taunt”, and the ability mechanics, though simple, seem well-crafted to suit the ability title.\n\n“Recommence the Legacy” refers to Jiang Wei being seen as Zhuge Liang's most able apprentice, then carrying on his work and aspirations after Zhuge Liang's death. In this aspect, the ability mechanics is a perfect fit. After he is \"awakened\", Jiang Wei actually takes on the ability of Zhuge Liang and can \"Star Gaze\" to tell the future. In reality, though, Jiang Wei did not seem to inherit Zhuge Liang's god-like abilities. Furthermore, there is actually a gap in the story since Jiang Wei was never actually Zhuge Liang's disciple. Perhaps the actions taken by Jiang Wei to honor Zhuge Liang's wishes earned him that nickname.\n\nAdditional info based on story:\n1. Most famous achievement - The coup that almost saved Shu Kingdom. Once the incapable Liu Shan 刘禅 surrendered, Jiang Wei was also forced to surrender to Zhong Hui 钟会, the rival of Deng Ai 邓艾. Jiang Wei insidiously suggested to Zhong Hui that animosity be conjured between Deng Ai and the defacto Wei ruler, Sima Zhao 司马昭. The plan was successful initially because Zhong Hui himself was ambitious, albeit deluded, and planned to rule all of Wei. The cunning Jiang Wei sat on the bylines and watched as Zhong Hui forged letters that slandered Deng Ai to Sima Zhao. Eventually, Sima Zhao seemingly fell for the ploy and order Deng Ai be captured and executed.\n\n2. Cause of Death - Killed in the ensuing chaos. Sima Zhao was not as naive as Zhong Hui and Jiang Wei expected. Whilst a force was sent to arrest Deng Ai, another secret force was directed personally by Sima Zhao himself, headed straight for Zhong Hui. Zhong Hui knew that Sima Zhao had seen through his plan and had come to crush any new-found power Zhong Hui had at his disposal. The prudent Jiang Wei quickly advised Zhong Hui to kill all the key officers and stake a rebellion but Zhong Hui was slow to act. Once their own officers knew that Zhong Hui planned to exterminate them, all hell broke loose and in the carnage, both Zhong Hui and Jiang Wei were killed.\n\nWiki Link:\nJiang Wei Wiki\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"sūn-shàng-xiáng-孙尚香-(sp005)","name":"Sūn Shàng Xiáng 孙尚香 (SP005)","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgtSqQg8xJIjj0vB_L9rh9loOROot9xY2TjAICM_xCSSJUb1l3RTsqL43qVJZd19n_BcwhsypVVIFetLZPZgmyc5ER_dbsi7JkarhQLpp6eG2EeFNFcTef-kU27LI5-pFdImPSroodX2xDy/s320/spsunshangxiang.jpg","text":"\n\n\nTranslated Description\n“Exceptional Marriage 梦醉良缘(mèng zuì liáng yuán)”\n\nWho is she?\nA beautiful young bride wearing a traditional red wedding dress, sitting in the bridal chamber smiling mysteriously at you. Through the red chiffons, you seem to be able to smell the faint aroma around the new wedding bed, is she waiting for someone? Oh, I forgot I am not writing an erotic novel! So this girl is the SP version of Sūn Shàng Xiāng 孙尚香, Sun Quan 孙权’s younger sister and  Liu Bei刘备’s second wife. You are probably very familiar with her and her abilities in SGS. But why did they totally change her appearance? Keep reading and find it out!\n\nWhy is she an SP character?\nAccording to the designers of the SP characters, the female characters are always extremely popular and welcome among SGS players. That’s why they made a new version of Lady Sun. They didn’t just change her appearance, but also changed her allegiance from Wu to Shu. These two changes perfectly match both the story and the traditional custom in ancient China: From the moment she married Liu Bei, she no longer belonged to the kingdom of her birth. Makes you wonder then, if the normal Sun Shang Xiang is considered \"single\"... with cleavage showing and all it's no surprise!\n\nCharacter ability1: “Marriage 结姻 (jié yīn)”\nDuring the action phase, you can choose to discard 2 on-hand cards and pick any male character that is not at full-health. By doing so, both the male character and yourself will recover 1 unit of health each. Limited to only 1 use per turn.\n\nCharacter ability2: “Warrior Lady 枭姬 (xiāo jī)”\nWhenever any equipped card is removed from your equipped items area, you can immediately draw 2 cards from the deck.\n\n(Note that 2 cards can be drawn for each equipped card that is removed. This applies also to changing the equipped item (ie: replacing one weapon with another weapon).\n\n\nAdditional info based on changes:\nThere is no doubt that this version of Sun Shang Xiang is stronger than the previous one because the cooperation between her and Liu Bei is more useful and efficient than the one between her and Sun Quan. That’s why she always gets the most attacks in the game (there is a saying in Chinese 红颜薄命 which means “A beautiful girl often leads an unfortunate life). Anyway, the guys should feel really lucky that no matter how her appearance changes, she still keeps her G-Cup. Woo hoo!\n\nNote: according to the game designer, Sun Shang Xiang and SP Sun Shang Xiang won’t appear in the same game on SGS online. But for the off-line game there is no such limitation. And when SP Sun Shang Xiang uses PEACH 桃 to save her brother Sun Quan, he can no longer get an extra unit of health back.\n\nHow to obtain this character?\nShe is available on SGS online now! (Of course VIP only, or you can just buy it in SGS online market) For obtaining a card, purchase ZYZ magazine issue #6 (June 2011).\n\nWiki Link:\n- Sun Shang Xiang Wiki\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"mǎ-dài-马岱","name":"Mǎ Dài 马岱","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj4HLiArXwAiJlt8SKm60QIxh7pcnA345BWInFAgMdxAxnYlLmzI7vAWhWPbWSKW8aeqip1Cb3js3xZcfaHg0Hm7Kbl4ZM4T9WPI3uTZC2J9LMlsxZTUkVkE5rOIgjnUOwWFTv06Ii5G9G6/s320/madai.jpg","text":"\n\n\nTranslated Description:\n\"Entrusted during the crisis 临危受命 (lín wēi shòu mìng)\"\n\nWho is he:\nThis guy has a rather dirty resume, because his biggest credit is in tricking and murdering a \"compatriot\". Before we get to that, let's talk about his relations to other characters. Ma Dai was the cousin of Ma Chao 马超, though Ma Dai never quite got the fame (or infamy) of his cousin. He served for Shu Kingdom and was more notable during Zhuge Liang 诸葛亮's expeditions.\n\nBut enough riff-raff. Let's get to the juicy bit. Zhuge Liang once praised Ma Dai as one of the most loyal to Shu Kingdom. You could say that Zhuge Liang was right, because Ma Dai's loyalty led him to feint friendship with Shu's most famous traitor... Wei Yan 魏延. Ma Dai was part of Zhuge Liang's plot to keep check on Wei Yan as the latter seemed likely to revolt. True enough, Wei Yan turned rebel after Zhuge Liang's death, but Ma Dai seized the opportunity whilst an insider to assassinate the rebel. Give this man a trophy!\n\nCharacter ability 1: Horsemanship 马术 (mǎ shù) [Enforced Ability]\nIn distance calculations between you and other players, you will always be at -1.\n\nCharacter ability 2: Backstab 潜袭 (qián xí)\nWhenever you use ATTACK 杀 to cause damage to a player within distance of 1, you can flip a judgement card. If the judgement is not hearts, you prevent this damage and instead cause the player reduce his max health units by 1.\n\nAbility's relation to story:\n“Backstab” refers to his killing of Wei Yan. In ROTK, Wei Yan revolted against Shu Han. However, Zhuge Liang predicted that and entrusted a mission to Ma Dai before his death. Ma Dai falsely followed Wei Yan. When Wei Yan shouted out “who dares to kill me?”, Ma Dai slayed him from behind. The ability allows Ma Dai to reduce his enemy’s max. health, so Wei Yan cannot regain his health back by his ability “Insanity Streak”.\n\nHowever, this ability is buggy and overpowered. It is buggy because the presence of awakening abilities of other characters. Awakening abilities use max health as a sign to indicate whether that character has awakened or not. But with this character, it would be impossible. Also, for Deng Ai 邓艾, Jiang Wei 姜维, Sun Ce 孙策, and Zhong Hui 钟会, their awakening abilities require them to reduce 1 max health when awakening. What happen if Ma Dai has reduced their max health to 1…\n\nThe ability is overpowered because of it can reduce max health. As you may observe, 1 max health represents 1 normal ability in most characters. But for Ma Dai, he can reduce their max.health…even Cai Wenji can disable abilities at her death. Also, it is extremely powerful to all characters damage-triggered abilities (because it reduces max.health) and abilities related to lost health (e.g. Sun Jian 孙坚, Zhang Chunhua 张春华 and Wang Yi 王异).\n\nHow to obtain this character?\nMa Dai is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"liào-huà-廖化","name":"Liào Huà 廖化","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBjcKQqVWJFU1d5rLhOlDpm7nxRYU9ObbMOT9E11OG9nRmwEVF1zkerEOK1JgnXF05YqJunHGRpIZPCWr_r0ufmE6cZex5LjIZN30091ufM5I1dcgBDJApxdINj6T4eaxElUz8rRpHPIPE/s320/liaohua.jpg","text":"\n\n\nTranslated Description:\n\"Put through the Mill of Time 历经沧桑 (jīng lì cāng sāng)\n\nWho is he:\nNot many people live long enough to witness the birth, pinnacle, and extermination of a state. This old man is one of those rare people. In fact it is believed that he witnessed the entire ROTK timeline as a soldier. As a child soldier, he served under Zhang Jiao 张角 in the yellow turban rebellion, then under Guan Yu 关羽 and Liu Bei 刘备 under the early Shu formation, then Zhuge Liang 诸葛亮 and Jiang Wei 姜维 in the later days of the kingdom. He was alive for so long that he was still alive when the Jin Empire 晋朝 was formed.\n\nYet the criticism that some have (which I do not subscribe to) about Liao Hua is that he never did enough for Shu. Those who went beyond and excelled, such as Guan Yu, Ma Chao 马超, died valiantly in battle when they pushed too hard. I disagree with this. After all, Zhao Yun 赵云 did not die in battle. Nonetheless, Liao Hua is definitely one of those names that came up often in discussions of ROTK. This old man, he played one heckuva lifetime.\n\nCharacter Ability 1: Forefront 当先 (dāng xiān) [Enforced ability]\nAt the beginning of the turn, you perform an extra action phase.\n\nCharacter Ability 2: Longetivity 伏枥 (fú lì) [Single-use ability]\nWhen you are on the brink of death, you can regain X units of health (X being the number of allegiances still in play). After which you must flip your character card.\n\nAbilities relation to story:\nLiterally, 伏枥 means “stabled”. Ironically, 伏枥 comes from one of the sentences in Cao Cao's poem \"老骥伏枥，志在千里；烈士暮年，壮心不已: An old war-horse may be stabled, yet still it longs to gallop a thousand miles; And a noble-hearted man though advanced in years, never abandons his proud aspirations\". This ability was meant to generalize that Liao Hua possessed a long lifespan and his bluffing death. Liao Hua is the vanguard of Late Shu and he was likely the person with longest lifespan in Three Kingdoms Era (excluding the immortal Zuo Ci 左慈), thus giving the ability “Forefront”.\n\nI felt that \"Forefront\" was a nice-ability without a suitable name. They could have given that name to any character with Vanguard experience in the story, so I felt it's not really tied to Liao Hua. Liao Hua faked his own death in order to escape from Wu kingdom in order to rejoin Guan Yu. This ability has both the element of \"a second life\" and longevity. Well linked!\n\nHow to obtain this character:\nLiao Hua is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"guān-xìng-&-zhāng-bāo-关兴-&-张苞","name":"Guān Xìng & Zhāng Bāo 关兴 & 张苞","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPTHriXrGSwKsYWy2ye3L2-XHFrOp-LSlpyJYgbgZ9D31CtnY1C3gExSC5OfrEi1de9kwe2EsVLuQ3sjMtEwwufswWC1hfmNh-3TjqISy4OYdSsoZMKZ7o8an9ctwKkufD9XGZV6z_zKon/s320/guanxingzhangbao.png","text":"\nTranslated Description:\n\"Cubs of the Generals 将门虎子 (jiàng mén hǔ zǐ)”\n(Note: The title is a commonly used phrase for describing a boy coming from the family of a general, who would eventually inherit his father's skills and bravery.\n\nWho are they:\nThink George Bush Jr, or Lee Hsien Loong, and you get the general idea. True, neither Bush Jr nor Prime Minister Lee are \"generals\", but as the children of incredibly significant history-makers, the cubs are usually not too shabby in their abilities.\n\nGuan Xing is the second son of Guan Yu 关羽. His elder brother Guan Ping 关平 died with their father in the hands of Lu Meng 吕蒙. Zhang Bao is the eldest son of Zhang Fei 张飞, and first appeared in ROTK to inform Liu Bei 刘备 of his father's death. Both the cubs are strong fighters and well-liked by Zhuge Liang 诸葛亮, but both were urgent to avenge their fathers by leading the vanguard. They almost came to blows before Liu Bei intervened and forced them to swear an oath of brotherhood, just like their fathers did. From then on, they usually went into battle together.\n\nCharacter Ability: Spirit of their Fathers 父魂 (fù hún)\nIn the drawing phase, you can forfeit the drawing of cards and, instead, display the top two cards from the deck, then receive them. If the two cards displayed are of different colours, you receive the abilities \"Warrior Saint 武圣\" and \"Berserk 咆哮\" till the end of your turn.\n\n(Recall:\n\"Warrior Saint 武圣\"\nEvery card with a \"heart\" or \"diamonds\" suit (effectively all red-suit cards) can be used as an ATTACK 杀 card.\n\n\"Berserk 咆哮\"\nYou can use as many ATTACK 杀 cards as you wish during your turn.)\n\nAbility's relation to story:\nReaders are scathing in his comments for this character's ability. \"The ability allows Guan Xing and Zhang Bao to inherit the skills of their fathers respectively, without creativity…\" Well, their observation is a 100% accurate. Still, the ability sounds exciting and should make for interesting play. Given Liu Bei in the same team and this character will probably bring armageddon.\n\nHow to obtain this character:\nGuan Xing and Zhang Bao is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhang-fei-张飞-(*sp005)","name":"Zhang Fei 张飞 (*SP005)","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiTal94hvhxmisT7TotYUWHtAN5GhJeYIen3jBWVLSIXhGQcn0jNQMfJfNrDleru9PtHR_X1zOXq_4O7CDLpGZ8sjZctIs3UHQ20YjeDFW8XYskMMipLHU6qn06aPtYR7MFL26RWf88-AbF/s320/0b886051.jpg","text":"\n\n\nTranslated Description:\n“Spear-Ready, Horse-Mounted 横矛立马 (héng máo lì mǎ)”\n\nWho is he:\nIf you don't know Zhang Fei, you must be completely new to ROTK (in which case, you can read about him here). The hairy one gets a makeover, but thankfully his facial hair is just as overwhelming. I would have thought Zhang Fei is one of the last to need a revamp. His old character was simple, brutal, and very flexible. I think the new complicated mechanics are to Zhang Fei what variable acceleration technology is to a food blender: unnecessary.\n\nStill, i'm sure some out there would appreciate the more complex nature of the newer characters, and hopefully this new update would appeal to you.\n\nWhy is he an SP character?\nThere is only one reason I can think of that warrants an SP version of him. His ability was too simple (ie: had too few words), and was too clear-cut. Ambiguity is vogue now, and if don't have to re-read the ability description at least thrice, it's clearly out of fashion.\n\nCharacter ability 1: \"Indignation 嫉恶 (jí è)\" [Enforced ability]\nWhen you use red-suited ATTACK 杀 cards, the damage caused is +1.\n\nCharacter ability 2: \"Battle Cry 大喝 (dà hè)\"\nDuring your action phase, you can pick a player to points duel. If you win, all DODGE 闪 cards of that player that are not hearts-suit become ineffective till the end of the turn. You can pass the points duel card of that player to any player whose health is not more than yours. If you lose, you must display your hand of cards and select one card to discard. Limited to once per turn.\n\nAbility's relation to story:\nThe words “嫉恶” originates from the phrase 嫉恶如仇 (abhor evil as a deadly foe). It refers to Zhang Fei’s personality. When Zhang Fei saw wrongdoings, he would get enraged easily. There have been numerous instances where Zhang Fei lost his cool and did some pretty impulsive things, whipping an official and even fighting Guan Yu 关羽 just to name two.\n\n“Battlecry” referred to Zhang Fei’s contribution in the Battle of Changban. This section has been written extensively in the original Zhang Fei post as well as in DISMANTLE 过河拆桥.\n\nIncidentally, 大喝 (Battlecry) and 咆哮 (Barrage) have similar meanings in chinese. In the game, “Battlecry” is more likely referring to the whole action of Zhang Fei in the Battle of Changban. If Zhang Fei wins, Zhang Fei literally stunned his enemy. His ATTACK is less likely to be dodged, and he can take this chance to protect his comrade (by giving a card to him). If Zhang Fei loses, he is at a disadvantage, so his enemies can see through his intention (reveal on-hand cards) and one card needs to be ‘dismantled’ by Zhang Fei himself.\n\nHow to obtain this character:\nPurchase the 15th issue of Zhuo You Zhi magazine (April 2012) to get this limited character card as a free gift! (Coming soon to Sino-Games.com)\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"liú-beì-刘备-(*sp007)","name":"Liú Beì 刘备 (*SP007)","faction":"shu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhTCRo_kEFfkJ5X3Xo-SOLFYqDnxDVu_n4e1i8-lfvp5ItjNONVgKtv9KEAm4bmQFHddtO9946mPE_MBh-CcSbZczmd4j6yP4bYBsmmlCG18UuKVKMjEudMYZA0bxeJSEQ8sLZlRLNszWNg/s320/spliubei.jpg","text":"\n\n\nTranslated Description:\n\"The Shining Martyr Emperor of Han Dynasty 汉昭烈帝 (hàn zhāo liè dì)\"\n\nWho is he:\nReally? You do not know who he is? Come on!! Let's go straight to why the original Liu Bei needed an upgrade, shall we? He wasn't much of a Ruler character at all as he had little offensive powers and was more supportive and self-preserving.\n\nOr was he?\n\nMy honest opinion is that the original Liu Bei is fine just the way he is. If i'm playing a large match with 6 or more players, any side with Liu Bei is at a strong advantage.\n\nThat being said, this new SP character does have some interesting abilities. At first glance, it seems SP Liu Bei is over-powered, but on closer evaluation, he does seem quite balanced. Bear in mind that his first ability contains the component of choice on the part of the victim, so it's not as insane as it first sounds. His 2nd ability sounds really cool as well! But we'll have to play him to be sure.\n\nCharacter ability 1: Shining Martyr 昭烈 (zhāo liè)\nDuring your drawing phase, you can draw 1 card less, then ask a player within your attacking range to display the top 3 cards from the deck. Discard the non-Basic cards and PEACH 桃 amongst these 3 cards, (the remaining basic cards will be needed below).\n\nThe player must choose 1 out of the following 2 options:\n\n1. You inflict X units of damage on that player. The player then gets to acquire the remaining basic cards.\n\n2. The player discards X number of cards, and you acquire the remaining basic cards.\n\n(X is the number of non-Basic cards discarded amongst the 3 cards displayed.)\n\n\nCharacter ability 2: Oath of Vengeance 誓仇 (shì choú) [Ruler Ability] [Single-use Ability]\nAt the beginning of your turn, you can select 1 player from the Shu allegiance and give him 2 cards. Every instance you receive damage throughout the game, this other player will receive the same amount of damage on your behalf, then this player will draw as many cards as damage received. This ability will perpetuate until this player enters brink of death for the first time.\n\nAbility's relation to story:\nLiu Bei was given the title \"The Shining Martyr Emperor of Han Dynasty 汉昭烈帝\" posthumously, which is seemingly where this ability title came from. In no way does his first ability seem \"shiny\" nor \"martyr-ish\", but it does have an air of \"I am the bloody Emperor and watch me command you to do stupid things in a condescending manner, now spill your blood for me!\".\n\nThe title \"Oath of Vengeance\" refers to his historically huge blunder by attacking Wu to avenge Guan Yu 关羽. That does not seem to have much link to the ability though, as there was no mention of surrogates in the story relating to this event. In fact, \"Oath of Vengeance\" has the undertones of \"Bad idea\" associated with it's name, which is supposed to come back and bite Liu Bei. This ability does not seem to show any of this.\n\nHow to obtain this character:\nClick here to purchase this character from Sino-Games.com!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"}]