[
  {
    "id": "elder-zhu-ge-liang",
    "name": "Elder Zhūgě Liàng 暮年诸葛亮",
    "description": "Prime minister who has passed his prime 迟暮的丞相 (chí mù dè chéng xiàng)",
    "faction": "shu",
    "imageUrl": "elder-zhu-ge-liang.jpg",
    "abilities": [
      {
        "name": "Star Gazing 观星 (guān xīng)",
        "description": "",
        "explanation": "",
        "enforced": false,
        "ruler": false
      },
      {
        "name": "Empty City 空城 (kōng chéng)",
        "description": "Ability's relation to story:",
        "explanation": "In Romance of the Three Kingdoms, Zhu Ge Liang is given almost god-like powers that can predict the changes in weather, accurate to within the day that wind directions change. He is able to make these predictions from his knowledge of reading the stars, thus the game ability to \"predict\" what cards are coming up next with his \"Star Gazing\" ability. Ok so its outright manipulation of the cards coming up next, but heck might as well dramatize it more!\nThe \"Empty City\" ability comes from the famous ploy he uses to fool Si Ma Yi 司马懿. As all his troops have been sent out in missions, he was unable to defend himself from Si Ma Yi's attack of his current location (Xi Cheng 西城). In classical reverse psychology, Zhu Ge Liang empties the city, opens the city gates wide to welcome the invaders, and calmly plays the zither atop the gate in full view of the enemy. Si Ma Yi suspects an ambush and thus retreats. To replicate that effect, the game makers gave the player using Elder Zhu Ge Liang unsusceptibility to ATTACK and DUEL when the player has no more cards left to defend himself or herself.\nAdditional info based on story:\n1. Most famous achievement - Borrowing arrows with straw boats? There really isn't ONE famous achievement because he has so many!\n2. Cause of death - During a ritual ceremony to extend his life (no kidding!), Wei Yan 魏延 barges in and disturbs Zhu Ge Liang. He dies soon after from the effects of the disturbance.\nWikipedia link: \n* Zhu Ge Liang Wiki\n* Empty City Ruse 空城计\nTactics [By JonKow]:\nRuler (B+)\n(Elder) Zhuge Liang in my opinion is a pretty normal ruler character, there isn’t really any added bonus when he is the ruler except for the fact that “Empty city” makes him pretty much difficult to kill. With the rattan armour addition he is basically invulnerable to all attacks except “lightning” and character effect damages. Being difficult-as-hell-to-kill just makes him an awesome character for all roles and not just as a ruler. The “Star Gazing” ability gives Zhuge Liang the ability to control the cards he draws as well as probably the next player’s cards. As usual this ability is incredible and every role would benefit from it.\nLoyalist (B+)\nWell if your ruler is your “next” player, he is in for a treat, you can support your ruler by giving him the best cards via “Star Gazing” Well, like the above, nothing special.\nRebel (B)\nNow Zhuge Liang is not a very good rebel character to play. You might think that “hey, Zhuge Liang is so difficult to kill, he must be overpowered!” Well the way I see it, the rebels are generally easy to identify in a game, having a difficult to kill character would only induce your enemies to kill your allies, as much as you being able to assist them while being difficult-to-kill seems like a good idea, your allies might not be able to survive the heat and would soon be defeated leaving you facing whatever is left of your enemies. The lack of offensive abilities makes Zhuge Liang not very suitable for the role of a rebel.\nDefector (B)\nAs much as how I like to play as a defector, and how awesome Zhuge Liang is, I can’t really say that he is a good defector, yes he is good support, he is difficult to kill, but there isn’t really much of a game when he is the last player left. I mean seriously, how much can you do when your star gazing is only limited to 2 cards and you have simply no offensive abilities.",
        "enforced": true,
        "ruler": false
      }
    ],
    "sourceUrl": "https://sanguoshaenglish.blogspot.com/2010/07/elder-zhu-ge-liang.html"
  }
]
