[{"id":"cáo-cāo-曹操","name":"Cáo Cāo 曹操","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgLoBqOFvQ3BQ4OweKY2p7KlH17C-JHxUxpBabjLpxQ7zkPB_ELzNFp8cBRoB7M4ZM4DQgh3wm9G1zc6MFe_k7R_-hJuXV_EpudWjvp8K4IX6xO4B5LcDptlUigGnzdxjVs-XvDPuGHM_2z/s320/weicaocao.jpg","text":"\nTranslated description:\n\n\"Warrior Emperor of the Kingdom of Wei 魏武帝 (wèi wǔ dì)\"\n\n\nWikipedia link: Cao Cao Wiki\n\n\nWho is he:\n\nThe \"bad\" guy. The Machiavellian. The Julius Caesar of Ancient China... or at least that is what the story teller Luo Guan Zhong 罗贯中 wants you to think of Cao Cao. This guy is one interesting character; ruthless, intelligent, user of ploys and ambushes, but yet chivalrous at the same time. He treats his loyal subjects and talents with respect and admiration, yet is paranoid and fearful of assassinations. Perhaps it is due to his \"unpolitically correct\" way of achieving success (through ploys, ambushes, trickery and murder) that is the cause for his negative portrayal in the story. It is said that the story itself was heavily edited to downplay Cao Cao's accomplishments so as to emphasize Liu Bei 刘备's confucius-styled leadership. Either way, there is really no denying that Cao Cao is one great leader of his time and one of the most famous Chinese historical figures of all time.\n\n\n\nCharacter ability 1: \"Villainous Hero 奸雄 (jiān xióng)\"\n\nYou can immediately acquire the card (or cards) that resulted in you suffering damage.\n\nHere are some examples of how that works:\n\n\n\nExample 1 - When he is the target of ATTACK 杀, Cao Cao can choose not use DODGE 闪, suffer the 1 unit of damage, and acquire the ATTACK card that was used. \n\n\n\nExample 2 - When he is recipient of fire damage that has been transmitted via IRON SHACKLES 铁索连环, he receives the card that caused the fire damage even though he was not the initial target.\n\n\n\n[Edited 28th Jan 2011] Example 3 (complex scenario) - When he uses DODGE to evade an ATTACK but the attacker has equipped Stone Cleaving Axe 贯石斧 and chooses to discard 2 cards to cause damage anyways, Cao Cao suffers the damage but cannot pick up BOTH of the cards that were discarded to cause the damage. This is because the card that causes the damage is the ATTACK and not the discarded cards. Contrast this to the Serpent Halberd 丈八蛇矛, where the 2 cards used in that instance represents an ATTACK card, and thus Cao Cao can pick up both of those cards if he suffers damage.\n\n\n\nCharacter ability 2: [Ruler ability] \"Royal Escort 护驾 (hù jià)\"\n\nYou can ask any Wei character 魏将 to use DODGE on your behalf where applicable.\n\n\n\nAbility's relation to story:\n\n\"Villainous hero\" must be one of the best thought-of abilities in the game. It is not ridiculously powerful or god-like, very useful in the game, and a wonderful fit for Cao Cao's personality in the story. Every time he met defeat, Cao Cao would bounce back and bite the face off his opponents, then convince the enemy generals to surrender into his service. Such was the case of Zhang Liao 张辽, who surrendered to Cao Cao after Lu Bu 吕布 was defeated, then became one of the Kingdom of Cao Wei 曹魏's great generals. It was also mentioned that Cao Cao loves only women who have already been taken, then relish the thought of snatching the woman away from her partner.  As for \"Royal escort\", Cao Cao has had his ass saved countless times by his generals, who always appear just in the nick of time.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - He set the foundations for the Kingdom of Cao Wei, which became the precursor unifying the whole of China under the rule of Si Ma Zhao 司马昭. Though by that time, Si Ma Zhao had usurped Cao Wei for his own and established the Jin Dynasty of China 晋朝 (AD 265 - 420), nevertheless Cao Cao really was the father of all that groundwork. No Cao Cao, no Jin Dynasty, history would be completely different! Simple as that.  \n\n\n\n2. Cause of death - Cao Cao experienced endless headaches in his dying days. To cure him, his subjects brought him the most famous doctor of the time, Hua Tuo 华陀, who diagnosed his sickness as some form of rheumatism of the skull. Hua Tuo proposed to hack Cao Cao's head open for surgery, which in the century AD 200 is pretty much insane! Cao Cao, being all paranoid about assassination attempts, tossed Hua Tuo into jail for the suggestion. Without the doctor to cure him, Cao Cao succumbed to the sickness (whatever it was) soon after.\n\n\n\nFAQ and Disambiguation\n\n\n\n\n1. Can Cao Cao acquire all the cards that caused damage to him such as Raining Arrows (both cards by \nYuan Shao), Serpent Halberd (2 cards) and etc.\n\n\n\nAns: Yes he can, as long as those cards are the cause of damage. He cannot pick up cards that we\ndiscarded” to cause damage, such as Dian Wei’s ability.\n\n\n\n2. Can Cao Cao pick up any card for his “Villainous Hero 奸雄” ability if he has been damaged by Xia Hou Dun’s “An Eye for an Eye 刚烈” ability?\n\n\nAns: No he cannot. This is because his Villainous Hero ability only lets him pick up the cards that cause him damage. An Eye For An Eye is a character ability, not a card. Therefore Cao Cao cannot pick up any \ncard.\n\n\n\n3. Can Cao Cao pick up the ‘’Attack’’ card if  you were to use ‘’Attack’’ on Da Qiao and Da Qiao throws a card to deflect to Cao  Cao?\n\nAns: Yes he can, provided Cao Cao suffers damage. (ie: if the attack deflected by Da Qiao has been dodged, Cao Cao cannot pick it up)\n\n\n4. Can Cao Cao pick up the original ‘’attack’’ card if you were to use ’’attack’’ on Xiao Qiao and she threw a heart card to deflect damage to Cao Cao?\n\nAns: Yes he can.\n\n\n5. Does Cao Cao gets to take a card  if he gets struck by Zhang Jiao’s lightning?\n\nAns: No he does not get to take a card. This is because the damage was caused by an ability ,not a card.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"guō-jiā-郭嘉","name":"Guō Jiā 郭嘉","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEilhkJYh6AmpY9SjuIS97Idb3YoTvZanJ8I2ARHRFUA0FPQwN2b5IRryEWzkksL_9gF7tfAOjtX6HOSXx0kCrh9Ra58s9wplJuEulv4vlowoREYBSvozvTWlWuk5BHZ9nPcFP_cn3iCcROj/s320/weiguojia.jpg","text":"\nTranslated description:\n\n\"The oracle who died young 早终的先知 (zao zhong de xian zhi)\"\n\n\n Wikipedia link: Guo Jia Wiki\n\nWho is he:\n\nIt is said that Cao Cao 曹操 would have won the war if Guo Jia had lived longer. In the early days of Cao Cao's expeditions, there were usually more than one advisor by Cao Cao's side, but Guo Jia's analysis of situations and predictions always seemed to be correct. It is a pity that Guo Jia and Zhu Ge Liang 诸葛亮 belonged to two different chronological segments, and thus never had a chance to compete head-to-head. Despite knowing his days were numbered, Guo Jia could accurately predict how the near future would unravel. On realizing that Guo Jia was absolutely right about how things played out even weeks after his death, Cao Cao wept for the loss of this amazing talent. Like Dian Wei 典韦, Guo Jia died much too early and severely handicapped the potential of Cao Cao's army. The game makers of San Guo Sha 三国杀 paid adequate tribute to the brilliance of Guo Jia by making him one of the most powerful and most popular characters in the entire game. A search of player comments on forums turn up numerous praises for Guo Jia, with many declaring him their all-time favorite character to use. \n\n\n\nCharacter ability 1: \"Envy of Heaven 天妒 (tiān dù)\"\n\nYou can obtain any judgement card that you flip over.\n\n(For example, every time he undergoes judgement for LIGHTNING 闪电 during his turn, he can keep the judgement card that he flipped over. However if he uses ATTACK 杀 on a player that equipped EIGHT TRIGRAMS 八卦阵, Guo Jia cannot keep the judgement card for judgement of EIGHT TRIGRAMS because that card would be flipped over by the target player and not himself.)\n\n\n\nCharacter ability 2: \"Bequeathed Strategy 遗计 (yí jì)\"\n\nFor every 1 unit of damage that you receive, you can draw 2 cards from the deck. You can then choose to give away one, two, or none of these 2 cards to any player. \n\n\n\nAbility's relation to story:\n\nBrilliant!!! The chinese name for \"Envy of Heaven\" is called 天妒 and is short for a more common phrase called 天妒英才 (tiān dù yīng cíi). It translates as \"heaven is jealous of a person with such immense intellect/skill/potential\" and is morbidly used to describe rare talents who died young. Chinese like to think that heaven struck them down out of jealousy. Guo Jia's \"Envy of Heaven\" ability seems to mock the heavens as he can benefit from heaven's will (judgement cards). \"Bequeathed Strategy\" is equally apt as it almost re-enacts Guo Jia's contribution to Cao Cao after dying. Read more about the story behind \"Bequeathed Strategy\" below.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Guo Jia's bequeathed strategy to Cao Cao. After Yuan Shao 袁绍 and his sons Yuan Shang 袁尚 and Yuan Xi 袁熙 were defeated by Cao Cao, Guo Jia died of illness. He left Cao Cao a secret strategy that said Yuan Shang and Yuan Xi would flee to join Gong Sun Kang 公孙康 and told Cao Cao not to pursue. Guo Jia predicted that Yuan Shang and Yuan Xi's heads would be sent by Gong Sun Kang as long as Cao Cao did not make any move against Gong Sun Kang. This went against the advice of many of Cao Cao's generals, who felt they should crush the brothers while they were weak. True enough, everything that Guo Jia predicted came true.\n\n\n\n2. Cause of death - During the northern expedition to erradicate the Yuan brothers, Cao Cao's army travelled light for speed but was ill-prepared for the terrible weather. Guo Jia fell sick along the journey and was unable to join Cao Cao at the battles. By the time Cao Cao returned after the battle was won, Guo Jia had already succumbed to his illness. He was 37. \n\n\nFAQ and Disambiguation\n\n\n\n1. Does Guo Jia’s second ability activate even if he is left with 1 unit of health and has no dodges or peaches ?\n\n\n\nAns: Yes, it activates but only after he is saved from the brink of death. He cannot draw 2 cards until after he is saved.\n\n\n\n2. Does Guo Jia gets to draw 6 cards if he is struck by lightning with 1 health left and is saved?\n\nAns: Yes , he can draw 6 cards if he is saved from such a disaster.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"sī-mǎ-yì-司马懿","name":"Sī Mǎ Yì 司马懿","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh6YAsSgOXsly4YaEV1-TogbZrDzdw4tS-dWaXu0_4zH27oFUfwp3YkDTLD6fa0vdR1PWGuDY5NUFBjosN44uko-cLQEujIQYpR531Y4C_738YJPXkduYbUmwCTL7OzPb3JRqMGXrNV4iif/s320/weisimayi.jpg","text":"\nTranslated description:\n\n\"The Devil with eyes behind his head 狼顾之鬼 (láng gù zhī gǔi)\"\n\n\n(狼顾 means a \"cautious wolf\" always on the lookout for enemy ambush. It is referring to a legendary ability of Si Ma Yi where he can turn his head around 180 degrees.)\n\nWikipedia link: Si Ma Yi Wiki\n\n\n\nWho is he:\n\nThe cunning. The scheming. The ultimate bad guy. He is the beginning of the end of the Three Kingdoms era. If you have never read Romance of Three Kingdoms, my apologies for the spoiler. We are talking about a man of ambition so great, it transcended two generations after his death before it was achieved. Portrayed as cunning and untrustworthy with promises, Si Ma Yi is practically demonized by the story. No doubt he was the most important military advisor the Kingdom of Cao Wei 曹魏 ever had, time would never dilute his usurper legacy that erased Cao Wei off the face of the planet. As tribute to this incredibly smart yet devious historical figure, the card game has aptly given Si Ma Yi abilities that make him a formidable opponent. Meet the most dangerous character in the entire San Guo Sha 三国杀 card game.\n\n\n\nCharacter ability 1: \"Retaliation 反馈 (fǎn kuì)\"\n\nWhen you receive any damage, you can obtain 1 card (whether on-hand or equipped) from the player who is the source of the damage.\n\n(In most cases, source of damage is the player who is currently in the action phase (that player's turn) that played an offensive move. This is true even if the damage was transmitted through IRON SHACKLES 铁索连环, or deflected of another character such as Xiao Qiao 小乔's \"Heavenly Scent 天香\" ability.)\n\n\n\nCharacter ability 2: \"Demonic Talent 鬼才 (guǐ cái)\"\n\nAfter any judgement card has been flipped over, you can immediately play one of your on-hand cards to replace the judgement card.\n\n(Note that Si Ma Yi cannot take back the original judgement card. Net effect is Si Ma Yi loses one on-hand card to change the judgement card.)\n\n\n\nAbility's relation to story:\n\nIt is generally well-known that Si Ma Yi was a smart and shrewd strategist, but no, he was not smart enough to tinker with heaven's will. The abilities themselves do not reflect Si Ma Yi as well as how these abilities are used during game play. As a \"Judgement Tinkerer\", Si Ma Yi can just crouch inactively, waiting for judgement cards to appear before he rears his ugly head. This somewhat resembles the life mission of Si Ma Yi as he lay in wait for the right moment, then pouncing on opportunity to usurp an entire Cao Wei kingdom for his own. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - The man that started the end of the Three Kingdoms era. Si Ma Yi handed down power to his son and grandson, who ultimately concurred all of China to form the Jin Dynasty 晋朝 (AD 265 - 420).\n\n\n\n2. Cause of death - Si Ma Yi died of old-age at 72. His son Si Ma Shi 司马师 took over the reigns and strengthened his family's control over Cao Wei, followed by his grandson Si Ma Zhao 司马昭 who united China. \n\nFAQ and Disambiguation\n\n1. From whom does Si Ma Yi draws a card from the following scenarios?\n\ni . After Si Ma Yi loses a duel with someone\n\n Ans: The person he is duelling with. With Diao Chan's ability, Si Ma Yi does not draw a card from Diao Chan, but instead the person he was forced to duel with.\n\nii. After being attacked by a player that he cannot dodge\n\nAns: The player that attacked him.\n\niii. If someone plays barbarian or raining arrows and damages Si Ma Yi\n\nAns: From the player that used those cards. Exception is when Barbarians is used when Meng Huo is around, then Si Ma Yi will pick from Meng Huo.\n\niii. How about lightning? Does he get a card from the player who played the lightning in the first place?\n\nAns: No. In this case, he does not pick from anyone.\n\n\n2. Must the card that Si Ma Yi takes from the player be random, a card chosen by the victim, or a card chosen by Si Ma Yi?\n\nAns: It should be a card chosen by Si Ma Yi. It can either be on-hand or equipped.\n\n\n3. Can Si Ma Yi take the lightning card if he is struck?\n\nAns: No.\n\n4. Can Si Ma Yi take away  pending judgement cards using his ability?\n\nAns: Yes he can.\n\n5. Does Si Ma Yi takes cards from Zhang Jiao or the person that attacked Zhang Jiao if he gets damaged by Zhang Jiao's lightning strike?\n\nAns: From Zhang Jiao,as he is the one who dealt with the damage.\n\n6. Does Si Ma Yi gets to take a card per unit of damage or per instance of damage?\n\nAns: Per instance. He still gets only 1 card even if he is dealt more than 1 damage in a single attack.\n\n7. Does Si Ma Yi gets to take a card from Xiao Qiao if she deflected damage to him?\n\nAns: No. This is because the source of damage is not Xiao Qiao.\n\n\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xià-hóu-dūn-夏侯惇","name":"Xià Hóu Dūn 夏侯惇","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiQCnDbDUVGU30MKUIdx0uoiWpm_XCp5V1mrrpL2fA7jIDNCxYe2iXed6kdO4RZM850gak2OF0tDbdVyqJ4kC1PzuR1bdCuxR_Jbb9QF8n51vo50o3j2qwiro1YHIKwVUSa1YrFJD8G9Tfv/s320/weixiahoudun.jpg","text":"\nTranslated description:\n\n\"One-eyed Demon 独眼的罗刹 (dú yǎn dè luó chà)\"\n\n\nWikipedia link: Xia Hou Dun Wiki\n\n\nWho is he:\n\nBest remembered for the scene where he lost his eye, Xia Hou Dun is a ferocious combat general with balls of steel and fiery determination. He is one of Cao Cao 曹操's most loyal generals and is supposedly a distant relative. The story goes that Xia Hou Dun was caught in an ambush and suffered an arrow to his eye. His troops were panic-stricken, thinking that their general had fallen. But then Xia Hou Dun grabbed the arrow and yanked it out of his head, pulling with it his eyeball skewered on the arrow shaft. With one gulp he swallows his own eyeball, then charges right back at the assailant. Needless to say, the assailant died a horrible death when Xia Hou Dun got to him. His act of swallowing his eye-ball rallied his troops' morale and scared the shit out of his enemies. Henceforth, the name of Xia Hou Dun has become synonymous with bravery and gung-ho.\n\n\n\nCharacter ability: \"An Eye for an Eye 刚烈 (gāng liè)\"\n\nEvery instance you suffer damage, you can flip a judgement card. If the judgement is not the suit of \"hearts\", the source player that caused the damage can choose 1 of 2 options.\n\n\n\nOption 1: Lose 1 unit of health\n\n\n\nOption 2: Discard any 2 on-hand cards \n\n\n\nAbility's relation to story:\n\nI could not help but use a pun to translate 刚烈 as \"an eye for an eye\". The most straightforward link to the story is where Xia Hou Dun impales Cao Xing 曹性 for firing the arrow that wasted his eye. It is said that Xia Hou Dun impaled Cao Xing's face before trampling his body beneath his horse. In the cardgame, this ability is a very effective deterrent to opponents. A wonderful psychological link to the story in terms of the effect Xia Hou Dun has on his enemies.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Losing his bloody eye!\n\n\n\n2. Cause of death - In the historical account, Xia Hou Dun dies of an illness at an age of approximately 50 - 60 years old. But this defers from the Romance of Three Kingdoms story which dramatized his death as being caused by an encounter with Guan Yu 关羽's ghost. In the olden days, illnesses were very much attributed to supernatural reasons, thus it is not too far-fetched for readers to believe (especially in the 1300's when the story was written). \n\nFAQ and Disambiguation\n\n\n1. If Xiao Qiao were to attack Xia Hou Dun and he loses health, then he judgement card for ''An eye for an Eye'' is spades, will Xiao Qiao's ability change the spades to hearts?\n\nAns: No, it will still be spades.This is because the judgement is done by Xia Hou Dun. It is HIS judgement and not Xiao Qiao's so Xiao Qiao's ability does not apply.\n\n\n2. If Xiao Hou Dun's victim of his ability does not have cards on his hand, can he elect to discard from his hands and thus, nothing happens?\n\nAns: No he cannot.He will have no choice but to suffer damage.\n\n\n3. Can the victim of  An Eye for an Eye discard equipped cards?\n\nAns: No. The victim can only discard on-hand cards,not equipped cards.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xǔ-chǔ-许褚","name":"Xǔ Chǔ 许褚","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj2p73MDuZonYCxHWhvi3L6KtnMzfFCZ_a0LRPjD8nRS0UNoXHeViCeUH6E8L6lvJrX4XGT4Lb6f25IfDK2p1cexuYs8OYvCPB8_iYmTkgH2crO3Ak0lD4jriHf66wh7h-DKXeiOoaljCeT/s320/weixuzhu.jpg","text":"\nTranslated description:\n\n\"Insane Tiger 虎痴 (hǔ chī)\"\n\n\nIt has been said that 痴 means fool in this context. Thus Xu Chu is also known as \"Foolish Tiger\" for his obedient, simple-minded character. I shall leave this in its ambiguous form.\n\n\n\nWikipedia link: Xu Chu Wiki\n\n\n\nWho is he:\n\nLong-serving bodyguard of Cao Cao 曹操, Xu Chu was said to be a huge person. His height was about 2 meters and his waist 52 inches. Probably one of the 20 most famous characters in Romance of Three Kingdoms, he has significant air-time in the story for the many instances that stood forth to protect Cao Cao. His combat ability was reputed to be on par with Zhang Fei 张飞, Guan Yu 关羽 and company. His moment of glory came in the fictional account of him stripping off all his armour for his fight with Ma Chao 马超. This bravado mixed with insanity helped him secure a place in history.\n\n\n\nCharacter ability: \"Bare-Chested 裸衣 (luǒ yī)\"\n\nYou can choose to draw 1 card less in your drawing phase. If you to do so, any ATTACK 杀 and DUEL 决斗 that you use in the action phase results in 1 additional unit of damage to your opponent.\n\n(Note that if Xu Chu loses the DUEL, he only needs lose 1 unit. But if he wins, the victim loses 2 units.)\n\n\n\nAbility's relation to the story:\n\nIn his duel with Ma Chao, the two generals were fairly matched for over a hundred rounds. Xu Chu then momentarily backs off, strips off all his armour, then goes back to continue the duel bare-chested! This act of madness is followed later by his discarding his sword and grabbing Ma Chao's spear under his armpit. The ensuing struggle snaps the spear in two. The two then hack at each other with their halves of the broken spear. No wonder that Ma Chao later describes Xu Chu as a tiger gone insane.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - His strip-tease episode as mentioned above.\n\n\n\n2. Cause of death - Xu Chu probably died of old-age. He served 3 generations of Cao Cao's family: under Cao Cao, followed by Cao Pi 曹丕 after Cao Cao's death, followed by Cao Rui 曹睿 after Cao Pi's death. His loyalty to the Cao family was unquestioned. He was then posthumously titled Zhuang Hou 壮侯 (Marquis of Strength).\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-liáo-张辽","name":"Zhāng Liáo 张辽","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjEwl3sFFMX9TFDycrXoW2CVgP-rDuGFqQ9fDLtXm_7xr_TH-NLCDPRzXkb_UEr2AeV5T22YNclimKWILREV1qHwz6h0ClXI3x5cYdyoI5wPYb88VGce8OW7pvYYQY6GxeGp-l260gEqU61/s320/weizhangliao.jpg","text":"\nTranslated description:\n\n\"General of the Front 前将军 (qián jiāng jūn)\"\n\n\nThe word \"front\" here refers to \"frontline\".\n\n\nWikipedia link: Zhang Liao Wiki\n\n\nWho is he:\n\nSupposedly one of the top 5 generals of the Kingdom of Cao Wei 曹魏, Zhang Liao did not initially intend to follow under Cao Cao 曹操. In fact, Zhang Liao offered his neck for Cao Cao for beheading rather than choose to surrender. While Zhang Liao was serving Lu Bu 吕布, word had already went around of Zhang Liao's combat ability and his righteous character. Guan Yu 关羽 once asked him why he was serving for a man such as Lu Bu and Zhang Liao could only look down in shame. The two later became fast friends, though circumstances dictate they had to be enemies. Zhang Liao achieved renown under Cao Cao as a steadfast and competent general. His title of \"General of the Front\" was given to him by Cao Pi 曹丕 after Cao Pi succeeded Cao Cao. \n\n\n\nCharacter ability: \"Sudden Strike 突击 (tū jī)\"\n\nIn your drawing phase, you can choose to forgo drawing cards from the deck and, instead, draw 1 on-hand card from other players. Maximum 2 players (2 cards nett intake), minimum 1 player (1 card nett intake).\n\n\n\n(Note that Zhang Liao cannot mix \"Sudden Raid\" with drawing from the deck (ie: he cannot draw one card from the deck and one card from a player). Also note that since this ability is effective in the drawing phase, this ability cannot be used if he falls victim to RATIONS DEPLETED 兵粮寸断.)\n\n\n\nAbility's relation to story:\n\nThis part of the story occurs in the battle of He Fei 合肥之战 where Sun Quan 孙权, ruler of Sun Wu 孙吴, led a massive army to attack He Fei. Zhang Liao was one of 3 Cao Wei generals guarding He Fei, but they only had a combined army of 7000 men, many times less than the enemy. Leading the troops out, Zhang Liao bravely charged into the enemy and his combat prowess scared the balls off his enemy. Sun Quan's troops started deserting, not really knowing how large Zhang Liao's army was. Sun Quan climbed up a hill and saw that Zhang Liao was vastly outnumbered. He ordered his troops to encircle Zhang Liao. Unexpectedly, Zhang Liao suddenly charged out of the encirclement (thus the name \"Sudden Strike\") with a handful of troops and made straight for Sun Quan. The rest of Zhang Liao's troops cried out to him, \"General! Have you abandoned us?!\" Hearing this, Zhang Liao turned back and rescued his troops from certain death. Both parties grew weary and tired, thus they broke battle and headed back to camp.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - His cursing and swearing at Cao Cao and his refusal to surrender. This occurred early on in the story where Zhang Liao's leader Lu Bu had been executed by Cao Cao. In contrast to Lu Bu, who pleaded for mercy, Zhang Liao cussed Cao Cao endlessly and refused to surrender. Cao Cao was pissed off enough to bring a sword and wanted to decapitate him personally. Zhang Liao responded by sticking his neck out and welcoming death. Liu Bei 刘备 and Guan Yu 关羽 intervened and pleaded for Zhang Liao to be spared. Impressed by Zhang Liao's righteousness and courage, Cao Cao then put down his sword and personally unbound Zhang Liao. It was thus that Zhang Liao came to respect Cao Cao the same and, thence, began a great leader-servant relationship.\n\n\n\n2. Cause of death - Zhang Liao suffered an arrow wound after rescuing Cao Pi from Wu forces. Though they were all eventually rescued by Xu Huang 徐晃, Zhang Liao succumbed to his wound and died soon after.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhēn-jī-甄姬","name":"Zhēn Jī 甄姬","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj0n0v6v2Ts2RGUlO8R-WXWpjabKTjKX_cb0tWLWSWV3_RuXmIs1k6RfB6aLghgSH_olD3o_w0v2U3dyWF1WQhZvOI_fqtzliUWSSCfLZGC-pD9iVDXwxTkY8RsN6Ox7CzrrWZrTs15AJVy/s320/weizhenji.jpg","text":"\nTranslated description:\n\n\"The ill-fated Beauty 薄幸的美人 (bō xìng dè měi rén)\"\n\nWikipedia link: Zhen Ji Wiki\n\n\nWho is she:\n\nAn extremely beautiful woman with smarts and capability, Zhen Ji was Cao Pi 曹丕's first wife. The word 姬 is a title for \"lady\". Thus her real name is not Zhen Ji, but rather Zhen Luo 甄洛. Her life was a down-hill rollercoaster of misfortune and victimization. She lost her father at the age of 2, was married to Yuan Shao 袁绍's son Yuan Xi 袁熙, but was forcefully remarried to Cao Pi after he became obsessed with her beauty. After giving birth to Cao Rui 曹睿, she fell out of favor with Cao Pi due to rumours and bad-mouthing from his concubine, Guo Nu Wang 郭女王. Zhen Ji never did manage to win back Cao Pi's favor. Instead, the bad-mouthing from Guo Nu Wang became worse. Zhen Ji paid the ultimate price when Cao Pi, poisoned by Guo Nu Wang's words, forced Zhen Ji to commit suicide. \n\n\n\nCharacter ability 1: \"Impetus for War 倾国 (qīng guó)\"\n\nEvery one of your on-hand card that is a \"club\" or a \"spade\" suit can be used as DODGE 闪.\n\n\n\nCharacter ability 2: \"Goddess Luo 洛神 (luò shén)\"\n\nAt the beginning of your turn, you can flip a judgement card. If the judgement card is a black-suited card (\"clubs\" or \"spades\"), you can keep the card as an on-hand card and can continue to flip over another judgement card. Once the judgement card is red-suited card, the ability ends and you cannot keep that red-suited card.\n\n(Important note: This ability takes precedence BEFORE the judgement of time-delay tool cards (such as LIGHTNING).\n\n\n\nIt is perfectly possible for Zhen Ji to amass over 10 cards in a row using this ability, provided it is a string of consecutive black-suited cards. It is also perfectly possible to amass none at all if the very first card is red-suited. \n\n\n\nNote that after the ability ends, Zhen Ji can still draw 2 more cards from the deck as per normal. (Yes she will have a shit load of cards if she's lucky!)\n\n\n\n\nAbility's relation to story:\n\n\"Impetus to war\" is not linked to the story. Though we know that Cao Pi peeled her from Yuan Xi, she was not the reason Cao Cao destroyed Yuan Shao and family. This ability is probably centered around game mechanics than history. \"Goddess Luo\" stems from a poem written by Cao Zhi 曹植, Cao Pi's brother, known as \"Goddess of the Luo River 洛水之神\", apparently praising the goddess for her ethereal beauty, intelligence and capability. It is rumoured that Cao Zhi had an affair with Zhen Ji.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Giving birth to the man who would become Emperor of Wei, Cao Rui. This became the sore point that eventually led to her death, because Guo Nu Wang poisoned Cao Pi into believing that Cao Rui is not his child but Yuan Xi's.\n\n\n\n2. Cause of death - Suicide... but more likely forced than willing. The exact method of death is unclear, but one story goes that Cao Pi personally handed her a glass of poison to drink. Zhen Ji knows full well what it means, so after drinking but before the poison takes effect, she cleans the glass. This is so as to protect Cao Pi's reputation, since for an emperor to murder his own wife is detrimental to his reign. \n\n\nFAQ and Disambiguation:\n\nGoddess Luo\n1. If Zhen Ji has a RATIONS DEPLETED 兵粮寸断 or ACEDIA 乐不思蜀 awaiting judgement, does the judgement for \"Goddess Luo\" ability come first, or the judgement for these tool cards goes first?\n\nAns: Goddess Luo goes first. Once the ability is concluded, then judgement of the tool cards is next.\n\n\n2. Can the judgement cards for Goddess Luo be tinkered with by Si Ma Yi 司马懿 or Zhang Jiao 张角?\n\nAns: Yes! Both these characters can change the Goddess Luo judgement cards.\n\n\n3. If the judgement card is tinkered by Si Ma Yi or Zhang Jiao, does Zhen Ji keep the card after tinkering or before?\n\nAns: Zhen Ji keeps the card AFTER tinkering.\n\n\n4. If a red-suited card is flipped for this ability, but Si Ma Yi changes it to a black-suited card, can Zhen Ji continue to use the ability to amass more cards?\n\nAns: Yes she can.\n\n\n5. When Zhen Ji flips a card using her GoddessLuo ability, are these flipped cards considered judgement cards?\n\nAns: Yes they are judgement cards.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"diǎn-wěi-典韦","name":"Diǎn Wěi 典韦","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBgbn2EyVaBqrkS3GIOhIgS8FTBkBLhK5xO116SoqUfK-iyvG4RkbJql7OZk481HJ3h47NGhyphenhyphenWDZpNPjaJjXZU91JDfqxfmAaTRGzF42OKF0wv3YiiZZ5cOC1Pnb-gpPtr4Ss8c7SbGI86/s320/weidianwei.jpg","text":"\nTranslated description:\n\n\"The E-Lai of ancient times 古之恶来 (gǔ zhī è lái)\"\n\n\nThis requires a little explanation. \"E Lai 恶来\" was a stout hero in ancient times (yes even more ancient than the Three Kingdoms) who was so freaking strong he could tear up a tiger with his bare hands. E Lai served King Zhou 纣王 in the Shang Dynasty 商朝. The Shang Dynasty dates back more than 1000 years before the Three Kingdoms era (BC 1600 - 1000 approx).\n\n\nWikipedia link: Dian Wei Wiki\n\n\nWho is he:\n\nThe incredible Hulk of ancient China. Dian Wei was reputed to have superhuman strength and was Cao Cao 曹操's trusted bodyguard. Sadly, though, most people who know the story would remember Dian Wei for his premature death. While alive, he was extremely loyal to Cao Cao and was always seen by Cao Cao's side. He uses a unique pair of Halberds that weighs 20kg each (yeah right!!!) that is never again mentioned in the story after his death. Even in death, Dian Wei still got airtime in the story because every time Cao Cao passed nearby Dian Wei's tomb, he would pay a visit and weep for the loss of his bodyguard.\n\n\n\nCharacter ability: \"Ferocious Assault 强袭 (qiáng xí)\"\n\nDuring the action phase of your turn, you can inflict 1 unit of damage to any player within your attacking range by either 1 of these 2 actions:\n\n\n\n1. Reducing 1 unit of your own health, or\n\n2. Discarding 1 \"weapon card 武器牌\" (can be on-hand or currently equipped)\n\n\n\nLimited to one use per turn.\n\n\n\nAbility's relation to story:\n\nThis ability, in my opinion, is related to the circumstances that killed Dian Wei. His enemies knew that Dian Wei is feared because of his dual halberds. Just prior to the attack, a defector stole his pair of halberds while Dian Wei was sleeping. When Dian Wei awoke during the chaos, he found his halberds missing but fought on with his bare hands anyway. Dian Wei then grabbed enemy soldiers and swung them about like batons, using the enemy themselves as weapons. However, Dian Wei was still wounded and slowly bled to death, all the while fighting like a mad man and killing many before he took his last breath. Therefore I see a connection between \"discarding a weapon card\" and his halberds getting stolen. There is also less direct link between \"reducing 1 unit of health\" and his fight to the death.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Ironically, his famed strength and his nickname \"E Lai of ancient times\" comes from one singular event that was not battle-related at all. It was when Cao Cao first met Dian Wei that Cao Cao asked to see what he could do, sort of like an \"interview\". Dian Wei saw a huge banner that was toppling in strong winds. An whole crowd of soldiers could not keep the banner upright in that wind. Dian Wei grab the banner and held it upright and steady with only one-hand. It was then that Cao Cao exclaimed \"You are the E Lai of ancient times\".\n\n\n\n2. Cause of death - Cao Cao wanted to take the widow of Zhang Ji 张济 as his concubine. Zhang Ji's distant nephew, Zhang Xiu 张秀, was pissed. Knowing this, Cao Cao plotted to kill Zhang Xiu, but Zhang Xiu threw a surprise attack instead on Cao Cao. This battle is known as the battle of Wan Cheg 宛城之战 and it was where Dian Wei was killed (as mentioned under \"Ability's relation to story\").\n\nFAQ and Disambiguation\n\n1. Can Dodge be used to avoid damage from Dian Wei's ability?\n\nAns: No . It cannot be avoided by Dodge.\n\n\n2. Can Dian Wei use his ability and ''Attack''  in the same round?\n\nAns: Yes he can.\n\n\n3. Can Dian Wei commit suicide to take out a player by sacrificing himself?\n\nAns: Yes he can. Dian Wei can sacrifice his last unit of health to cause damage to another player. Of course, all other player are allowed to rescue both Dian Wei and the victim.\n\n\n4.  Does Dian Wei have to be saved first in order for the damage to go through?\n\nAns: No. The ability still goes through even if  Dian Wei dies from his sacrifice.\n\n\n5. If its down to 1-vs-1 and Dian Wei sacrifice his last unit of health to finish off the Ruler, who will win?\n\nAns: Ruler wins, Dian Wei loses. After using the ability , Dian Wei is considered zero health first before the damage is received by the Ruler. If nobody saves Dian Wei, then he dies first and games ends immediately (since all  Rebels/Defectors dead ).\n\n\n6. After throwing his equipped weapon to use his ability, will the reach be the old range before discarding , or a new one after discarding?\n\nAns: It is the new reach without the weapon . Once the equipped weapon is discarded for his ability ,the ability range immediately drops to 1.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xún-yù-荀彧","name":"Xún Yù 荀彧","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgryNgpsVjBV6PZUDHl-heK1tLDdRNEzNOPgqu_2iGyoxjzedhqwSBMAIUqUgWV9-Dw9avg-0sf5DzDX4ytoPwy_tKeQGHpkO9wpmdGju3EHkfB9IZ_R9eo4BRIySXtzjw39TKIBCdHt63g/s320/weixunyu.jpg","text":"\nTranslated description:\n\n\"Advisor of Kings 王佐之才 (wáng zuǒ zhī cái)\"\n\n\nWikipedia link: Xun Yu Wiki\n\nWho is he:\n\nTogether with Guo Jia 郭嘉, Xun Yu was one of Cao Cao 曹操's most trusted advisors. In fact it was Xun Yu who introduced Guo Jia into Cao Cao's service, together with a host of other high-calibre individuals such as Xun You 荀攸 and Si Ma Yi 司马懿. In one of the most controversial moves of the era, Cao Cao's escortation of the emperor, resulting in Cao Cao wielding immense political power, was suggested by Xun Yu. However Xun Yu's heart was always for the protection of the Han Dynasty 汉朝. When Cao Cao ultimately intended to abolish the Han Dynasty and establish the kingdom of Cao Wei 曹魏, Xun Yu opposed through oblique statements. This did not sit well with Cao Cao, and thus Xun Yu fell out of favour. He died soon after.\n\n\n\nCharacter ability 1: \"Rouse the Tiger 驱虎 (qū hǔ)\"\n\nIn your action phase, you can choose to \"Points Duel\" with another character with more health than you. If your score is higher, that player will cause 1 unit to damage to another player within his/her attacking range of your choice. If your score is lower, that player will cause 1 unit of damage to you.\n\n(Note that the ultimate victim who suffers the damage cannot use DODGE 闪. It is immediate damage, not an ATTACK 杀. Usage is limited to once per turn.)\n\n\n\nCharacter ability 2: \"Eternal Loyalty 节命 (jié mìng)\"\n\nEvery 1 unit of damage that you suffer, you can allow any player of your choice (including yourself) to replenish that player's on-hand cards to the maximum health level.\n\n(Which means if Liu Bei 刘备 only has 1 card and 2 units of life left but his maximum health is 4 units, Liu Bei can draw 3 cards if Xun Yu uses \"Eternal Loyalty\" on him. Liu Bei's current health level is of no significance.)\n\n\n\nAbility's relation to story:\n\n驱虎 is the shortened form of a longer phrase 驱虎吞狼. The literal translation is \"rouse the tiger to eat the wolf\". It is referring to Xun Yu's amazing strategy where he proposed to Cao Cao to have Liu Bei rewarded to the post of magistrate. Then Cao Cao can command Liu Bei to attack Yuan Shu 袁术. The sinister strings behind it all is Xun Yu knows the rule-abiding Liu Bei will listen to any order given by a superior, which is Cao Cao at that time. Xun Yu also knows that Yuan Shu is an egomaniac and secretly tells him that Liu Bei is coming to attack him. This way, both of Cao Cao's enemies are put at loggerheads and he benefits regardless of outcome. \"Eternally Loyal\" refers to Xun Yu's undying loyalty to the Han Dynasty, though its relation to the mechanics of the ability is weak.\n\n\n\nAdditional info from the story:\n\n1. Most famous achievement - His \"rouse the tiger to eat the wolf\" strategy. To keep the write up compact, I left out one other party other than Liu Bei and Yuan Shu, and that is Lu Bu 吕布. In summary, Xun Yu grasped the personality of all 3 of Cao Cao's enemies and pit them against each other.\n\n\n\n2. Cause of death - Uncertain!! Though Xun Yu is reported to have died of illness, his death followed soon after his distaste for Cao Cao abolishing the Han Dynasty. It is thus rumoured that Cao Cao had Xun Yu murdered so as not to let this talent cause him problems in future. \n\nFAQ & Diambiguation\n\n1. If Xun Yu asks Liu Bei to draw card using his 2nd ability , does this means Liu Bei can draw 4 cards because his maximum health is 4 units?\n\nAns: No,not draw 4 cards but he can tip-up his number of on-hand cards to 4 . If Liu Bei currently only has 1 card on hand , this ability can let him draw 3.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cáo-rén-曹仁","name":"Cáo Rén 曹仁","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhpOXAY4G836XlXkoWOW66BVyu2bPbnnR39kgZ3EafQNZAAlnan544ZC5WwKzqnSyorUtpxQq0llL4c1roCYqFSJQvvAZzIz189UT0IvK9JgmBdC3b6610cv5nk16RKu7E31du7ssgVlpK0/s320/weicaoren.jpg","text":"\nTranslated description:\n\n\"The Great General 大将军 (dà jiāng jūn)\"\n\n\nWikipedia link: Cao Ren Wiki\n\n\nWho is he:\n\nEvery leader has their most loyal and trustworthy followers. Cao Ren was such a follower of Cao Cao 曹操. From Cao Cao's rise to power, till Cao Cao's death, Cao Ren was a formidable and trustworthy general in his camp that never once showed any signs of disloyalty nor surrender. In fact, Cao Ren saved Cao Cao's ass a couple of times. Yet it must be said that Cao Ren receives a lot less mention in the story than many other of Cao Cao's generals (such Xu Chu 许褚 and Dian Wei 典韦). Perhaps such is the fate of those who keep the world turning behind the scenes. Dr Goh Keng Swee was never as well known as Lee Kuan Yew was he?\n\n\n\nCharacter ability: \"Entrenched 据守 (jù shǒu)\"\n\nAfter the discard phase of your turn, you can draw an additional 3 cards from the deck. By doing so, you will skip your next turn.\n\n(Skip your turn meaning no judgement, no drawing of cards, no using of any cards, nothing what-so-ever!)\n\n\n\nAbility's relation to story:\n\nThis is an interesting one. There actually is one scene in the story where Cao Ren was entrenched in his city, pretty much helplessly on the defensive. When Guan Yu 关羽 attacked the city of Fan Cheng 樊城 where Cao Ren was situated, Guan Yu starved the city and flooded it by redirecting river flow. Despite the odds, Cao Ren kept his troops' morale up and held out till reinforcements came. This is probably where the \"Entrenched\" ability arises from. But if you ask me, it's kinda strange to base an ability on a dire circumstance! I'm not the biggest fan of this ability and i'm still researching (using Cao Ren as often as possible) on how to make this ability work to my advantage.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Riding out to rescue his own troops when they were losing the battle against Zhou Yu 周瑜. Right after the battle of Red Cliffs 赤壁之战, where Cao Cao got his ass whooped bad, Zhou Yu pressed on and attacked the city of Jiang Ling 江陵. Cao Ren was tasked to protect Jiang Ling and sent his aide Niu Jin 牛金 and 300 troops to defend, but these troops were losing the fight and could not escape. Cao Ren personally rode out to rescued them. His troops respect Cao Ren so much that after they exclaimed, \"General, you are truly a man from Heaven!\" This exclamation can be found in its original unabridged form on the card itself just below his character ability description \"将军真天人也!\"\n\n\n\n2. Cause of death - At this current moment i'm not fully sure about the details of his death. All I can gather is that Cao Ren died of sickness at the age of 56. I did not manage to dig out any information about the sickness nor the circumstances surrounding his death. If anyone knows, please leave me a comment and share with all of us.\n\nFAQ and Disambiguation \n\n1. If Cao Ren uses his ability and the lightning card comes to him on his next turn , does the lightning moves on to the next player? Or does it stay in front of him ?\n\nAns: The card will stay in front of Cao Ren throughout his entrenched ability till it his turn again .\n\n\n2.  ''Entrenched '' ability description does'nt say  ''Flip Character Card 翻武将牌''  so i don't think Cao Pi's  ''Banish into Exile'' ability can flip Cao Ren's character card over\n\n\nAns: There has been an update on the YOKA FAQ to address the issue of Cao Ren / Cao Pi flipping cards\nREF: http://forum.yokagames.com/viewthread.php?tid=34599&extra=&page=1\n  \n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xià-hóu-yuān-夏侯渊","name":"Xià Hóu Yuān 夏侯渊","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0jARG-V0R5aK0geOZTHFpFWJtqYr6n1a0pyuJJ-U5XaJPhxTd-FjnMPEn7olgmY2EunFXqMSKl49EAGyQcJv6CkO3Qa5O8GJaTFFRajl5J11okVOhalRSNR_xLvr92Z6CkPX7RmZl_4B-/s320/weixiahouyuan.jpg","text":"\nTranslated description:\n\n\"Lightning-fast Cheetah 疾行的猎豹 (jí xíng dè liè bào)\"\n\nWikipedia link: Xia Hou Yuan Wiki\n\nWho is he:\n\nPerhaps less famous than his cousin Xia Hou Dun 夏侯惇 but a one of the pillars of Cao Cao 曹操's army, Xia Hou Yuan was highly praised for his efficiency in logistics. He has been credited as one of the main reasons Cao Cao rebounded from his defeat at the battle of Red Cliffs 赤壁之战 so quickly, thanks to his reliable and prompt logistics handling. In the battlefield, Xia Hou Yuan earned his nickname \"Cheetah of the West 西部猎豹\" for his lightning fast capture of the cities on the western border of the Wei Kingdom 魏国. Unfortunately, many of these details would have been left out if you had read the simplified version of Romance of Three Kingdoms. The big highlight of Xia Hou Yuan was his death at Han Zhong 汉中 under the hands of Huang Zhong 黄忠.\n\n\n\nCharacter ability: \"Godspeed 神速 (shén sù)\"\n\nYou can use either or both of the following options listed below. When any of the options below are activated, it is equivalent to using an ATTACK 杀 card on any player (no distance limitations).\n\n\n\n1. Skip your judgement phase as well as drawing phase.\n\n\n\n2. Skip your action phase as well as discard one equipment card.\n\n(This means he can no longer use any other card in his turn. Note that this option can only be used once a turn, regardless of how many equipment cards you have.)\n\n\n\nNote: Using this ability does NOT count as having used an ATTACK card. Which means to say if Godspeed option 1 is used, the player can continue to use an ATTACK card during the action phase. Both the options can be used consecutively in one turn, thus skipping judgement, drawing and action phase whilst being able to ATTACK twice.\n\n\n\nAbility's relation to story:\n\nXia Hou Yuan was known for his speed in moving his troops and catching his opponents off-guard. In his effort to capture the city of Chang Li 长离, Xia Hou Yuan discarded most of his supplies so as to be able to achieve surprise. This is probably the link behind \"Godspeed\" option 2 ability. In general, Xia Hou Yuan in the cardgame does bring an element of speed since he can choose to ATTACK immediately even before drawing cards. Though this speed is of no consequence whatsoever in terms of dealing damage, it does make him a very useful character since he will always be able to use ATTACK on any player at least once a turn.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - In his attack on Song Jian 宋健, Xia Hou Yuan was able to capture the city within two months, a very short timespan in those days. Song Jian and all his officers were massacred by Xia Hou Yuan, which ultimately scared the balls off the other opponents in the nearby region. Within a year, most of these opponents surrendered to Cao Wei 曹魏 out of fear of Xia Hou Yuan.\n\n\n\n2. Cause of death - The tragedy of Xia Hou Yuan is the glory of Huang Zhong from Shu Han 蜀汉. The story goes that Huang Zhong set his troops up a hill overlooking Xia Hou Yuan's camp at Han Zhong 汉中. Xia Hou Yuan got upset that his camp was being spied on and rallied an attack on Huang Zhong. Huang Zhong held firm till Xia Hou Yuan's troops became weary from fighting uphill, then led a massive counter-attack downhill. Huang Zhong himself cut Xia Hou Yuan into two. \n\nFAQ and Disambiguation\n\n1. Does the equipped card have to be equipped to use the 2nd option?\n\nAns: No it does'nt. It can be any equipped card , on-hand or equipped.\n\n\n2. Does the lightning card goes to the next person if Xia Hou Yuan uses his abilty to skip judgement phase?\n\nAns: No, the LIGHTNING stays with him till he finally decides to pass judgement on it.\n\n\n3. When he uses his abilty,does the Attack go through Rattan Armor?\n\nAns: No. This is because it has no elemental attribute .\n\n\n4. With his ability,does this mean Xia Hou Yuan can use 2 ATTACKS per turn?\n\nAns: Xia Hou Yuan's ability allows him to use two attacks ONLY if both are used through the skill.\n\n\n5. Is it possible for Xia Hou Dun to attack then use his ability to end his action phase with an attack towards an opponent?\n\nAns: No, that is not possible. For him to use his ability (2nd part) to attack , he needs to skip his action phase altogether, thus he cannot take any actions in that turn.\n\n\n6. Does skipping Xia Hou Dun's draw and judgement phase count as an attack? Meaning that he cannot attack during his action phase?\n\nAns: The ability is divided into Godspeed 1 and Godspeed 2\n\nGodspeed 1: skip judgement + drawing phase. After using this, the player can continue to use cards , including ATTACK cards. Which means to say this player can attack more than once in that turn , with Godspeed 1 being the extra bonus attack.\n\nGodspeed 2:  skip action phase+ discard 1 equipment . In this case ,the player can no longer use any card for that turn, thus the player cannot use ATTACK cards.\n\n\n7. Can Xia Hou Dun use ''Godspeed 2'' and avoid the consequence of acedia if he is already failed judgement for acedia?\n\nNo he cannot. Once you succumb to ACEDIA , your action phas is already skipped. You cannot further choose to skip the action phase by using Godspeed 2\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cáo-pī-曹丕","name":"Cáo Pī 曹丕","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi6i89V1bQKvBILN7XSM7xV1ZQCsQQ5xiltQGIMNjzMRItbBoHzmewYBAICCqC7x0in3B7lW2u2neybZJ286bVb9WSk3H59Y6MZ9lzV0mgVkKCz8Z4Hk5n0rogUddf-lcuj-snbMDBOnSqI/s320/weicaopi.jpg","text":"\n\n\n\n\nTranslated description:\n\"The Dominating Successor 霸业的继承者 (bà yè dè jì chéng zhě)\"\n\nWikipedia link: Cao Pi Wiki\n\nWho is he:\nThe successor to Cao Cao 曹操, Cao Pi's ascension to the throne of Cao Wei 曹魏 is fraught with controversy. Cao Cao literally had a litter of male children, all of which were eligible to succession. The most promising among them were Cao Ang 曹昂, Cao Zhang 曹彰, Cao Zhi 曹植, Cao Chong 曹冲 and Cao Pi. Cao Ang was killed in action early on at the battle at Wan Cheng 宛城之战. Cao Chong was a child prodigy and reportedly Cao Cao's favorite son. This was where the controversy starts.Cao Chong died mysteriously of an illness at age 13 and it is believed that Cao Pi had something to do with it. After Cao Cao's death, Cao Zhang appeared to be planning to seize power from Cao Pi. Cao Pi promptly sent Cao Zhang back to the frontlines, far from the capital. Cao Pi then crushed many talented staff of Cao Zhi to cripple his power. He even wanted Cao Zhi executed, which led to Cao Zhi's famous \"7 step poem\". Ultimately, Cao Pi was two extremes of achievements: he dissolved the Han Dynasty 汉朝 became the first Emperor of Wei, yet was quite a failure both domestically and in war.\n\nCharacter ability 1: \"Unnatural Death 行殇 (xíng shāng)\"\nYou can immediately take possession of all the cards (both on-hand and equipped) of any player that dies.\n\nCharacter ability 2: \"Banish into Exile 放逐 (fàng zhú)\"\nEverytime you suffer damage, you can force any player (except yourself) to draw X number of cards. X being the units of health you have lost (measured from your max health level) after the damage has been taken into account. By doing so, this player will have to \"Flip Character Card\" (please click on link for more info).\n\nCharacter ability 3: [Ruler ability] \"Exalt the Powerful 颂威 (sǒng wēi)\"\nWhenever any Wei Character (other than yourself) makes a judgement, if the judgement card that takes effect is the suit of \"clubs\" or \"spades\", that character can choose to let you draw 1 card from the deck.\n\nAbility's relation to story:\n\"Unnatural death\" makes for interesting discussion. It definitely has link to the story, but it is not clear in which context. Many characters have died prematurely whose deaths are attributed to Cao Pi, even his own wife Zhen Ji 甄姬. This forms the basis for the game ability to take all the cards, since it implies he was the puppet master behind the scenes and their death is his advantage. However some argue that Cao Pi himself died an \"unnaturally early\" death at the age of 39.\n\n\"Banish into Exile\" is significantly mentioned in the story as Cao Pi's preferred punishment for his political opponents. His victims include his (half) brothers Cao Zhi and Cao Zhang, as well as the last Emperor of Han Dynasty.\n\nThere does not seem to be any clear link for \"Exalt the Powerful\". Probably just a generic add-on by the game makers.\n\nAdditional info based on story:\n1. Most famous achievement - Becoming Emperor of Wei after demolishing the Han Dynasty. Though Cao Cao had this in his sights for years, he decided to let his descendants form the empire and Cao Pi fulfilled that role. In an interesting twist of fate, Si Ma Yi 司马懿 copied Cao Cao by personally building the foundation of the Jin Dynasty 晋朝, but allowing his descendants to follow through. It is ironic that the first of the three kingdoms to fall to Si Ma Yi was Cao Wei.\n\n2. Cause of death - Cao Pi died of illness at age 39. It is believed that his failure to defeat Sun Wu 孙吴 and Shu Han 蜀汉 led to embarrassment, something which Cao Pi severely resented. Unable to swallow his pride, this unhappiness precipitated into illness which killed him.\n\nFAQ and Disambiguation\n\n1. As Ruler, will Cao Pi still be able to draw a card if a Wei's character's judgement for Eight Trigrams card is black?\n\nAns: Yes. Although the Eight Trigrams judgement failed if it is black, it is still the judgement card that comes into effect.\n\n\n2. If Cao Pi makes a judgement that is a black card, can he draw a card also?\n\nAns: No. It only applies for Wei Characters other than Cao Pi himself.\n\n\n3. Can Cao Pi ask one guy to flip his card twice if he suffers 2 units of damage ? Such that the player flipped can draw a lot of  cards and still be able to play the next turn ?\n\nAns: No. Flipping character card is based on number of instances he receives damage , not on the number of units of damage.\n\n\n4. Is it compulsory to use Cao Pi's '' Banish into Exile'' ability?\n\nAns: No. Cao Pi can choose not to use it.\n\n\n5.  If Cao Pi is a Ruler and mistakenly killed a Loyalist, does he discard all his cards? This means his 1st ability  is useless to acquire the dead person's cards?\n\nAns: In that scenario the following sequence occurs:\n\n     1. Cao Pi (Ruler) first acquires all the cards from the dead Loyalist .\n     2. Then Cao Pi discards all his cards,including those he just picked up from the deal Loyalist , as   punishment for killing his loyalist.\n\nEnd Result= Cao Pi will still end up with no cards on- hand or equipped.\n\n\n6. When Cao Pi gets hit and is on the brink of death , could he use his Banish ability on an ally to receive receive cards so that they can use a peach to save Cao Pi?\n\nAns: No. When ''brink of death'' occurs , every other ability halts untill he is rescued. So only after he is rescued can he use Banish .\n\n\n7. Does Cao Pi get to gain the Judgement cards awaiting judgement that are placed on a character before that character died (eg, the character still has a lightning on him but he died before his turn)\n\nAns: I have no firm answer to that. This is still being debated. One one hand ,no, the cards in the Judgement Area are not considered owned by any player. On the other hand, yes, because Si Ma Yi is allowed to grab a card from the judgement area just like using STEAL or DISMANTLE.\n\n\n8. Can Cao Pi re-flip a character card with his abilty?\n\nAns: Yes. Cao Pi can re-flip such that the turn will not be missed.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xú-huǎng-徐晃","name":"Xú Huǎng 徐晃","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjSNzLm2LDfhNA3Of1nxoLWQdJi2FhmKVJk_Y932tmrWQ0lqb9T8bGrpMoPUEwUz6FgXuz77Bjhrh-X-bnLR0yRh7IgsB9YVWhE3IsbZSe0Q0J6pcG-F3o1K1mDBCiS4rF8YBzFVbOIsHNn/s320/weixuhuang.jpg","text":"\n\n\nTranslated description:\n\"Reminiscence of Zhou Ya Fu 周亚夫之风 (zhōu yǎ fū zhī fēng)\"\n\n(Zhou Ya Fu was a general during the Han Dynasty that died about 60 years before the start of the Three Kingdoms era. He is regarded as the epitome of military discipline and integrity.)\n\nWikipedia link: Xu Huang Wiki\n\nWho is he:\nOne of the 5 most important generals to Cao Cao 曹操, Xu Huang is a man of righteousness. He first came to Cao Cao's attention as a general of Yang Feng 杨奉, an enemy leader that Cao Cao intends to vanquish. Seeing Xu Huang's strong combat ability, he convinces Xu Huang to join him. Xu Huang agrees to defect, but refused the request to murder Yang Feng, exclaiming that he would not do such a dishonorable deed. Xu Huang then became fast friends with Guan Yu 关羽 in the short period that Guan Yu was with Cao Cao, but when they eventually stood on opposite sides of the battle field, Xu Huang made clear to Guan Yu that his duty was kill him and cannot let personal ties get in the way. Such integrity and responsibility was highly appreciated by Cao Cao, who likened him to Zhou Ya Fu.\n\nCharacter ability: \"Blockade 断粮 (duàn liáng)\"\nDuring the action phase, you can choose to use any of your Basic Cards or Equipment Cards with the suit of \"clubs\" or \"spades\" as RATIONS DEPLETED 兵粮寸断. Your range for RATIONS DEPLETED is extended to physical distance of 2.\n\nNote that the ability does not include Tool Cards, therefore black-suited Tool Cards cannot be used as RATIONS DEPLETED (unless it is the tool card itself is RATIONS DEPLETED).\n\nAbility's relation to the story:\nIn the story, Xu Huan carried out raids to sever enemy supplies a number of times. The most notable was his raid on Yuan Shao 袁绍's supplies during the battle at Guan Du 官渡之战, which sealed Yuan Shao's defeat. Years later, Xu Huang effectively carried out a blockade during his battle at Fan Cheng 樊城之战 against Guan Yu. He instructed his troops to surround the nearby city of Yan Cheng 偃城 with trenches. The enemy troops at Yan Cheng, thinking that their supplies have been cut off, abandoned their position and gave Xu Huang a strong foothold from which to attack Guan Yu. What the troops of Yan Cheng did not know was that the blockade was a fake, as Xu Huang's troops were too green for outright battle at that point.\n\nAdditional info from the story:\n1. Most famous achievement - Defeating Guan Yu at Fan Cheng. Xu Huang furst used military tactics to cover the weakness of his army (inexperienced and awaiting reinforcement), then rode on its strengths when reinforcement came. By using diversionary tactics, Xu Huang routed Guan Yu and attacked from an unexpected direction, causing confusion within Guan Yu's camp. Amidst the confusion, a major strike was coordinated that crushed Guan Yu's main force. A broken Guan Yu then retreated to Mai Cheng 麦城 where he met his end.\n\n2. Cause of death - Xu Huang was shot in the head by an arrow fired by Meng Da 孟达 during a battle at Xin Cheng 新城. Xu Huang did not die immediately but physicians could not save him. He died later that night at age 59.\n\nFAQ and Disambiguation\n\n1. Apart from the weapons and armour , does equipped cards also include horses? Can horses be used for his abilty?\n\nAns: Yes, horses are considered equippement and can be used for his ability.\n\n\n2. Must all the cards to be used for the ability be black suited? Even the basic cards?\n\nAns: Yes. Even the basic cards must be black suited.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cáo-zhí-曹植","name":"Cáo Zhí 曹植","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFm2bDlqY1lC5udsycuJhF_FLJRBusEnT3A7eXeDv9cNMn_v0tEW6suhEc6xBnXKrvcaWkeZ4WFldd4-6o4pyQDEEGG3EG9trSDH3Ym1uW0LVKx6t2o9T8ZzQ98_9z5VTL2pMdGIuR7AfJ/s320/caozhi.jpg","text":"\n\n\nTranslated Description:\nEight-Tenths of the world's Talent 八斗之才 (bā doù zhī cái)\n\nWho is he:\nBrother, or adulterer? Feeble poet, or crouching usurper? Genius, or drunkard? Cao Zhi is a contradiction that has romanticized the entire Three Kingdoms era. Wikipedia would sing his praises for his famed poetic ability, while on the same page hark on his lack of sobriety as if it were tabloid news. Cao Zhi was never much of a military person, and is usually belittled in comparison to his elder brother, Cao Pi 曹丕. Yet Cao Zhi has left his mark in ways that Cao Pi could never equal. If you love the vagabond wanderer without a care in the world, or the merry-making hippie culture that spun off incredible lyrical literature, you would probably fall in love with Cao Zhi. Maybe you would even grin understandably when Cao Zhi flirted with his elder brother's wife. Merry-making, eh?\n\nCharacter ability 1: \"Falling Bloom 落英 (luò yīng)\"\nWhen other players discard or flip judgement cards with \"clubs\" into the discard pile, you can take possession of these cards.\n\nCharacter ability 2: \"Drunken Quatrain 酒诗 (jiǔ shī)\"\nWhen your character card is facing up, you can choose to flip over your character card and this will be considered as having used WINE 酒 (under reasonable situations only).\n\nWhen you suffer damage while your character card is facing down, you can choose to flip over your character card such that is faces up after the damage you received is concluded.\n\nAbility's relation to story:\nBrilliant!!! Cao Zhi's abilities are so well linked to the story that his first ability actually has double meaning! The chinese words for \"Falling Bloom\" is an olden way of describing the falling of spring flowers from the trees. This can be seen to describe Cao Zhi's youthful and care-free nature in his young adult days. On the flip side, the chinese words 落英 is actually a word play on Zhen Ji 甄姬's nickname 洛神, where 英 here can refer to 英雄 or hero. In other words, Cao Zhi is secretly Zhen Ji's hero and lover, a rumour that does seem to carry some weight historically. Notice how beautifully this ability pairs up Zhen Ji's \"Goddess Luo 洛神\" ability?\n\n\"Drunken Quatrain\" is also deeply based on the story. In his later years, Cao Zhi became a drunken wreck. In fact he was so drunk that he did not attend his own father, Cao Cao 曹操's, funeral. Living in a perpetual state of despair, Cao Zhi continued to write poems that sank deeper and deeper into misery mongering.\n\nAdditional info based on story:\n1. Most famous achievement - The Seven Step Quatrain (fictional). In the ROTK story, Cao Pi was furious at Cao Zhi for being so drunk he did not attend Cao Cao's funeral. At the same time, Cao Pi had been plotting for sometime to remove his younger brother so that there would be no more threat to his throne. Cao Pi gave Cao Zhi one final chance to demonstrate his ability: Come up with a poem within 7 paces, or die. Cao Zhi came up with not one, but two poems. The second poem made no direct reference to the two brothers, speaking of a pot of beans boiling atop a fire fueled by beanstalks, however the inference behind the poem moved Cao Pi sufficiently to pardon the execution of his younger brother.\n\n2. Cause of death - Illness, probably brought about by depression and alcoholism. After Cao Pi's death, Cao Zhi argued valiantly to be re-instated in the court of Wei Kingdom 魏国, but the new emperor, Cao Rui 曹睿, would still view Cao Zhi as a threat to the throne. Cao Zhi never got to fulfill his desire to contribute to the Wei Kingdom, and he died as a depressed loner with little fanfare.\n\nWiki Link:\nCao Zhi Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yú-jìn-于禁","name":"Yú Jìn 于禁","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj8Qv-NfdLTHXJZfBaq7QK3uIEmddzcug3b41MPXkjdw27HldNHPXvhdvI0RhipSio_ev2_Tw0mJlXIik_sV4CYTPE2xbB5f3JsXdwKHp6XBJtUchTi_-XAB5hDlticP8GxBL8M_mIVqOed/s320/yujin.jpg","text":"\n\n\nTranslated Description:\nMainstay of the Wei Military 魏武之刚 (wèi wǔ zhī gāng)\n\nWho is he:\nLoyalty transcends time and geography, or so Yu Jin thought. Yu Jin was thought to be one of five most important generals serving under Cao Cao 曹操. In his prime, Yu Jin was responsible for the battles that led to Yuan Shao 袁绍 being vanquished, and he was also known as a man of steely integrity. Yu Jin once defeated a rebel leader who happened to be an old friend. Despite this old friend surrendering to Yu Jin, Yu Jin knew that Cao Cao would execute this friend anyways because he only surrendered after being defeated. Yu Jin decided that he would order the execution himself, and he had a tearful final meeting with that friend before the execution.\n\nHowever the drama that Yu Jin is remembered for begins only after his defeat by Guan Yu 关羽. After coming to Cao Ren 曹仁's rescue, both Yu Jin and Pang De 庞德 found themselves stranded in the flooded fort of Fan Cheng 樊城. Guan Yu was mobile on boats and quickly captured both the Wei generals, whereupon Yu Jin surrendered and joined Shu Kingdom 蜀国 whilst Pang De refused to betray Cao Cao and chose death over surrender. Cao Cao was greatly grieved that his trusted general of 30 years would switch sides to help Shu Kingdom.\n\nYet fate still has not run its course. Eventually Yu Jin did return to Wei Kingdom, but why? And when? Read on to find out!\n\nCharacter ability: Resolute 毅重 (yì zhòng) [Enforced ability]\nWhen you have no armor equipped, black-suited ATTACK 杀 cards have no effect on you.\n\nAbility's relation to story:\nSadly, the link of this ability to the story is nearly non-existent. True, Yu Jin was a resolute and firm general under the Wei Kingdom, however I really do not see how his ability ties in with the ability title. I must say I am somewhat disappointed. However if i'm wrong and there is a good relation to the story that I missed out, I will update this accordingly.\n\nIf anyone knows the relation, do inform me!\n\n[Update!] Indeed there is a link to the story. Yu Jin surrendered to Guan Yu in the story and thus left Wei for Shu. For his ability, it does leave him completely susceptible to Guan Yu's ability, where all his red cards are ATTACK.\n\nAdditional info based on story:\n1. Most famous achievement - After surrendering to Guan Yu, Yu Jin seemingly had his allegiance to Shu Kingdom, but it was believed that he simply wanted to stay alive so as to return to Cao Cao's side someday. This is very similar to Guan Yu joining Cao Cao's side for a period of time before returning to Liu Bei 刘备. However after Guan Yu was defeated by Lu Meng 吕蒙, Yu Jin again surrendered to Wu Kingdom 吴国, where he became the subject of ridicule for a period of time. Eventually, Yu Jin managed to return to Wei Kingdom when Cao Pi 曹丕 declared himself Ruler and Wu Kingdom became allies. Yu Jin was \"returned\" to Cao Pi, but by then Yu Jin was a already an old man.\n\n2. Cause of death - Cao Pi gave Yu Jin a chance to still serve in the Wei military, but asked him to first pay a visit to the tomb of Cao Cao. Upon arriving at the tomb, he saw the carvings in Cao Cao's tomb that depicted a shameless Yu Jin bowing down to Guan Yu whilst a heroic Pang De being executed. It was a reflection of Cao Cao's feelings of sorrow and betrayal when Yu Jin left Wei for Shu. Yu Jin was so grief-stricken by the carving that he fell ill and never recovered. He died before serving another military campaign in Wei.\n\nWiki Link:\nYu Jin Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-chūn-huá-张春华","name":"Zhāng Chūn Huá 张春华","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi4nrufWRIN-niq9y9LreS1FE77Xm09iIzkZDshl4Fbyf2Yv8VY3hgrK51L6yj3I_LDHGi5xZNhpxiOSgR_2NXqbhGPBjCgjk-iGya2EuUXMPBw4sES8hLt6T-iUuWbKVPi6hEJTh_rpw9z/s320/zhangchunhua.jpg","text":"\n\n\nTranslated Description:\nCold-blooded Empress 冷血皇后 (lěng xuè huáng hoù)\n\nWho is she:\nAt first glance, you might probably think that this is one of Cao Cao 曹操's many wives who later became Empress of Wei Kingdom 魏国. Yet on closer scrutiny of history, her identity comes as a shock! Zhang Chun Hua is not wife of any within the Cao family. She is, in fact, the wife of Si Ma Yi 司马懿, the nemesis of Cao Cao! So why is she an Empress and given the colours of the Wei Kingdom in this character card? Since Zhang Chun Hua is the wife of Si Ma Yi, and Si Ma Yi was one of Cao Cao's most important advisors at the time, it is natural that her \"allegiance\" lies with the Wei Kingdom. However she never became Empress in her lifetime. It was only after her grandson, Si Ma Yan 司马炎, established the Jin Dynasty 晋朝 that she was posthumously honoured as Empress.\n\nWhat about the \"Cold-blooded\" part of her description? Read on the find out!\n\n[2011 Old version]\nCharacter ability 1: \"Ruthless 绝情 (jué qíng)\" [Enforced ability]\nAll damage caused by you is viewed as \"loss of health\". (Character abilities or card abilities that are activated when damage is \"caused by\" or \"received\" will not activate).\n\nCharacter ability 2: \"Bereavement 伤逝 (shāng shī)\"\nWith the exception of the discard phase, whenever your number of on-hand cards is less than the number of units of health loss thus far, you can immediately draw from the deck till your on-hand cards equal number of units of health loss.\n\nExample of usage for \"Bereavement\" - When you have 1 unit of health left, the number of health loss thus far is 2 units. Suppose you have 2 on-hand cards, a WINE 酒 and an ATTACK 杀, and you use both simultaneously on another player, you will have zero on-hand cards left. You can thus immediately draw 2 cards from the deck.\n\n[2012 New version]\nCharacter ability 1: \"Ruthless 绝情 (jué qíng)\" [Enforced ability]\nAll damage you are about to inflict is converted to \"loss of health\".\n\nCharacter ability 2: \"Bereavement 伤逝 (shāng shī)\" [Enforced ability]\nWith the exception of the discard phase, your minimum number of on-hand cards is X, X being the number of units of health you have loss and X has a maximum of 2.\n\n\nAbility's relation to story:\nThe link to the story is more obtuse. \"Ruthless\" is supposed to describe her cold-blooded nature, however this ability does not intuitively describe cold-bloodedness. Instead the ability crafter mentioned that this ability was meant to counter her husband, Si Ma Yi's \"Retaliation 反馈\" ability. The aim was to demonstrate that Si Ma Yi was unable to outsmart his wife, which was what happened in the story. The mechanics of \"Bereavement\" has very little connection to the story. This ability apparently hints at the love that Si Ma Yi has lost for Zhang Chun Hua in her later years, especially after she was neglected in favour of Si Ma Yi's other love, Lady Bai 柏夫人.\n\nAdditional info based on story:\n1. Most famous achievement - Cold-bloodedly murdering her own servant maid. When Si Ma Yi began plotting to overthrow the Cao family, he avoided going to battle by feinting illness. The malingering Si Ma Yi slacked away in his abode, so carefree that he put out his books to dry in the sun. Unfortunately, it began to rain and Si Ma Yi leapt out of bed to bring his books indoors. One of the maids saw his sudden burst of energy and was shocked that Si Ma Yi has recovered miraculously from his illness. The guileless maid informed Zhang Chun Hua that Si Ma Yi seems to have recovered overnight. Yet Zhang Chun Hua was no fool, she knew about Si Ma Yi's reasons for feinting illness. Fearing further complications if the maid were to speak of this to others, Zhang Chun Hua murder the maid there and then to ensure that Si Ma Yi's feint is safe from suspicion.\n\n2. Cause of death - Old age, but probably suffering from disaffection before her death. Si Ma Yi once called her \"old and ugly\", whereupon Zhang Chun Hua decided to starve to death and take her own life. Upon hearing this, all of their children vowed to starve with their mother and die alongside her. Si Ma Yi then took back his words and his family did not go ahead with their suicide, but Si Ma Yi later told Zhang Chun Hua that he could not have cared less if she starved to death. He only took back his words to save his children.\n\nWiki Link:\nZhang Chun Hua Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"dèng-ài-邓艾","name":"Dèng Ài 邓艾","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgJdNYzRFGKXhgkoQFvBA8w0lR1pxqZaopAr0RjBmPJENUYfYJdlY1TaEz8PoE5VUyk28Bh0aqqoj2bPG7f8wVdAKYzmLznMit-CSA12loERIBkZsl0GAE_R0c9ypOSDQSjkO0WaM-KHgbl/s320/dengai.jpg","text":"\n\n\nTranslated description: \n\"The Staunch Warrior 矫然的壮士 (jiǎo rán dè zhuàng shì)\"\n\nWho is he:\nThere were many pairs of arch-nemeses throughout the Three Kingdoms era between Wei and Shu Kingdoms. In the early days, there were the two most famous loggerheads, Cao Cao 曹操 and Liu Bei 刘备. In wit and cunning, there were Zhuge Liang 诸葛亮 and Sima Yi 司马懿. In the later days as the era was coming to an end, there were the final two, Jiang Wei 姜维 and Deng Ai 邓艾.\n\nDeng Ai was not your typical military general. With a background in agriculture and geography, most would have thought him suitable as a master-farmer than a leading general of the time. But Deng Ai proved to the world that he was no broccoli cropper. Matching his arch-enemy Jiang Wei wit for wit, Deng Ai held back the Shu forces who were bent on clawing into Wei territory. As the disagreements behind the Shu frontlines escalated, Deng Ai conducted the equivalent of Guerilla Warfare in Ancient China and went deep behind enemy lines, but the mountain passes that lay in his path were insurmountable! Did Deng Ai ultimately succeed in striking the heart of the Shu Kingdom? Read on the find out!\n\nCharacter ability 1: \"Amassing Terrain 屯田 (tún tián)\"\nEvery instance that you lose card(s) (on-hand or equipped) outside your turn, you can flip a judgement card. If the judgement is not the suit of \"hearts\", you can put the judgement card (referred to as \"Terrain\") atop your character card. Every \"Terrain\" that you amass, your physical distance to other players decreases by -1.\n\n(Trivia: 屯田 is the agricultural policy practiced by Cao Cao, sending soldiers and refugees to distant lands, so as to boost the economy and provide supplies to the military. The actual meaning of 屯田 can be translated as \"Growing Wheat\", \"Agricultural strategies\" or simply \"Cultivation\")\n\nCharacter ability 2: \"Conduit 凿险 (záo xiǎn)\" [Awakening Ability]\nAt the beginning of your turn, if you have more than or equal to 3 \"Terrains\", you must reduce your maximum health by 1 unit. You will  then permanently acquire the ability \"Blitz 急袭\" (In the action phase, you can use any of your \"Terrains\" as STEAL 顺手牵羊)\n\nAbility's relation to story:\nIn his younger days, Deng Ai is an official of agriculture, and he was promoted for his talent of agricultural affairs. With more farmlands be developed, he can reach his enemies more easily, due to the steady supply of food and land clearance. Thus the ability \"Amassing Terrain\" is quite apt for this character, and the mechanics also seems to provide the related advantage. The only issue, though, is that there is no relation between losing cards (or possessions) to how Deng Ai actually increases his territory in the story. Still, a good match nonetheless!\n\n\"Conduit\" refers to his achievement of constructing canals for the Huai River (淮河). Near the end of the Three Kingdoms era, Sima Yi planned to cultivate the bank of the Huai river, and he sent Deng Ai for this mission. With a good head for geography, Deng Ai advised that canals should be constructed for irrigation, and the result was sensational! Through this success, Deng Ai leap-frogged his way into important official appointments for the Wei Kingdom. In a way, this does mirror the \"awakening\" of Deng Ai in the story.\n\n\"Blitz\" refers to his campaign against the Shu Kingdom. He led his forces over the impassable mountains of Sichuan 四川 and struck deep in the heart of the Shu Kingdom, Cheng Du 成都. Nobody was able too foresee that Deng Ai would strike from the mountains, since those mountains have served as a natural defense for Cheng Du for centuries. The Shu Emperor at the time, Liu Shan 刘禅, was forced to surrender, and that marked the beginning of the end for the Kingdom so laboriously created by Liu Bei and Zhuge Liang. For the mechanics of this ability, there does not seem to be any direct link between being able to \"steal\" and the sneak attack on Cheng Du. They weren't thieves; they were fighers! It does make sense, though, for STEAL to be the tool card of choice since the physical distance advantage is, by far, most useful for stealing.\n\nAdditional info based on story:\nMost famous achievement - Eliminating the Shu Kingdom. How's THAT for an accomplishment on a resume? Though Deng Ai does take a lot of credit (and Liu Shan a lot of the flak) for the fall of Shu, there was one other critical person behind the scenes who was giving Liu Shan ill-advice. That person was Huang Hao 黄皓, the corrupt and worthless official that peppered Liu Shan with flattery and ill-wisdom. The story says that Huang Hao was executed by Wei troops as even the enemy did not want such a worm, but historically his death  was never written. Legend says that he managed to escape execution by bribing the Wei soldiers.\n\nCause of death - Killed in a coup d'état planned by Jiang Wei. After the surrender of Liu Shan, Jiang Wei falsely surrendered to Zhong Hui 钟会, the ambitious rival of Deng Ai. They defamed Deng Ai and caused Deng Ai and his son to be imprisoned. Although the coup de’tat was unsuccessful, Deng Ai and his son were killed by the prison keeper, fearing the vengeance of Deng Ai’s troops once Deng Ai is freed.\n\nWiki Link:\nDeng Ai Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-hé-张郃","name":"Zhāng Hé 张郃","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmaKkvkN7lLQs67Vpmlp7kCrkS7_3iPLIl7E0EAaRd8HzS4tYbE5wmHwIFeDY-hF_0Ax_EextYOV9fhOyydYcWpTq4Y89R2ZHIrLvw1F0bztiKaZ63wUP5sCHDgY5sCnMTn4GtcyTftkgK/s320/zhanghe.jpg","text":"\n\n\nTranslated description: \nThe Military Clairvoyant 料敌机先 (liào dí jī xiān)\n\nWho is he:\nThere are those who analyze volumes of data before they can predict the future, and then there are those talents who only need to follow their gut instinct. Zhang He was one of those talents, and his predictions were sometimes more accurate than the scholarly military advisers. Widely regarded as one of the five most elite generals in the Wei Kingdom 魏国, Zhang He stood shoulder to shoulder with the likes of Xu Chu 许褚, Zhang Liao 张辽 and Xu Huang 徐晃 just to name three. But some say Zhang He was the most outstanding amongst all five elites. His military career spanned a staggering 47 years and his military predictions outdid even the infamous Sima Yi 司马懿.\n\nFor a taste of his abilities, Zhang He crushingly defeated one of Shu Kingdom 蜀国's strongest generals and sent Zhuge Liang weeping as this defeat general of his was to be executed. Does this story ring a bell?\n\nCharacter ability: “Flexibility 巧变 (qiǎo biàn)”\nYou can discard one one-hand card to skip one of your phases (excluding beginning phase and ending phase).\n\nIf you skip your drawing phase using this method, you draw 1 on-hand card from a maximum of two other players.\n\nIf you skip your action phase using this method, you can relocate a card (in the equipment area or in the pending judgement area) from its original location to another identical location.\n(e.g. relocating a weapon from Player A’s equipment area to Player B’s equipment area, or relocating the ACEDIA that is pending judgement from Player A’s pending area to Player B’s pending area).\n\nAbility's relation to story:\nThis ability seems to relate strongly to the word \"Flexibility\" instead of how it applies to Zhang He. The phrase “巧变” comes from the description “张郃以巧变为称 (Zhang He was famed for his flexibility)”, and suits the historical Zhang He in two ways. Firstly, Zhang He was able to predict his enemies’ moves, and use various tactics to defeat them. Secondly, he served multiple warlords before he joined the Wei forces, so he was “flexible” in terms of allegiance. Yet it seems that neither these are very congruent to the ability in this character card. No matter. We're still glad that his abilities make him a huge asset to any team!\n\nAdditional info based on story:\nMost famous achievement - Defeating Ma Su 马谡 in the Battle of Jie Ting 街亭之战. As an experienced general, Zhang He found out the fatal mistake of Ma Su easily. He cut off Ma Su’s troops from the water supply, and he defeated Ma Su's thirsty force easily. By conquering Jie Ting, Zhuge Liang 诸葛亮's strategy was upended... and boy was he pissed! As a consequence, Ma Su had to be executed by Zhuge Liang for that huge defeat.\n\nCause of death - Struck by an arrow in Mumen Trail 木门道. When Zhuge Liang retreated in his fourth expedition to the North, Zhang He pursued the Shu troops under the order of Sima Yi 司马懿. Zhang He had warned Sima Yi that an ambush by the Shu forces was very likely, but Sima Yi urged Zhang He to press on. Tragically, Zhang He was right. When he entered the narrow pass in Mumen Trail, the Shu troops set off their ambush and Zhang He was struck by a crossbow to his right knee. He died from that wound, possibly due to inflammation.\n\nWiki link:\nZhang He Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"yáng-xiū-杨修-(sp001)","name":"Yáng Xiū 杨修 (SP001)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhnL4uHLh-RiT_13Ic0Wice1vkV01nz3XnJq3DC5M2sAFr7AQ2UpeczPJWeNvLUii21306EbY4cghToszk3fjlhgJE18A8fZG8MIxaHiUe3JEFWL15T1rtkSwaw9YMrq5TD7Kdj8nVeZywi/s320/spyangxiu.jpg","text":"\n\n\nTranslated Description: \nGenius Unrestrained 恃才放旷 (shì cái fàng kuàng)\n\nWho is he:\nFamed to be one of the most brilliant advisers to Cao Cao 曹操, Yang Xiu was either a genius or a lunatic. Going by his track-record of excellent advice and superior logic, he was mostly trusted, even respected, by Cao Cao. On the other hand, Yang Xiu has a nasty habit of thinking way too far and conjuring up dramatic assumptions for harmless incidents. He was the ancient equivalent of a conspiracy-theorist, and that ultimately cost him his life. Learn from the ancients, don't be too smart for your own good.\n\nWhy is he an SP character?\nYang Xiu is not a new character to SGS. In fact Yang Xiu has been around for a while as an original pack character in \"Q version\" of SGS. Why they left him out of the \"mature version\" of SGS is anybody's guess. Rumor has it that YOKA left him out on purpose so as to make the Q version more marketable for collectors. Now they've turned the situation around and made him as an SP character, collectible only through the 1st ever issue of Zhuo You Zhi 桌游志. The first issue is now out of print, together with this character! The official YOKA Yang Xiu card is listing for over SGD$50 per card, making this one of the most collectible SGS cards ever!\n\n\nCharacter ability 1: Have your Cake (and eat it) 啖酪 (dàn lào)\nWhen you are targeted by a tool card that also affects other players, you can immediately draw a card. If you do so, that tool card has no effect on you.\n\nCharacter ability 2: The Wishing Bone 鸡肋 (jī lèi)\nWhenever you receive damage, you can voice out a card type (basic cards, tool cards or equipment cards). The player that caused you damage can no longer use, play, or discard any on-hand cards of that type until the end of that round.\n\nAbility's relation to story:\nYou probably heard the phrase \"have your cake and eat it too\", but a literal version of this scenario actually happened to Yang Xiu. A nomadic tribe sent a box of cakes to Cao Cao as a gift. Cao Cao wrote on the box the words \"一合酥\" (a box of cake). Upon seeing this, Yang Xiu grabbed a spoon and shared the cake with all of Cao Cao's followers. A puzzled Cao Cao asked for an explanation, to which Yang Xiu replied, \"You wrote the words \"one mouthful for every person\", dare I not obey?\" The answer lies in breaking up the words \"一合\" (a box) into its constituent parts \"一人一口\" (a mouthful per person). Cao Cao probably gave him the WTF-look. He wasn't happy that his cake was eaten. The mechanics of this ability seems to create that benefit of \"eating your cake\" by allowing you to draw a card, but it does miss out on the danger to himself that occurred in the story.\n\n\"The Wishing Bone\" is another famous incident. Cao Cao was contemplating a retreat after his general Xiahou Yuan 夏侯渊 was defeated by Huang Zhong 黄忠. He could not decide if it was better to stay and fight or to withdraw, and it weighed heavily on his mind. He repeatedly muttered the words \"chicken bones\" as he drank his chicken soup, probably not referring to anything specific. Yang Xiu got wind of the words \"chicken bones\" and told all the generals to prepare for a retreat. \"Chicken bones are tasteless if eaten, but its a pity to discard them as they are useful for soup. He is signalling that advance is futile, and a retreat is imminent. Prepare to retreat, lest there be panic when the order is given.\" Boy was Cao Cao pissed when he heard that troop morale was dampened by the smart-aleck Yang Xiu!\n\nSo what's the relation of \"The Wishing Bone\" to the story? Not much. It seems more like a defensive mechanism while the story shows that incident was anything but defensive!\n\nAdditional info based on story:\n1. Most famous achievement - Pulling stories and reasoning out of thin air. The two stories listed above are but two incidents. There are others as well, some completely illogical (or logical, depending on your perspective) but all very creative.\n\n2. Cause of death - Executed by Cao Cao. Seriously, he outsmarted himself. The signal for retreat in the \"Wishing Bone\" story was a military breach of conduct, and people have been executed for much less. Cao Cao bit the bullet and executed Yang Xiu. After Yang Xiu's death, Cao Cao did not retreat but instead advanced on the enemy. It was a horrible defeat, and Cao Cao regretted not listening to Yang Xiu after all.\n\nHow to obtain this character?\nPurchase Zhuo You Zhi 桌游志 magazine issue #1 (January 2011) and #2 (February 2011). Unfortunately this issue is no longer in print, and will cost you an arm to buy it!\n\nWiki Link:\nYang Xiu Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"guān-yǔ-关羽-(sp007)","name":"Guān Yǔ 关羽 (SP007)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjnj6NIatG2lagYfzxyYWMjOlWeB9ryvti-EDmmwBlS-iDcZy3mKnun1iBhOX2fPjI07_VQfTqaXbws59478KkBs2FbMCgggQEOZQ97OehtQmlM_HsCPyNV8LzH0YYNnVQT7vZ1n2WcJPpE/s320/spguanyu.jpg","text":"\n\n\nTranslated Description\n“Marquis of HanShou 汉寿亭侯(hàn shòu tíng hóu)”\n\nWho is he?\nEven if you cannot identify him through his new appearance, you should have noticed the Red Hare 赤兔 and the Green Dragon Crescent Blade 青龙偃月刀. Bingo! He’s our loyal “second brother”, the warrior saint in legend, the bearded gentleman in history, Guan Yu.\n\nWait a minute... The frame of this card is blue? Is this like 徐庶Xu Shu, who has a blue frame but still belongs to 蜀 Shu? Oh my god he doesn’t even belong to Shu Kingdom any more? Why was his allegiance changed to 魏 Wei? Designer’s mistake? Printers ran out of blue ink? Don’t panic, Guan Yu never betrayed his only ruler and \"Elder brother\" 刘备Liu Bei. Want to know what’s going on here? Keep reading and find out!\n\nWhy is he an SP character?\nJust like the SP Sun Shang Xiang 孙尚香, SP Guan Yu was created for the completion of the whole Three Kingdoms’ story. This SP version is designed to represent Guan Yu’s life experience under Cao Cao 曹操’s military. In return for being treated respectfully after being captured by Cao Cao, Guan Yu fought for Cao Cao against Yuan Shao 袁绍 for a short while, and was very successful! So successful in fact that Cao Cao really wanted Guan Yu change his allegiance. Guan Yu, of course, refused because of his loyalty to Liu Bei. It was actually Cao Cao who gave him the title of Marquis of Han Shou whilst under his service. After some time Guan Yu left Cao Cao with nothing but his Red Hare and Green Dragon Crescent Blade, riding through thousands of miles to finally rejoin his brothers. This special experience also explains why he let Cao Cao escape after the huge loss at Battle of Red Cliffs 赤壁之战. For more info, just check Ricky’s write up of Guan Yu (蜀Shu) under the “Most famous achievement” section.\n\nCharacter ability1: “Warrior Saint 武圣 (wǔ shèng)”\nEvery card with a “heart” or “diamonds” suit (effectively all red-suit cards) can be used as an ATTACK 杀card.\n\nCharacter ability2: “Single Calvary 单骑(dān qí)” [Awakening ability] \nAt the beginning of your turn, if your number of on-hand cards is larger than your current health units, AND the RULER for the game is Cao Cao, you must reduce your maximum health by 1 unit. You then permanently acquire the ability “Horsemanship 马术”\n\n(Recall: Horsemanship 马术 = You will always have -1 distance in range calculations).\n\nAdditional info based on changes:\nI guess it would really take some time for the players to get used to his new allegiance, because he cannot use ATTACK 杀 for Liu Bei any more! However, he can now react to both “Royal Escort” of Cao Cao and “Exalt the Powerful” of Cao Pi 曹丕.\n\nWiki Link:\n- Guan Yu Wiki\n\nHow to obtain this character?\nHe is not available on SGS online yet. For obtaining a card, purchase ZYZ magazine issue #8 (August 2011).\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"páng-dé-庞德-(sp006)","name":"Páng Dé 庞德 (SP006)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgKoo5Rkr9xYjGnHw18n92kudftyT04Omy14c6hFezTANxPaAfds6M5z7t_m3hSSjNL57x3JI8FN_03OisNhFaaEm3YElqrPNLm-aYT0_dQiV0KwmwgGW4PQv_WHgw_4-kiAFZgGeHFkH6M/s320/sppangde.jpg","text":"\n\n\nTranslated Description:\n“Carrying The Coffin 抬榇之悟(tái chèn zhī wù)”\n\nWho is he?\nAn admirable man. He is Pang De,a brave fighter and an exceptional general living in the Three Kingdoms era. In his entire life, he changed rulers multiple times, but nobody questioned his loyalty. He proved his devotion with his own life: he fought against enemies valiantly, and he even carried his coffin into battle to show his courage (See Ricky’s write-up about him, the “Most famous achievement” part). Unlike Lu Bu 吕布, who also changed ruler quite often (because the idiot killed his own ruler before jumping ship), Pang De gains all the\nvaliant titles from the historians, which I guess proves his heroic personality. Lu Bu, on the other hand, gets titles such as “Brave but without cunning, violent but without benevolence”, titles worthy only for a short-sighted boar.\n\nWhy is he an SP character?\nBecause the previous drawing of him is too ugly!!! But no, ZYZ magazine simply chose to release several SP characters with different allegiance and portraits. Pang De is just another one of them. All the new designs are supposed to help complete the whole Three Kingdoms’ story. The original version of him is considered as a neutral hero, whereas this SP version represents his last days as a general of Wei Kingdom. Anyway, personally, I am really happy to see this “carrying coffin” version of Pang De, which makes him 30% cooler!\n\nCharacter ability1: “Horsemanship 马术 (mǎ shù)”\nYou will always have a -1 distance advantage (default “-1 horse” equipped)\n\nCharacter ability2: “Fearsome Advance 猛进 (měng jìn)”\nWhenever your ATTACK 杀 is evaded by DODGE 闪, you can forcefully discard one of the opponents cards (on-hand or equipped). Note that you select the card for discarding and not the opponent.\n\nAdditional info based on changes:\nNothing special to say about this part. Both of his abilities are aggressive ones. Change of his allegiance really does not affect him too much. On the whole, his abilities are not cooperative with any Ruler Abilities and he could die early in the game from lack of defensives.\n\nWiki Links:\n- Pang De Wiki\n\nHow to obtain this character?\nHe is not available on SGS online yet. For obtaining a card, purchase ZYZ magazine issue #7 (July 2011).\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cài-wén-jī-(lady-cai)-蔡文姬-(sp009)","name":"Cài Wén Jī (Lady Cai) 蔡文姬 (SP009)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhDceg-WlfgYQoxc2T-VhtwU-xihVf7Gjnle_NgXt9ekaN9LbU7ec8s4a3oWrWonUzVeNG8-OnBcanntCWvlUd0NYxAKnEmSz7Gw9BrUaKrrWVqZRRYxRaN78CzDXbbjSdlcodevq18Gh7D/s320/spcaiwenji.jpg","text":"\n\n\nTranslated Description\n“Extraordinary Talent 金璧之才(jīn bì zhī cái)”\n\nWho is she?\nIf you ask me who was the most beautiful lady during the whole Three Kingdoms era, I really can't name one. The beautiful ladies always leave their names in history (just like Da Qiao 大乔, Xiao Qiao 小乔, Diao Chan 貂蝉). But if you ask me who was the most talented lady at the time, I am sure that must be Lady Cai, who is also called Cai Wen Ji 蔡文姬 in history. The proof is that she did not only leave her family name but also her first name (蔡琰Cài Yǎn) in the history books. In ancient China, that was a special honor reserved for only the smartest of ladies such as Zhen Ji 甄姬 (whose real name was 甄宓Zhen Mi), and Huang Yue Ying 黄月英. Lady Cai was a poet, a composer and was famous for her incredible memory in literature. Want to know more about her? Just check out the previous write up!\n\nWhy is she an SP character?\nTechnically speaking, Lady Cai is indebted to Cao Cao 曹操. Though she was born in a noble family, she spent 12 years as a prisoner under the Huns, until Cao Cao paid a heavy sum for her freedom. In  return, she worked for Cao Cao and his Wei Kingdom. This special experience was really tragic, and also made her a special female character, both in history and SGS game. I guess the game-makers wanted to give her a sense of loyalty to her benefactor, thus this Wei version as the SP character.\n\nCharacter ability1: “Dirge 悲歌 (bēi gē)”\nEvery instance a player suffers damage from an ATTACK, you can discard a card (on-hand or equipped), and the player who suffered the damage flips a judgement card.\n\nIf the judgement is “hearts”, the victim regains 1 unit of health.\nIf the judgement is “diamonds”, the victim draws 2 cards.\nIf the judgement is “clubs”, the attacker discards 2 cards.\nIf the judgement is “spades”, the attacker flips his/her character card over.\n\nCharacter ability2: “Sorrow 断肠(duàn cháng)” [Enforced ability] \nThe player who kills you loses all of his/her character abilities until the end of the game.\n\nAdditional info based on changes:\nNothing much has changed except her portrait (and the allegiance). It’s probably just due to the unpleasant players’ reviews about the original portrait. The original was indeed quite scary, yet according to history, Lady Cai was a beautiful woman. This version presents that quite well but the sorrow on her face has gone. Anyway, for the readers out there, which one do you prefer?\n\nRicky: Actually I prefer the old portrait, which had that abandoned vagabond psycho-killer look. The old version reminds me of The White-Haired Demon 白发魔女 while this new version looks like she's totally decked out from a shopping spree.\n\nWiki Links:\n- Cai Wen Ji Wiki\n\nHow to obtain this character?\nShe is not available on SGS online so far. For obtaining a card, purchase ZYZ magazine\nissue #10 (October 2011).\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"jia-xu-贾诩-(sp012)","name":"Jia Xu 贾诩 (SP012)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNcpAJSzkZCs5u98A9FGB08uvyqzNw1CdK1WN8ZdF4Etb63IDd7ygAbJs9HarOE3jFiyOTIh1N3ShELS8I5WA6FwoVe6NEausd-94WwFHmzQIxkraGoD320nACGwSM8V0kjZyVWA-f32M6/s320/spjiaxu.jpg","text":"\n\n\n\nTranslated Description:\n“Never a strategy miscalculated 算无遗策(suàn wú yí cè)”\n\nWho is he?\nI remember it clearly when the celebrity Chinese scholar Yi Zhong Tian 易中天 (famed for his televised lectures of ROTK) said: “Jia Xu was probably the smartest character during the whole Three Kingdom era.” As an advisor, Jia Xu’s work experience seems to be a little complicated. He previously served Dong Zhuo 董卓, Li Jué 李傕 and Zhang Xiu 张秀 before finally joining Cao Cao 曹操. Then he served as an official in Wei Kingdom under Cao Cao's son, Cao Pi 曹丕. Despite his flip-flopping loyalties, Jia Xu was an exceptional advisor. Not only did he know what his ruler was thinking, he also knew what his enemy was thinking. He always considered every detail and possibility, then predicted what would happen next with uncanny accuracy. According to historical records, he never made a single strategic mistake in his entire life. In the last few years of Cao Cao's rule when the irate ruler became extremely paranoid, many great advisors were slaughtered, but not Jia Xu. In my personal opinion, this man really is a legendary figure. If you want to know more details about him, just check out Ricky’s write-up about him and find out!\n\nWhy is he an SP character?\nJust as the other SP characters, he changed his allegiances in history. SGS decided to make an SP version of him to complete the whole story of the Three Kingdoms.\n\nCharacter ability 1: “Unmitigated Murder 完杀 (wán shā)” [Enforced ability] \nDuring your turn, with the exception of yourself, only characters who are on the brink of death (health equals zero or less) can use PEACH 桃.\n\nCharacter ability 2: “Descend into Chaos 乱武 (luàn wǔ)” [Single-Use Ability] \nDuring your action phase, your can force every player, other than yourself, to use an ATTACK 杀 on another player at the least distance away. If a player is unable to do so (no ATTACK cards to use or attack range cannot reach any player), the player will lose 1 unit of health. Recipients of the ATTACK need to use DODGE 闪 to evade. This ability will proceed in succession starting from the player on your right.\n\nCharacter ability 3: “Behind the Curtain 帷幕 (wéi mù)” [Enforced ability] \nYou cannot become the target of tool cards with the suit of \"clubs\" or \"spades\".\n\nAdditional info based on changes:\nNothing really changed except his allegiance and drawing. Well, this drawing does look better than the previous one, which is way too scary. However, lots of people think that his abilities should be changed after the change of his allegiance. His abilities do not support any of the Wei Rulers. Furthermore, Jia Xu never employed his “descend into chaos” ability again after joining Wei.\n\nWiki Links:\n- Jia Xu Wiki\n\nHow to obtain this character?\nHe is not available on SGS online yet. For obtaining a card, purchase ZYZ magazine issue #12 (December 2011).\n\nContributing Writer:\n- Cherry Cat\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xún-yoū-荀攸","name":"Xún Yoū 荀攸","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvVnM_r9YGCZBs2eDl9KrdzQhBFD7iBJKZQ4lMD8LaHto-FF2S8qMOf0HlXGh45oSMTSMWdPWAOUN5hOedj3UPsGwmwrZsCNXtV_A1mMCPfNIgk0SeZRTp3NK7ZmL78wh-DD3yyC70Ur30/s320/xunyou.png","text":"\n\n\nTranslated Description:\n\"Master Strategist of Cao Wei 曹魏的谋主 (cáo wèi dè moú shì)\"\n\nWho is he:\nIn a time where heroes and talents sprouted like cow grass after a blaze, there were simply too many important people for all of them to have gained as much attention as they deserve. Xun You was one of these lesser known greats. Many of the big achievements behind Cao Cao 曹操's early conquests had Xun You's influence. He was on of Cao Cao's most brilliant and effective advisors, playing a key role in the eradication of Lu Bu 吕布 and Yuan Shao 袁绍. It also happens the Xun You is the nephew of another brilliant advisor to Cao Cao, Xun Yu 荀彧.\n\nXun You was a quiet and low-profile figure, but his strategies were wickedly effective! For this reason, Cao Cao very much trusted Xun You. Alas, his low-profile prevented stories and fables, and ultimately he never got the popular hype he rightly deserve in history. But perhaps, that was just how he would have preferred it.\n\nCharacter ability 1: Contrivance 奇策 (qí cè)\nIn the action phase, you can use all your on-hand cards (minimum of one) as any one non-time-delay tool card. Limited to once per turn.\n\nCharacter ability 2: Playing Dumb 智愚 (zhì yú)\nEvery instance after you receive damage, you can draw a card, then display all your on-hand cards. If all your on-hand cards are of the same colour, the source of your damage must discard one on-hand card.\n\nAbility's relation to story:\n\"Contrivance\" originated from Xun You's ability to plot numerous stratagems. He was responsible for the flooding that defeated Lu Bu, as well as the victory over the Yaun Shao and his sons (some were contributed by Guo Jia 郭嘉). It was said that he plotted twelve contrived schemes for Cao Cao in his life, but no one knew what those schemes were. Only his close friend, Zhong Yao 钟繇, knew the exact details of each scheme, but Zhong Yao died before ever publicizing them. The game mechanism allowed Xun You to use his on-hand cards as one of the twelve tool cards (corresponding to the 12 contrived schemes). As the loyal supporter of Cao Cao (unlike his uncle, Xun Yu, who was loyal to the Han dynasty), he could convert his on-hand cards as AOE to give all his on-hand cards to Cao Cao, symbolising his presentation of schemes to Cao Cao.\n\n\"Playing Dumb\" referred to Xun You's personality. Xun You liked to pretend to be a mediocre adviser, and revealed his wisdom only when it was needed. Cao Cao said \"公達外愚內智，外怯內勇，外弱內強 Gongda (the style name of Xun You) feigned ignorance to hide his wisdom, feigned cowardice to hide his courage, feigned weakness to hide his strength\". In Xun You's early life, he and his friend plotted the assassination of Dong Zhuo 董卓, but they failed and were arrested. His friend commited suicide for fear of tortures, while Xun You stayed calm and lived casually in prison. When Dong Zhuo observed this, he spared his life. \n\nHow to obtain this character:\nXun You is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cáo-zhāng-曹彰","name":"Cáo Zhāng 曹彰","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgfuJyQplTu13YJCiLFU69sO55D_E68FugvHwR4t7r0Sd0tcF_0XkeFYIr3mprpXVjFlhsx1rzSf4T2X8gJl2Bnbh76veWKjGYiIzG7C4ZysRkRjrGtbD1dA19GHBoSYX-3xls-NBMiZvCN/s320/caozhang.jpg","text":"\n\n\nTranslated Description:\n\"The Yellow Bearded Son 黄须儿 (huáng xū ér)\"\n\nWho is he:\nWe all have funny nicknames given by our parents, which is their way of personalizing that bond between child and parents. Thus to have Cao Zhang's father, Cao Cao 曹操, endearingly nickname him \"my yellow bearded son\" was a sign of his father's fondness. In his youth, Cao Zhang was said to have wrestled with live beasts using his bare hands. His ferocity and his courage would make him an excellent general.\n\nBut did Cao Cao want Cao Zhang to be a general? No. Instead, Cao Cao wanted Cao Zhang to be a doctor! Cao Zhang gave his father the 3rd century equivalent of the finger, and pursued military warfare against his father's wishes. In later years he would again disobey his father's orders, but for prudent reasons that turn out to be right.\n\nA brave and accomplished warrior with tactical smarts, surely Cao Zhang should have succeeded Cao Cao as ruler of Wei... but why didn't he? Read on to find out!\n\nCharacter ability: Versatile Fighter 将驰\nDuring the drawing phase, you can choose 1 of 2 options.\n\n1. Draw 1 extra card. If you do so, you cannot use or play any ATTACK 杀 cards until your turn is over.\n\n2. Draw 1 card less. If you do so, any ATTACK cards used during your action phase has unlimited range. You can also use 1 more ATTACK card in that turn. Effects last till your turn is over.\n\nAbility's relation to story:\nThis ability was meant to show off the military talent of Cao Zhang. According to the character designer, he wanted to depict a general riding and fighting in the Northern regions of China, thus giving the name of this ability.\n\nIn addition, I believe 将驰 was a pun on 张弛 \"Versatile Fighter\", referring to the versatile warrior and the meaning of skillfulness. According to the designer, he must be versatile enough to defeat the normadic tribe known for their high mobility and hit-and-run tactics. When it was not the time to attack, Cao Zhang prepared himself for the coming battle (draw one more cards without attack). When he found chances, he struck his enemies with full strength without hesitation (no drawing cards for more aggressive actions). Being the northern defense line that support Cao Cao's southern campaigns, he could draw more cards to trigger Cao Cao's Ruler ability \"Royal Escort 护驾\".\n\nTrivia:\nYou probably know by now that Cao Cao was succeeded by Cao Pi 曹丕 instead of Cao Zhang. There are a few versions of what happened following the ascension of Cao Pi, but all seemed to agree on 2 things:\n\n1. Cao Zhang was away during his father's death. He was on his way back to see Cao Cao but never made it back in time.\n\n2. Cao Pi was paranoid and insecure about Cao Zhang challenging his succession.\n\nHistory recounts that Cao Pi sent Cao Zhang away to lord over a region of Wei, far from the capital to be a threat. Cao Zhang died soon after due to an illness. However another version of history says that Cao Pi deviously poisoned Cao Zhang over a game of chess. Which is the truth, we may never know. As for ROTK, the author made Cao Zhang's return to the capital seem like a military campaign, bringing with him thousands of troops. However Cao Zhang had no intention to strike Cao Pi, but instead came and left as a mourner, and nothing more.\n\nPersonal opinion, I think Cao Zhang would have made a better ruler than Cao Pi, but that's not to say that Cao Pi wasn't successful in his own way.\n\nHow to obtain this character:\nCao Zhang is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"wáng-yì-王异","name":"Wáng Yì 王异","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEghNh2bXMvmMtMXfqFKQBFL2VDW64cqlqRXV4hGFXvNm1kOb7jFejfRxehYhuXy-HfCTWgsb3S2j444pqyFRsX-OJ2AbeQw3Nk8kSlOIoPNWQLk2v1sxp4jOeeRP0VTFlp8qjZVVfTY33Mb/s320/wangyi.jpg","text":"\n\n\nTranslated Description:\n\"The Elated Damsel 快意的巾帼 (kuài yì dè jīn guò)\"\n\nWho is she?\nThe more I studied up on this new female character, the more confused  I became. The confusion stems from the disparity between Wang Yi in literature/history, and Wang Yi as described in this card. The last adjective I would use to describe her is \"Elated\"! She attempted suicide twice, covered her body in mud and sh*t for a year, then eventually roused herself up to be a fearsome fighter and steely, ruthless loyalty. Put it this way: how could you call someone \"happy and blissful\" when this person rather let her sons die in the hands of the enemy than talk peace?\n\nI seriously don't get it. If someone out there knows more about this than I do, please do share!\n\nWang Yi was the wife of an official called Zhao Ang 赵昂. Her husband is so insignificant that he does not have his own Wiki write-up. Yes, the curry is all Wang Yi, whose life story can be summed up as Princess Diana-turned-Whitney Houston (during her drug episode)-turned-Joan of Arc. While her husband was away, a revolt happened and both her sons died while attempting to quell the rebellion. In the face of certain death, she chose suicide, then decided not to so as to bring up her daughter. She covered herself up in mud and crap so as to stay chaste (and not get savaged by the enemy). When the rebellion ended, Wang Yi and daughter journeyed to meet her husband, but halfway decided to complete her suicide since her daughter was now safe. However she was rescued... then years later became quite the fighter! How did that happen? Read on the find out.\n\nCharacter ability 1: Death over Desecration 贞烈 (zhēn liè)\nBefore your judgement card takes effect, you can display the top card of the deck and use it as a substitute.\n\n\nCharacter ability 2: Hatch a Plan 秘计 (mì jì)\n\nIf you are injured before the beginning (or ending) phase of your turn, you can flip a judgement card. If the judgement card is black-suited, you can view X cards from the top of the deck (X being units of health lost), then give these cards to a player. \n\n\n\nAbility's relation to story:\n\n\"Death over Desecration\" referred to Wang Yi's action to protect her daughter's and her own chastity. During her husband's leave, some rebellous troops sieged the city and killed her sons, she intended to commit suicide, but he did not so so because no one would protect her daughter after her death. Instead, she covered herself in clothes soaked in sewage of feces. When her husband returned, she intended to commit suicide because it was a responsibility to commit suicide to protect her chastity for her husband in dangerous situations, and she merely delayed this process to protect her daughter.\n\n\"Hatch a Plan\" referred to Wang Yi's ability to plot when falsely serving her enemies.\n\nTrivia:\nFor what ever reason, Wang Yi's failed suicides turned her resolve and loyalty to her country as hard as heat-treated steel. She once rode into battle beside her husband, using the bow and arrow as her weapon. She also gave the troops her jewellery, which did wonders for morale. Even after Ma Chao 马超 captured the heir to Zhao Ang (I suspect the heir is not her son, but son of another wife), she bluntly told her husband not to succumb to blackmail, but fight to the death and let the heir die. Die the heir did, but it just shows how merciless and cold Wang Yi became in her fight for her their sovereignty.\n\nComments by Authors:\nI am disappointed by both her illustration and her abilities. The illustration was too sexy, not suiting the fact that she forfeited her beauty to protect her daughter. Her abilities just did not fit the mechanisms. \"Death over Desecration\" did not show how Wang Yi protected herself. Instead, it showed that she did not surrender to fate. This is a judgment tinkering ability, which makes it complicated when multiple judgement tinkerers are present. Imagine what would happen if Sima Yi, Zhang Jiao and Wang Yi were present... Also, \"Hatch a Plan\" did not have any relationship to her plots!\n\nI noticed that \"Death over Desecration\" has been amended since first translation. Now the ability applies only to her own judgement cards, which would make more sense now since she was protecting herself in the story. However \"Hatch a Plan\" is an enigma to me. I didn't find much reference to her hatching any plans, or what those plans were. It seemed more like she was the trumpet-blower, rallying everyone to fight for their cause. And I still cannot understand why her description is \"快意的巾帼\"!! Can someone please enlighten us??\n\nHow to obtain this character?\nWang Yi is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhōng-huì-钟会","name":"Zhōng Huì 钟会","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgGB1t4hjKQl8b20owAXi8WJMffRZKwczWHxGKwYQ7BzOGAQawbGG1ZLGNUv4J3-LLcUBBJ_LyQxZydTdCUgld3D7_v4IURHHflLAzPM66SmCdxqG998Rh22K8m-86sby44qLoh5U7UrwFH/s320/zhonghui.png","text":"\n\n\nTranslated Description:\n\"The Audacious Schemer 桀骜的野心家 (jié ào dè yě xīn jiā)\"\n\nWho is he:\nThis is one of those guys who smiles at you and could seem to be the most reliable guy, except that he's been secretly plotting to take over the world! Unlike \"Brain\" from \"Pinky and the Brain\", Zhong Hui doesn't just talk about it, he has consistently taken action to carry out his audacious plans. In the final few chapters of ROTK, Deng Ai 邓艾 had led the Wei forces to successfully defeat Shu Kingdom. Although Jiang Wei 姜维 surrendered, Jiang Wei never lost hope in reviving Shu. It just so happened that Zhong Hui was jealous of Deng Ai's success, and plotted with Jiang Wei to rebel and take back the kingdom for themselves again.\n\nAlas, like a hollywood double agent script, Zhong Hui's actions over the years had already raised suspicion and his ploy to rebel was uncovered quickly. In the madness that followed, both Wei forces and the rebels of Jiang Wei and Zhong Hui clashed in the bloody melee. Neither Jiang Wei nor Zhong Hui survived, and thus sealed the fate of Shu kingdom forever.\n\nCharacter ability 1: Amassing Power 权计 (quán jì)\nAfter you receive 1 unit damage, you can draw 1 card, then place 1 on-hand card on your character card. This card will be known as a \"Power\" card. Every \"Power\" card you have on your character card, your on-hand card limit increases by +1.\n\n(Note: \"Power\" cards are viewed as being removed from play.)\n\nCharacter ability 2: Uprising 自立 (zì lì) [Awakening ability]\nAt the beginning of your turn, if you have 3 or more \"Power\" cards, you must reduce 1 unit of your maximum health limit, then either regain 1 unit of health or draw 2 cards.\n\nYou also acquire the ability \"Eradicate 排异\".\n(In the action phase, you can discard 1 \"Power\" card and allow any player to draw 2 cards. After drawing 2 cards, if that player has more on-hand cards than you, you inflict 1 unit of damage on that player. Limited to once per phase.)\n\nAbility's relation to story:\nThe abilities of Zhong Hui are simple yet well-designed, contrast to those of OKF2012 characters, who are sophisticated and poorly-designed. They represented different actions in Zhong Hui’s life and shared similarities with Deng Ai (his rival) and Jiang Wei (his seemingly comrade). “权计” was a mixture of权(power) and 计(schemes). It showed how Zhong Hui was promoted to his place. He seized power by presenting schemes to his boss in the Rebellion of Zhuge Dan, while plotted secretly to steal the troops from his comrades in the Conquest of Shu Kingdom, against Zhuge Xu and Deng Ai. Noticeably, he could use this ability only when he suffered damage, referring to the fact that he crawled to his place by his actions in military campaigns. If Zhuge Dan did not rebel, he would not be able to present his schemes; if Jiang Wei did not attack Wei Kingdom, Sima Zhao would not initiate the Conquest of Shu Kingdom, and Zhong Hui would not have seized power from his comrades.\n\nYou may notice the similarity between Deng Ai’s “Amassing Terrain” and Zhong Hui’s “Seizure of Power”. Both of them involve cards removed from game, and these cards served functions before and after awakening. However, the sources and functions of these cards were different, presenting the difference in their lives. For the sources, Deng Ai’s “Amassing Terrain” is activated by loss of cards outside his turn. This is because Deng Ai was originally a low-ranked agricultural official, who developed farmlands when there were deficiencies. Zhong Hui’s “Seizure of Power” is activated by suffering damage. This is because Zhong Hui was born of high class as a strategist of Wei (symbolized by damage-triggered ability like “Bequeathed Strategies” and “Eternal Loyalty”), and he seized power in military campaigns. For functions, Deng Ai’s “Terrain” allowed he to reach his enemies easily for improved logistics, while Zhong Hui’s “Power” allowed him to store more cards, symbolizing Zhong Hui hiding his ambition before his rebellion.\nHis awakening ability, “Uprising”, referred to his notorious rebellion after the Conquest of Shu Kingdom. The ability mechanism resembled Deng Ai and Jiang Wei, as he needed to accumulated three cards removed from game (similar to Deng Ai), and he could choose to regain 1 unit of card or draw 2 cards (similar to Jiang Wei). It should be noted that Zhong Hui’s “Uprising” was more difficult to activate when compared to Deng Ai’s “Conduit”, suiting the historical fact. Deng Ai was promoted for his contribution of constructing canals and became a general to “Blitz” the Shu Kingdom, which turns out to trigger the rebellion of Zhong Hui.\n\nLiterally, “排异” means “eliminating those who oppose you”. This ability allowed Zhong Hui to use his political and military “Power” accumulated before his rebellion to seemingly support a character. However, if that character has more on-hand cards than you, you are indeed injuring him. This is reflected by the fact that Zhong Hui denounced Deng Ai by accusing him to be ambitious and rebellious (with too many cards that can harm someone).\n\nTactics:\nAs foretold by ZYZ # 17, this ability correlated to Jiang Wei and Deng Ai very much. Zhong Hui can delay the awakening of Jiang Wei by letting him to draw cards (Jiang Wei awakens if he has no on-hand card at the beginning of his turn), while replenishing Jiang Wei’s combat ability by allowing him to draw more cards after awakening without damaging him. On the other hand, Zhong Hui and Deng Ai were independent to each other before awakening (before Zhong Hui’s uprising, they both served Sima Zhao and fought against Shu), while Zhong Hui can suppress Deng Ai by activating “Conspiracy” against him. After Deng Ai’s awakening (becoming a general against Shu) and uses of “Blitz” (victory over Shu Kingdom), he would have lower health and a whole bunch of cards. It would be easy to deal damage to Deng Ai by “Conspiracy”, while the damage would not activate “Amassing Terrain” (Deng Ai cannot resist Zhong Hui’s false accusation).\n\nBTW, if you observe carefully, Deng Ai had an advantage when fighting Zhong Hui, because Zhong Hui’s “Taunt” on Deng Ai would always activate “Amassing Terrain”, while “Amassing Terrain” would allow “Deng Ai” use “Blitz” on the weakened Zhong Hui.\n\nHow to obtain this character?\nZhong Hui is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"cao-ren-曹仁-(*sp003)","name":"Cao Ren 曹仁 (*SP003)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhwiDg8QUc4mRqSMd7LfVUO9cl3cLljTMycjHDqvdOCX-DDJnsspNCyyu2pZma21TbnyxFa-dDZJ-vDB4gD7VzS41GauR5GKfVYjGe4jsEmspTe8TkppuqBGmdVHgtdPFpbvxx3D3QRkz8x/s320/cao+ren+front.jpg","text":"\n\n\nTranslated description:\n\"Quitting is not an option 险不辞难 (xiǎn bù cí nán)\"\n\nWho is he:\nYou are probably familiar with him by now. Before this SP release, Cao Ren was considered one of the least popular characters. I especially did not look forward to skipping one full round of action despite having additional cards. I felt like a wealthy paraplegic whenever I used him.\n\nSad to say, I'm still not a fan after this update. True, his defensive abilities have remained, and its usefulness is now pegged to player skill. He now has a 2nd ability that gives him slightly more playability. His portrait also looks fantastic and I would gladly hang a life-size poster on my bedroom wall.\n\nBut his most crippling weakness still remains: that \"skip-a-turn\" cost for using his first (and most useful) ability. Ultimately, I feel like i'm still handicapped and restrained. It's an improvement no doubt, but I'd still wouldn't use him.\n\nWhy is he an SP character?\nThe answer is simple. The old Cao Ren was as energetic as a kettle, and just as respected. If there was a character that needed tweaking, he was it.\n\nCharacter ability 1: \"Break Out 溃围 (kuì wéi)\"\nAt the Ending phase of your turn, you may draw 2 + X cards, then flip your character card over. If you do so, you must discard X cards at the beginning of your next drawing phase. X is the total number of weapon cards in all the equipped areas of all characters.\n\nCharacter ability 2: \"Discipline 严整 (yán zhěng)\"\nIf the number of your on-hand cards is larger than your health, you may use any of your equipped cards as NEGATE 无懈可击.\n\nAdditional info based on changes:\nBeing a master of defensive warfare, Cao Ren knew that simply entrenching was the worst defensive tactics, as the cut of supply would slowly deplete the defense. Only by counterstriking and breaking through the encirclement could save his troops. Cao Ren himself performed two amazing breakthroughs in the history. The first one was in the defense of Jiang Ling 江陵. After the defeat of Cao Cao 曹操 in Red Cliffs, Zhou Yu 周瑜 led his troops to attack the city of Jiang Ling. Cao Ren was assigned to protect Jiang Ling, and he sent Niu Jin 牛金 and 300 troops to challenge  the vanguard of Zhou Yu's troops. Niu Jing's troops were encircled quickly. Neglecting the advice of Chen Jiao 陈矫, Cao Ren managed to lead some elite cavaliers personally to save Niu Jing, which was a success. The adviser stopped him just before exclaiming, \"General, you are truly a man from Heaven!\".\n\nBetrayed by the name, \"Breakthrough\" is actually a defensive ability like his previous ability \"Entrenchment\". Perhaps the action of drawing cards reflected the preparation of Cao Ren and the action of discarding reflected the depletion of power after counter attacking? \n\n\"Discipline\" was the backbone of army, and Cao Ren was good at promoting discipline of his army, just as almost all Wei generals. Discipline was an essential concern of Cao Cao, who aimed at conquering/liberating (pick the one you like) the whole China, Being a respected general and a master of defense, Cao Ren knew the importance of discipline very well. His army was one of the most disciplined troops at that time. This ability allowed you to convert equipped cards to NEGATE. Perhaps it shows that you have to discard the impure troops to maintain \"无懈可击 (No flaw to be exploited)\"? \n\nHow to obtain this character?\nPurchase the 14th issue of Zhuo You Zhi magazine (March 2012) to get this limited character card as a free gift! Or simply purchase it separately through Sino-Games.com!\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"wáng-yuánjī-王元姬-(sticker-add-on)","name":"Wáng Yuánjī 王元姬 (Sticker Add-on)","faction":"wei","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg5qwuG2gHYPnfV1RYuWqJN2t6_GczFBBAEReQaqqbiCvMU7mEQmptLDEuJCEvLqutR32YN0ZoNCpqW4UPH2fI8x8uu6i7HPwyshAoC7BnXmSXLb3mz8b-AGgak4JKQQjPmIxIELGA2qeqg/s320/wangyuanji.jpg","text":"\n\nTranslated Description:\n\"Civil and Understanding Empress文明皇后 (wén míng huáng hòu)\"\n\nWho is she:\nIt is fitting that Wang Yuanji is released together with Sima Zhao 司马昭, simply because these two were husband and wife. From a young age of 15, Wang Yuanji was married to Sima Zhao. Little is known about her except that she's incredibly scholarly from a very young age, is obviously very smart as you shall read about later on, and is very humble as the wife of the defacto leader of the kingdom. Sounds like the kind of wife most men would want: loyal, humble, and intelligent such that she is his most loyal advisor. Even by today's standards, such women are incredibly rare!\n\nCharacter ability 1: \"Smother 扶亂 (fú luàn)\"\nDuring your action phase, you can discard 3 cards of the same suit to flip the character card of a player within your attacking range. If you do so, you cannot use ATTACK 杀 in your turn. Limited to one use per phase.\n\nCharacter ability 2: \"Virtuous 淑德 (shū dé)\"\nAt the ending phase, you can draw cards such that your number of on-hand cards is equal to your health limit.\n\nAbility's relation to story:\n\"Smother\" refers to her prediction of the rebellion of Zhong Hui 钟会. Zhong Hui was very talented and presented many schemes to Sima Zhao, but Wang Yuanji reminded Sima Zhao that Zhong Hui was extremely ambitious, and should not be trusted completely. During the invasion of Shu Kingdom, Sima Zhao allocated troops on the boundary, said to be taking precautions against Zhong Hui. The mechanism of the ability is that Wang Yuanji can smother the action of her enemy if given enough power.\n\n“Virtuous” refers to her personality. It is said that Huang Yuanji was wise and frugal. However, the ability does not relate to any virtue. It seems that the designer just needs a name to nominate this ability.\n\nTechnically speaking, the meaning of 扶亂 leans more toward being supportive in nature instead of being antagonistic, however the reference of her smothering Zhong Hui's rebellion, as well as how the ability is designed to be antagonistic in nature. It may not really be 100% suitable with Wang Yuanji's personality, if you are very strict about it.\n\nHow to obtain this character:\nWang Yuanji can be obtained from the August 2012 issue of Zhuo You Zhi magazine, alongside *SP008 Da Qiao. It is available as an add-on \"sticker\" to be pasted on the \"blank\" character cards that are originally provided within the original pack as back-ups.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"}]