[{"id":"sūn-quán-孙权","name":"Sūn Quán 孙权","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEit4KzCQbOB64RnIevFS_ah9NJusF3p2-8_QtlknI029T_VIqlPcWwxPh3KLct3l-6Rxv4OzdFPWkrCusiGzM4xXtIpMn3gJiVaKPckBpmTGPbYsKl7UaKcjBAGk3cCelTOQnsfqMbGHaQW/s320/wusunquan.jpg","text":"\nTranslated description:\n\n\"Young and Virtuous Ruler 年轻的贤君 (nián qīng dè xián jūn)\"\n\n\nWikipedia link: Sun Quan Wiki\n\n\n\nWho is he:\n\nOne of \"the Three\", Sun Quan is the ruler who ultimately formed the Kingdom of Sun Wu 孙吴. He took over the reigns of ruler from his elder brother, Sun Ce 孙策, at the age of 18 and led the Wu Kingdom till his death at 70 years old. He is the longest serving ruler of the era. Compared to Sun Ce who was known as the \"Little Conqueror 小霸王\", Sun Quan was not as strong a combat fighter, but he was able to win the hearts and respect of his generals and people. He was surrounded with loyal and capable talents, which he prudently retained. The Kingdoms of Sun Wu and Shu Han 蜀汉 formed an alliance to resist Cao Cao 曹操's attacks. However, Sun Quan's short alliance with Liu Bei 刘备 became a sore point as the wits of Sun Wu were no match for the prescient Zhu Ge Liang 诸葛亮. Regardless, the Kingdom of Sun Wu lasted longer than both Cao Wei 曹魏 and Shu Han. It was the last to be defeated by the Si Ma 司马 family, which marked the end of the Three Kingdoms era and the beginning of the Jin Dynasty 晋朝.\n\n\n\n\nCharacter ability 1: \"Balance of Power 制衡 (zhì héng)\"\n\nDuring your action phase, you can discard any number of cards (both on-hand or equipped) and draw the same number of new cards from the deck. Limited to once per turn.\n\n\n\nCharacter ability 2: [Ruler ability] [Enforced ability] \"Rescued 救援 (jiù yuán)\"\n\nWhen you are rescued from the brink of death by other Wu characters via the use of PEACH 桃, you recover 1 additional unit of health (from zero health to two units of health).\n\n\n\nAbility's relation to story:\n\n\"Balance of Power\" refers to Sun Quan's decision to ally with Liu Bei so as to counter the immense army of Cao Cao. Before the battle of Red Cliffs 赤壁之战, Cao Cao has already amassed an army far greater than either Shu Han or Sun Wu. With the alliance, both the kingdoms were able to restore the balance of power and prevent a complete runover by Cao Cao. \"Rescued\" could be referring to Zhou Tai 周泰's rescue of Sun Quan from numerous near-death encounters. Though it is unfair to single-out Zhou Tai for commendation, the story places great emphasis of Zhou Tai's sacrificial (sometimes suicidal) charges to rescue Sun Quan. \n\n\n\nAdditional info from the story:\n\n1. Most famous achievement - Setting up the Wu Kingdom and having ruled it well from 18 to 70 years old.\n\n\n\n2. Cause of death - Sun Quan died of old-age, though it can also be reasonably said to be due to illness. Either way, he was not killed in  action. Besides, living till the age of 70 in that era is a feat on its own.\n\n\nFAQ and Disambiguation\n\n1. If he uses BLAZE and does'nt have the required suit card to do damage, can he use his ability to change cards before BLAZE is concluded?\n\nAns: No, he cannot use change cards midway through the use of Blaze. The use of the blaze card + discard of card to cause damage should be tightly knitted as 1 action.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"dà-qiáo-大乔","name":"Dà Qiáo 大乔","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhBtZOrT2zZ-jCDMUkODPm7jeSo77ZcwXJgm1SJr8GlgNqq_wbhJzbB118_Hj5iwr3UfjBmuM30wJjg0xq_ZXcr8As_ommbtYEQvVrwKYh6oWfIwH5HpI6QKnHdOZm1Mrm0Ghqfj02rodB2/s320/wudaqiao.jpg","text":"\nTranslated description:\n\n\"The Flower of few words 矜持之花 (jīn chí zhī huā)\"\n\n\nWikipedia link: Qiao Sisters Wiki\n\n\n\nWho is she:\n\nThe wife of \"The Little Conqueror\" Sun Ce 孙策. Da Qiao is a very minor character in the story that has virtually zero air-time. The elder of the \"Two Qiao sisters\", she is supposedly incredibly beautiful, but a person of few words. She can play the Qin (an ancient stringe instrument) and sing as well as her younger sister, but she seldom openly performs. It is said that she only performs for her love, Sun Ce. In the story, she became part of Zhu Ge Liang 诸葛亮's trick to ruse Zhou Yu 周瑜 to war with Cao Cao 曹操, though her effect on him was not as pronounced as that of Xiao Qiao 小乔.\n\n\n\n\nCharacter ability 1: \"National Colours 国色 (guó sè)\"\n\nDuring your action phase, you can choose to use any card (both on-hand or equipped) with a \"diamond\" suit as ACEDIA 乐不思蜀.\n\n\n\nCharacter ability 2: \"Displacement 流离 (liú lí)\"\n\nWhenever you become the target of ATTACK 杀, you can discard any card and divert the ATTACK to a player within your attacking range. This player cannot be the original player that used the ATTACK card.\n\n\n\nAbility's relation to story:\n\nThere is almost no reliable link bridging these abilities to the story line. All we know is Da Qiao is beautiful, so beautiful perhaps that her beauty can mesmerize the enemies into forgetting about the battle? Pure conjecture, of course, and I have not found any direct link. The same with \"Displacement\". The actual translation for 流离 means to live like a wandering refugee, but there is no mention of her after Sun Ce's death that suggests anything like this.\n\n\n\nAdditional info from story:\n\n1. Most famous achievement - Marrying Sun Ce?! Not being misogynistic here but I have not found anything of value. Please share if you have!!\n\n\n\n2. Cause of death - Unknown! It was never mentioned in the story or in historical texts.\n\nFAQ and Disambiguation\n\n\n1. When Da Qiao redirect an attack against Zhu Ge Liang and he has no cards in hand, does it work?\n\nAns: No it does not work. Zhu Ge Liang cannot become the targetbof ''Displacement'' at all if he already has no cards on-hand.\n\n\n2. If a character becomes the target  of ''Displacement'' , can he play ''Dodge'' or MUST he take damage?\n\nAns: He can play DODGE. Displacement only transfers ''ATTACK''. This is in contrast to Xiao Qiao who transfers damage that cannot be dodge.\n\n\n3. If Da Qiao deflects the attack and kills another player, who gets the kill count? Da Qiao or the player that used the attack ?\n\nAns: The kill goes to the player who used the ATTACK and not Da Qiao.\n\n\n4. If it was Lu Bu then the redirected attack will have to discard 2 Dodge to Dodge Lu Bu's redirected attack?''\n\nAns: Yup! Since the ATTACK came from Lu Bu , the victim needs to use 2 dodge cards.\n\n\n5. Can the card duel  or Barbarian or Raining Arrows be redirected?\n\nAns: Nope. She can only redirect ATTACK and nothing else.\n\n\n6. Can I steal or dismantle or negate the diamond card played by Da Qiao as ACEDIA?\n\nAns: Yes it is considered a tool card.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"gān-níng-甘宁","name":"Gān Níng 甘宁","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiBadzsZj04kkwB9M_NLY_pJAaNhO8X3DPCIkc3JxNu2XNXBumddjf8DVwcDEppFRzGTPGmsN4CYi_bkRh82P6NrGE3e2RPZL-2iEdVeqj4nmC_iIVFKASJMqVKwEppOh_-Pr5oOJ2CHquh/s320/wuganning.jpg","text":"\nTranslated description:\n\n\"The Pirate with Silk Sails 锦帆游侠 (jǐn fān yóu xiá)\"\n\n\nWikipedia link: Gan Ning Wiki\n\n\n\nWho is he:\n\nThere is something about Gan Ning I personally admire, and that is the \"I don't give a shit about rules and convention\" attitude. As a youngster, he was a pirate, looting and murdering and wreaking havoc. It was because of this background that he was rejected from joining Liu Biao 刘表's service. However in his later days, Gan Ning proved himself to be a fearless leader with unconventional tactics. His most glorious moment came in his night raid on Cao Wei 曹魏's camps as a distractionary tactic. \n\n\n\n\nCharacter ability: \"Surprise Raid 奇袭 (qí xí)\"\n\nDuring your action phase, you can choose to use any of your cards (both on-hand and equipped) with \"clubs\" and \"spades\" suit as DISMANTLE 过河拆桥.\n\n\n\nAbility's relation to the story:\n\nThere does not seem to be much link between his storyline character and his ability to use DISMANTLE. However the name of the ability is with reference to his famous night raid on Cao Wei's camps. Yet that raid did not cripple any of Cao Wei's supplies or operations, so even there the link is weak. This ability is likely one for the game mechanics rather than fidelity to the story.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Gan Ning's night raid on Cao Wei camps. After Sun Quan 孙权's attack was resisted by Zhang Liao 张辽, Cao Cao 曹操 himself claimed to be bringing a huge reinforcement to back up Zhang Liao. Upon hearing this, the Wu advisor suggested a distractionary raid on Cao Wei's camps. Gan Ning not only volunteered, he brought only 100 men and promised that all 100 would come back alive. In the commando style raid, Gan Ning had his 100 men randomly strike different areas of the camp swiftly and set fire at numerous places. The enemy was disoriented by the scattered flames and did not know where the attack was coming from or how many were attacking. Gan Ning then quickly retreated, all 100 men unharmed, leaving the Cao Wei camp smoldering. It was thus that Sun Quan famously said, \"Meng De (Cao Cao's other name) has Zhang Liao while I have Gan Xing Ba (Gan Ning's other name)\".\n\n\n\n2. Cause of death - Gan Ning was heavily sick but insisted on moving out for the battle of Yi Ling 夷陵之战, he was killed in action by the barbarian king Sha Mo Ke 沙摩柯 (loyal to Liu Bei 刘备) with an arrow to the head. \n\nFAQ and Disambiguation\n\n1. Can I play ''Negate'' card on the dismantle played by Gan Ning?\n\nAns: Yes you can. Gan Ning's black cards if used as Dismantle can be viewed as a tool card.\n\n\n2. Can negate ability be used multiple times per turn , or just once ?\n\nAns: Multiple times. As many times as you want.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"huáng-gài-黄盖","name":"Huáng Gài 黄盖","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEidNn62bJDjocxx6NbCwETCOuhcu-Ks14-HQXx7VS7m_HG539FyDnMQdObsX28MBgDmM9dc4v63nfFy-COtxaEKNu557kGyZbbLdtxBtQJzjo4lkLiJi45mbdYu2Gvpksz3afwxcM1l1u7O/s320/wuhuanggai.jpg","text":"\nTranslated description:\n\n\"Sacrificing the Flesh for the Country 轻身为国 (qīng shēn wèi guó)\"\n\n\nWikipedia link: Huang Gai Wiki\n\n\n\nWho is he:\n\nThe veteran of Wu Kingdom 吴国, Huang Gai served 3 members of the Sun family beginning from Sun Jian 孙坚, then his eldest son Sun Ce 孙策, and finally Sun Quan 孙权. Fiercely loyal, he is best remembered for his sacrificial role in the battle of Red Cliffs 赤壁之战. So prominent was his role, in fact, that his name has become synonymous with the \"Trojan Flesh ploy 苦肉计\" in the story. More about that the sections below.\n\n\n\n\nCharacter ability: \"Trojan Flesh 苦肉 (kǔ ròu)\"\n\nDuring your action phase, you can choose to lose 1 unit of health and draw 2 more cards from the deck. This ability can be used repeatedly in a turn.\n\n\n\nAbility's relation to story:\n\nA marvelous fit! Huang Gai suffered terrible pain and physical abuse, all for the sake of gaining a strategic advantage (ie: deceiving Cao Cao 曹操). In this card game, this effect is reproduced well whereby the additional cards can make a big difference. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - The ignitor of the flames that burnt Cao Cao's fleet. The ploy is the brainchild of Zhou Yu 周瑜 and Huang Gai, where Zhou Yu needs Huang Gai to feign his defecting over to join Cao Cao. However Cao Cao knows that Huang Gai is very loyal, thus more extreme measures need to be used. An elaborate show was set up in the Wu camp whereby Huang Gai interrupts Zhou Yu and advises surrender. In a show of fury, Zhou Yu orders Huang Gai executed. The other generals and advisors all plead for Huang Gai's life and Zhou Yu finally relents, lightening the punishment from death to 50 strokes of the staff. Huang Gai's flesh was bloodied and torn after the beating, but everyone was fooled. Cao Cao's spies reported this incident and thus it became believable that Huang Gai's defection was real. When the time came for Huang Gai's defection, he sailed over to Cao Cao's fleet with small boats filled with flammable material. By the time Cao Cao realized it was a trick, it was too late. Huang Gai set the boats aflame and the fire spread throughout Cao Cao's army. Thus Cao Cao suffered the greatest defeat in his career.\n\n\n\n2. Cause of death - After the battle of Red Cliffs, there was a break out of robbers at Chang Sha 长沙. Sun Quan delegated Huang Gai to settle the matter but Huang Gai died of illness before the mission was accomplished.\n\nFAQ and Disambiguation\n\n1. Can Huang Gai use his ability between Duel with another character ?\n\nAns: No. His ability cannot be used ''in-between'' cards meaning from beginning to end of Duel , his ability cannot be used.\n\n\n2. Can he use this with one health remaining? Like use it then immediately Peach himself after?\n\nAns: Yes he can, but he must be saved from brink of death before he can draw the cards.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǚ-méng-吕蒙","name":"Lǚ Méng 吕蒙","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFA8_FZGskg3ypKvREVXzB1T6BtimVrQo8Wbnrci3Jz3eLF_SlWkGqExo5CFsg-raAtzJ9BajeAdoDro2hN5fvE0Pj1lc6VgkQsGoWtP8RUTFnn8pD-87K8jfmKNtPP7pYqmqBYrTzelaD/s320/wulumeng.jpg","text":"\nTranslated description:\n\n\"Crossing the river in White Robes 白衣渡江 (bái yī dù jiāng)\"\n\n\nWikipedia link: Lu Meng Wiki\n\n\n\nWho is he:\n\nOne of the most prominent generals from the Kingdom of Sun Wu 孙吴, Lu Meng started out as a military general with scant knowledge of tactics and strategy. Following his rising appointments in the Wu Kingdom, Sun Quan 孙权 himself advised Lu Meng to read in his spare time. Lu Meng wisely did so and his wisdom and knowledge made great leaps in a very short time. So impressive was his improvement, in fact, that Sun Quan's able advisor Lu Su 鲁肃 commented the famous phrase:\n\n\n\n\"When the clueless Lu Meng is under Wu Kingdom's nurturing, one must re-evaluate him in a different light. 吴下阿蒙, 刮目相看\"\n\n\n\n\nCharacter ability: \"Self-Mastery 克己 (kè jǐ)\"\n\nIf you did not use any ATTACK 杀 cards during your action phase, you can skip the discard phase.\n\n(This means he need not discard any cards despite having more cards than he has health units. Note that the use of ATTACK outside of his turn (such as in response to BARBARIANS 南蛮入侵) does not require him to discard his cards either.)\n\n\n\nAbility's relation to story:\n\nThere appears to be two possible links for \"Self-Mastery\" to the story. This first is philosophical, where Lu Meng's diligence in his studies is a result of being able to master his time management and overcome his procrastination. He once complained to Sun Quan that he did not have time to read, but Sun Quan aptly replied that himself is busier than Lu Meng yet he can find the time to read. \n\n\n\nThe second is directly related to the game ability. As displayed in the translated description, Lu Meng crossed a river in white robes for the purpose of deceiving Guan Yu 关羽's troops. Lu Meng's troops hid their weapons and pretended to be merchants (who were dressed in white in those days). Only at the last moment did they break their cover and surprise the enemy. This is indeed very similar to Lu Meng's game character! Always undercover and nondescript, but when he explodes he can be extremely lethal.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Defeating Guan Yu. One of the key reasons for Guan Yu's defeat was Lu Meng's capture of Jing Zhou 荆州. Lu Meng subsequently treated the citizens of Jing Zhou extremely well, leading to Guan Yu's troops (mainly recruited from Jing Zhou) to desert Guan Yu and return home. With a depleting army, Guan Yu escaped to Mai Cheng 麦城 and was ultimately captured and executed by Sun Quan.\n\n\n\n2. Cause of death - Guan Yu's death did not mark the end of Guan Yu. Instead the ghost of Guan Yu possessed Lu Meng at a celebratory banquet thrown by Sun Quan. At the banquet, the possessed Lu Meng grabbed hold of Sun Quan and swore revenge. Lu Meng then collapsed and died. This story ultimately spawned the Demi-God Guan Yu 神关羽 character.\n\nFAQ and Disambiguation\n\n1. When Lu Meng uses ATTACK in a  DUEL, does he need to discard cards after that to his health level?\n\nAns: That depends on when the DUEL card was used.\n\n1. If Duel is used within Lu Meng's turn (ie. Lu Meng is the one who use the DUEL card), and he uses an ATTACK card during the DUEL process, he will need to discard cards at the end of that turn)\n\nNote the following 2 scenarios where Lu Meng's use of  Duel will not need discarding of cards:\n\n(A) If the victim of Lu Meng's Duel does not respond to the Duel with an attack . Instead the victim chooses to suffer damage immediately.\n\n(B) The victim responds with an attack but Lu Meng chooses not to respond with an attack. In this case, Lu Meng suffers damage.\n\nIn both Scenarios(A) and (B) , Lu Meng does not use an Attack  card and therefore need not discard at the discard phase.\n\n2. If the Duel is used outside of Lu Meng's turn (such as he is now the victim of Duel by another player ), Lu Meng does not need to discard cards even if he responds with attack.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lù-xùn-陆逊","name":"Lù Xùn 陆逊","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi6V41AC5FHLlaj87rL3gnYpbgIIjS__JxAuDC8Y16w0rjkjyRBiNRiTdzfmZvKga3PP5mPCUL9TdifVDN9oCTPAcFIL_OlfmbAgJ0kuodUqa94uXdsmK9N7D7Qguqo_zQ6DHMVpoConR1l/s320/wuluxun.jpg","text":"\nTranslated description:\n\n\"The meek scholar with Valiant talents 儒生雄才 (rú shēng xióng cái)\"\n\n\nWikipedia link: Lu Xun Wiki\n\n\n\nWho is he:\n\nThe ultimate Decepticon. An idiom that describes him best would be \"don't judge a book by it's cover\". For the readers unfamiliar with the story, this geeky, nerdy scholar that looks like he cannot survive a papercut is the person who is responsible for the death of Liu Bei 刘备. He used his scholarly persona to trick his enemies into putting their guard down. This was used to great effect in Sun Wu 孙吴's capture of Jing Zhou 荆州, which resulted in the death of Guan Yu 关羽. Two of the biggest names in the Kingdom of Shu Han 蜀汉 owe their demise to this kid. Geeks rule!\n\n\n\n\nCharacter ability 1: [Enforced ability] \"Humility 谦逊 (qiān xùn)\"\n\nYou cannot become the target of STEAL 顺手牵羊 and ACEDIA 乐不思蜀. \n\n\n\nNote that this is different from those tools being \"ineffective\". Lu Xun simply cannot be targeted at all for these two tools. Therefore if you accidentally used these cards on Lu Xun, take it back into your hand and use it on someone else. Do not discard them since you are not considered to have even used them at all.\n\n\n\nCharacter ability 2: \"One after another 连营 (lián yíng)\"\n\nWhenever you lose or use your last on-hand card, you can immediately draw one card from the deck.\n\n(This means Lu Xun will always have at least one card on hand at all times.)\n\n\n\nAbility's relation to story:\n\n\"Humility\" describes Lu Xun's careful management of his troops and his unwavering focus on defeating Shu Han. I suppose that the reason he cannot be targeted for STEAL is to imply the opposite of a careless, arrogant leader. As for ACEDIA, it made sense that he cannot be targeted since Lu Xun's patience and focus on defeating Shu Han clearly destroys the meaning of that tool. \n\n\n\n\"One after another\" describes Lu Xun's victory at the battle of Yi Ling 夷陵之战, where his use of fire to incinerate Liu Bei's forces is compounded by Liu Bei's decision to have all his camps close to each other and within the forested region. The words 连营 is a short-form of the full phrase 火烧连营七百里, which means \"the burning of a string of camps connected together for 350km\".\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Defeating Liu Bei at battle of Yi Ling. After a stalemate, Liu Bei taunted Lu Xun to lure his troops into an ambush. Typical of the humble man that he is, Lu Xun kept his cool and ignored the taunting. Lu Xun knew it was not yet time for the attack. Liu Bei finally gave up and the stalemate continued, but the weather was very hot and dry. Liu Bei made the decision to move all the camps into the forest for some shade. Lu Xun siezed the opportunity and set fire to the dry forests. The blaze burned most of Liu Bei's troops and supplies while their escape route was cut off. Liu Bei suffered severe losses and retreated. He never recovered from the loss and died soon after.\n\n\n\n2. Cause of death - Lu Xun fell into disfavour of Sun Quan due to his support for Sun He 孙和 as crown prince. Sun Quan removed Lu Xun from office and had him reprimanded on many counts. Lu Xun was filled with grief and fell ill. He died soon after.\n\nFAQ and Disambiguation\n\n1. Can Lu Xun (or any character for that matter) choose to discard cards during his turn? If so, his turn would never end, so Im assuming the answer is no.\n\nAns: The answer is no. Discarding of cards can only take place in the discard phase. Once in that phase, the player can no longer use cards.The turn ends after the discard phase.\n\n\n2. Does this mean that you can only ever discard on-hand cards without using them when you need to discard to your current health at the end of your turn? Could you choose to discard more than that?\n\nAns: Yes a player can only discard cards that the end of the turn (discard phase) and only if there are more cards on-hand  than there is health. A player cannot discard more than that .\n\n\n3. If Lu Xun uses Draw 2 and its his last card, does he draw 3 cards . One for his abilty and 2 for the Draw 2?\n\nAns: Yes he draws 3 cards.\n\n\n4. For Iron Shackles, if he chooses to discard Iron Shackles as his last card ,does he get to draw 2 cards ? One for the shackles and one for his ability.\n\nAns: Yes if he uses redraw for Iron Shackles, he draws 2.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"sūn-shàng-xiāng-孙尚香","name":"Sūn Shàng Xiāng 孙尚香","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiot2o4y7D-wGfVIYfv_U_sxTIkjLPrhNR5XUEclxiLeBWrz7NoHUeGoSc8-Y9xvKf2rkUmeA4KS5ek9_ptFJ3JE9whcra4cEhBWzuPRK5AaNYUs2GQki2o5FtGptYQgGev3p7WFaI08H_p/s320/wusunshangxiang.jpg","text":"\nTranslated description:\n\n\"The lady with bow and arrows 弓腰姬 (gōng yāo jī)\"\n\n\nWikipedia link: Sun Shang Xiang Wiki\n\n\n\nWho is she:\n\nBest remembered as the martial-arts loving wife of Liu Bei 刘备, Sun Shang Xiang is the younger sister of Sun Quan 孙权. Since young she loved martial arts and even has all her maids carry swords wherever they go. She was offered to Liu Bei as his third wife by Sun Quan and on the surface it appeared to be a strengthening of the Sun Wu 孙吴 and Shu Han 蜀汉 alliance. The reality, however, was the marriage offer was a trap plotted out by Zhou Yu 周瑜 to lure Liu Bei into the Kingdom of Sun Wu and hold him ransom in return for Jing Zhou 荆州. Yet in one of the most lauded schemes of Zhu Ge Liang 诸葛亮, Liu Bei not only successfully marries Sun Shang Xiang but also escapes back to Shu Han with her. In his rage, Zhou Yu orders his troops to kill Liu Bei even if it means having to kill Sun Shang Xiang, but the chase met with an ambush from Zhu Ge Liang and Zhou Yu ends up losing both Sun Shang Xiang and thousands of troops. \n\n\n\nThus the famous saying: \"To lose a lady in addition to losing numerous troops 赔了夫人又折兵\"\n\n\n\n\nCharacter ability 1: \"Marriage 结姻 (jié yīn)\"\n\nDuring your action phase, you can choose to discard 2 on-hand cards and pick any male character that is not at full-health. By doing so, both the male character and yourself will recover 1 unit of health each. Limited to only 1 use per turn.\n\n\n\nCharacter ability 2: \"Warrior Lady 枭姬 (xiāo jī)\"\n\nWhenever any equipped card is removed from your equipped items area, you can immediately draw 2 cards from the deck.\n\n(Note that 2 cards can be drawn for each equipped card that is removed. This applies also to changing the equipped item (ie: replacing one weapon with another weapon).\n\n\n\nAbility's relation to story:\n\n\"Marriage\" is, of course, referring to her marriage with Liu Bei. The inside joke is this ability is commonly scandalized into \"Intercourse\" and since it can be used with ANY male character, she has become a slut of sorts. It does not help that her character art gave her a pair of huge jugs spilling out of her top. \"Warrior lady\" refers to her love for martial arts, but little connection is made with the mechanics of the ability with the storyline.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Her \"escape\" back to Sun Wu. In another ploy, Sun Shang Xiang was tricked into believing her aging mother was very ill. At the time, Liu Bei was away conquering the Western regions near Cheng Du 成都. She decided to leave for Sun Wu and bring with her Liu Bei's son, Liu Shan 刘禅. This threw up a huge fracas as Zhao Yun 赵云 and Zhang Fei 张飞 braved enemy arrows to convince her to return. Alas, Sun Shang Xiang would not listen, but relented in returning Liu Shan. Upon finding out it was a ploy, Sun Shang Xiang was extremely upset. She never got to see Liu Bei again.\n\n\n\n2. Cause of death - Legend has it that Sun Shang Xiang committed suicide after hearing about Liu Bei's death. She threw herself into a river and drowned herself.\n\nFAQ and Disambiguation\n\n1. What if Sun Shang Xiang is not at full health, but all the male characters are at full health, can she still use her healing abilities?\n\nAns: No she cannot.It must be with a male who is not at full health.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhōu-yú-周瑜","name":"Zhōu Yú 周瑜","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvjFpIT6mWgL9yEPOx-t6HLKrtVJDDfSeu5IERZyFvNpr_RsxpsCConiGoVHqMXG0fVvXNTa5Gvciz-gUU0TAlqQkWFZzGu2_BS0uzBv-T_krFf-bQAS6HGLMdAd76XwtIRIc8sCz5RSgU/s320/wuzhouyu.jpg","text":"\nTranslated description:\n\n\"Supreme Commander-in-Chief 大都督 (dà dū dū)\"\n\n\nWikipedia link: Zhou Yu Wiki\n\n\n\nWho is he:\n\nNicknamed \"Zhou Yu the Fair\" for his good looks, Zhou Yu was the most famous of all Sun Wu 孙吴's advisors. Both a military general and a strategist, he became Sun Quan 孙权's able right-hand man and was the brains behind the battle of Red Cliffs 赤壁之战. Unfortunately for him, Zhu Ge Liang 诸葛亮 is just too incredibly clever. Despite coming up with schemes to rid Zhu Ge Liang, Zhou Yu simply cannot outsmart the unrealistically intelligent Zhu Ge Liang. The story seems to downplay Zhou Yu's achievements and make him seem second class and inferior to Zhu Ge Liang. Yet Zhou Yu's contribution to Cao Cao 曹操's defeat at Red Cliffs is incredibly significant and has guaranteed him a place both in the history books and in semi-fictional accounts of the era.\n\n\nCharacter ability 1: \"Dashing Hero 英姿 (yīng zī)\"\n\nYou can draw 1 additional card during your drawing phase.\n\n(This means he can draw 3 cards from the deck instead of 2 at every turn.)\n\n\n\nCharacter ability 2: \"Sow Dissension 反间 (fǎn jiàn)\"\n\nDuring the action phase, you can ask any one player to guess a suit (eg: hearts, diamonds, clubs or spades). This player while then have to pick one of your  on-hand cards and show it to everyone. If the selected card has the same suit as that which the player guessed, nothing happens. If it is not the same suit, the player loses one unit of health. Regardless of the result, the player will always get to keep that card which he or she picked. Limited to one use per turn.\n\n\n\nDisambiguation:\n\n1. Can a player refuse or use NEGATE 无懈可击 when \"Sow Dissension\" is directed at him or her?\n\n\n\nAns: No. There is no escaping this ability! The player targeted MUST pick one of Zhou Yu's on-hand cards and keep it. \n\n\n\n2. What if the target player only has 1 unit of health left and guessed the wrong suit, but the card picked happens to be PEACH 桃 or WINE 酒? Can this card be used to save himself or herself?\n\n\n\n[Updated Feb 2011] Ans: No. The player must be saved from the brink of death first before being able to take possession of the card. \n\n\n\n3. What if the player targeted is using Xiao Qiao and she guesses \"hearts\", but picked a \"spades\" card? Does her ability \"Youthful Beauty\" apply such that the \"spade\" becomes viewed as a \"heart\"?\n\n\n\nAns: Yes her ability applies. Thus if Xiao Qiao picks \"hearts\", she has a far higher chance of escaping damage since both \"spades\" and \"hearts\" will save her. This may have been a planned consequence by the game makers since Xiao Qiao and Zhou Yu are a couple.\n\n\n\nAbility's relation to story:\n\nOk although history states that Zhou Yu was a handsome young man, but I don't see why he should get to draw 3 cards for being good-looking. So I'm bullsh*tting any connection this has to the story. \n\n\n\n\"Sow Dissension\" is comes from a significant event leading up to the battle at Red Cliffs, where Cao Cao is tricked by Zhou Yu into executing the only 2 generals with experience at naval combat, Cai Mao 蔡帽 and Zhang Yun 张允. Unfortunately, that too has nothing to do with how the ability is played in the card game.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Defeating Cao Cao at Red Cliffs. Zhou Yu used a series of ploys to completely fuddle Cao Cao, all of which ran concurrently. These include getting Pang Tong 庞统 to trick Cao Cao into shackling his ships together, getting Huang Gai 黄盖 to feint defection so as to set the ships ablaze, making use of Jiang Gan 将干 to sow dissension between Cao Cao and his navy generals Cai Mao and Zhang Yun. \n\n\n\n2. Cause of death - One of the most famous episodes in the story talks about Zhu Ge Liang \"frustrating Zhou Yu 3 times\". Zhou Yu was completely outwitted by Zhu Ge Liang and loss troops, Sun Quan's sister Sun Shang Xiang, as well as important nodes such as Nan Jun 南郡 and Jing Zhou 荆州. Zhou Yu literally vomited blood and died of frustration. Historical records, however, showed that Zhou Yu died while preparing for a battle, thus rendering the storyline as dramatization.\n\n\nFAQ and Disambiguation\n\n1. Can Zhou Yu use '' Sow Dissension 反间'' if he has no on hand cards?\n\nAns: No he cannot. He needs to at least have 1 card in hand to use that ability.\n\n\n2. What if the target player only has 1 unit of health left and guessed the wrong suit , but the card picked happens to be PEACH 桃 or WINE酒 ? can this card be use to save himself  or herself?\n\nAns: No. Death is always calculated first. Since the victim takes damage first he does not obtain the card until after someone heals him. Also if he does die from the ability  the card chosen remains with Zhou Yu\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"tài-shǐ-cí-太史慈","name":"Tài Shǐ Cí 太史慈","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh03XwGAqpHPyn_WffWi74JKmxaEf-wz2-NqwbONTGRXGOhynRmOEnvSfnM4_9tfUscS67DI5Wr7zstY365yu3N4o234_SPQOs6RmlfYsUI21EUVNpckLPtPoRHQtBWol3wmbU1atNOPdLy/s320/wutaishici.jpg","text":"\nTranslated description:\n\n\"Ardent and Loyal Warrior 笃烈之士 (dǔ liè zhī shì)\"\n\n\nWikipedia link: Tai Shi Ci Wiki\n\n\n\nWho is he:\n\nOne of the early generals before the Three Kingdoms were formed, Tai Shi Ci was one of Sun Ce 孙策's most capable generals. A man with a criminal past, Tai Shi Ci was denied higher positions and responsibilities by his previous leader Liu Yao 刘繇. In one instance, Tai Shi Ci battled Sun Ce and were equally matched. This gave Sun Ce respect for Tai Shi Ci. When Sun Ce eventually defeated Liu Yao, Sun Ce promised Tai Shi Ci acknowledgement of his capabilities with important positions. Tai Shi Ci accepted and thus became a loyal and capable general under the Kingdom of Sun Wu 孙吴 till his death.\n\n\n\n\nCharacter ability: \"Justice of Heaven 天义 (tiān yì)\"\n\nDuring your action phase, you can conduct Points Duel 拼点 with any other character. Limited to one use per turn.\n\n\n\nIf you win the Points Duel - \n\n1. You will have unlimited attacking range\n\n2. You can use 1 additional ATTACK 杀 card in that turn\n\n3. Each ATTACK can target 1 additional character.\n\n\n\nIf you lose the Points Duel, you cannot use ATTACK till the end of that turn.\n\n\n\nAbility's relation to story:\n\nThere does not seem to be much relation to the story, though there is some history to how this ability came about. Before the Fire Expansion Pack 火包 was released by Yoka Games, people have already created their own Tai Shi Ci character which allowed him to equip two weapons simultaneously. I guess Yoka Games took note of that and modified it into the ability we see today.\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Rallying his troops to join Sun Ce within 24 hours. When Tai Shi Ci agreed to join Sun Ce, he asked Sun Ce for one day's absence to convince his troops to continue joining him under Sun Ce's leadership. Sun Ce note only agreed, he even told Tai Shi Ci to tell his troops that those not willing were free to leave and will not be subjected to martial law. Sun Ce's advisors told him to be wary of Tai Shi Ci taking the opportunity to escape, but Sun Ce had faith in Tai Shi Ci's integrity. Indeed, Tai Shi Ci kept to his word, returning within 24 hours and bringing with him every single one of his men to join Sun Ce.\n\n\n\n2. Cause of death - In the story, Tai Shi Ci was fatally wounded by an arrow from Cao Wei 曹魏's Zhang Liao 张辽 at the battle of He Fei 合肥之战. However, historically Tai Shi Ci died of illness at age 41. \n\nFAQ and Disambiguation\n\n1. What do you mean by Points Duel 拼点?\n\nAns: You can refer to ''How to play'' Part 5 Points Duel'' on the left column for more details.\n\n2. For Points Duel, if Tai Shi Chi wins, does he get all the 3 effects or just one of them ?\n\nAns: He gets all 3 effects .\n\n3. If Tai Shi Chi has Heaven Scorcher Halbert equipped and he wins the points duel , does that mean his last ATTACK can kill up to 5 people? 3 from weapon , 3 from his ability?\n\nAns: Not 5 but 4. Here's how its calculated.\n\nAfter winning points duel, every one of his ATTACK can target 1 additional player. Therefore if his ATTACK is his last card and he has Heaven Scorcher, usually he can target 3 players but now +1 more player to that ..so total 4 players can be targeted with that one last ATTACK card.\n\n\n4. Can he attack then point want? Because that would allow him to bypass the effect of '' Cannot use attack at all for that turn''.\n\nAns: Yes he can use ATTACK first before Points Duel. It would allow him to use at least 1 attack in that round. BUT that first attack would just be a normal attack , targeting only 1 player.\n\nIn Summary,\n\nUse Attack before Points Duel\nPros: Guaranteed at least 1 attack use\nCons: Effective attacks used is limited to 3.\n\nUse Points Duel before Attack\nPros: Effective attacks used =4\nCons: May not be able to use attack at all if lose the points duel.\n\n\n5. Can Tai Shi Chi use jiu sha( attack + wine ) after winning the points duel to cause 2 damage to 2 different players or can this only be used without wine ?\n\nAns: Yes ,wine can be use with the attacks even after winning the points duel.\n\n\n6. Does his ability stack with the effect of weapons ? For example , if Tai Shi Ci equips a Zhu Ge Crossbow , does that mean he has unlimited numbers of  attacks , each attacking 2 players.\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xiǎo-qiáo-小乔","name":"Xiǎo Qiáo 小乔","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhO-RLgy17aw4ZYG9j7AzxxnhJynrnAz4xv2FWMoG9wbKbduJ5YTNAyqp2-_we99xwZYWy-v7VX4c4AAl9wM1JKAiIIeJdSBWn5gO-mEghLp5hPwLBdEOhbaHfgl0nIittmLU56CakKscp5/s320/wuxiaoqiao.jpg","text":"\nTranslated description:\n\n\"The Unconventional Flower 矫情之花 (jiǎo qíng zhī huā)\"\n\n\nWikipedia link: Xiao Qiao Wiki\n\n\n\nWho is she:\n\nWife of Zhou Yu 周瑜 and younger sister of Da Qiao 大乔, Xiao Qiao is the starry-eyed girl next door famous for her musical talent. As explained in my post on Da Qiao, the two sisters were one of the major reasons for the Kingdom of Sun Wu 孙吴 going to war with the Kingdom of Cao Wei 曹魏, which quickly resulted in the battle of Red Cliffs 赤壁之战. Xiao Qiao was notably more vocal and expressive than her aloof elder sister, thus it seemed like Xiao Qiao was the more musically talented of the two, but it has been argued that Da Qiao is equally skilled in music and just chooses to play only for her beau Sun Ce 孙策. \n\n\n\n\nCharacter ability 1: \"Heavenly Scent 天香 (tiān xiāng)\"\n\nWhenever you receive any damage, you can choose to pass the damage on to any other player by discarding an on-hand card that has a suit of \"hearts\". The victim that receives the damage gets to draw X number of cards from the deck, X being the total amount of health loss (measured from the character's maximum health level) after the deflection.\n\n(Xiao Qiao is left unscathed once the damage is passed to another player. For example, Xiao Qiao receives 2 units of damage and she discards ONE on-hand card of \"hearts\" suit to pass the damage on to Zhang Fei 张飞 (who currently has 2 units of health left with a maximum health of 4). Zhang Fei loses 2 units of health due to damage passed by Xiao Qiao, however he does not get to draw 4 cards (Max health = 4, subtract current health = 0, equals 4 cards to draw) until he has been rescued from the brink of death.)\n\n\n\nCharacter ability 2: [Enforced ability] \"Youthful Beauty 红颜 (hóng yán)\"\n\nYou will always regard all cards with a suit of \"spades\" as the suit of \"hearts\".\n\n\n\nThis effectively means that her \"Heavenly Scent\" ability will also work if she discards a \"spade\" since it is regarded as a \"heart\". This also means that LIGHTNING will NEVER strike her since she is the one that conducts the judgement for LIGHTNING and it requires \"spades\" to strike. An additional bonus is that she has a stronger chance of overcoming ACEDIA since judgement card of \"spades\" will equal to \"hearts\". \n\n\n\nAbility's relation to story:\n\nNeither of her abilities have any link to the story. Despite her \"Heavenly Scent\" being horrifyingly powerful, there is just no mention in the story about anything related to her scent doing demonic damage. \n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Marrying the brilliant Zhou Yu. I know it sounds derogatory to say that marrying someone of stature is an \"achievement\", but she would probably have been viewed upon with envy in her time. Besides, there really isn't much material I can work with here.\n\n\n\n2. Cause of death - Unknown. Conflicting stories mixed with contaminated legends have churned out an array of different endings for Xiao Qiao. The two most common are \"grieving for Zhou Yu till she died of old age\" and \"dying of illness\".\n\n\nFAQ and Disambiguation\n\n1. Who can Xiao Qiao deflect damage to?\n\nAns: Xiao Qiao can deflect damage to anyone including the attacker.\n\n\n2. Since all spade cards count as hearts for Xiao Qiao , When she flips a judgement could Si Ma Yi substitute with a spade to hurt her?\n\nAns: No it cannot hurt her even if the judgement card is changed. The reasoning is the same as Zhang Jiao's lightning strike: the judgement card is considered as flipped by Xiao Qiao . Even if it was changed, it is still viewed as Xiao Qiao's judgement card .Hence spades will be viewed as hearts even if changed by Si Ma Yi.\n\n\n3. If I equip Frost Blade  寒冰剑 and attack Xiao Qiao, what happens if she redirect the damage?\n\nAns: You can choose not to deal with her damage , in which case she can no longer redirect the damage. She would thus be forced to discard cards . This is one of the critical ways to disarm her. The weapon (Frost blade) works very well against her.\n\n\n4. Who is the source of damage when it is passed on , Xiao Qiao or the player who dealt damage to her?\n\nAns: The player who dealt the damage. All retalliation/rewards goes back to the player who use the cards and not Xiao Qiao.\neg:\n\n- Ruler attacks Xiao Qiao and she passes damage to Loyalist . Loyalist dies = Ruler discard all cards and equipment.\n-Ruler attacks Xiao Qiao and she passes to Rebel . Rebel dies =Ruler gains 3 cards rewards.\n\n\n5. Can Xiao Qiao detect /redirect Barbarians/Raining Arrows/Duel?\n\nAns: Yes and No\nNo: She cannot deflect the effect of these cards unto another player . Meaning she cannot ''deflect'' Barbarians and ask another player to use ATTACK to neutralize the card.\n\nYes: She can deflect the damage she suffers if she DOES NOT neutralize the card. Meaning , if someone uses Barbarians and she chooses not to use  ATTACK ,she sufferes 1 damage . She can transfer the damage to another player . That victim receive the damage straight-up , can no longer use the ATTACK to neutralize the card  because what is transferred is Damage  and not the card effect.\n\n\n6. If Xiao Qiao is challenged with someone who cannot be avoided such as Huang Xhong or Ma Chao , can she deflect the injury?\n\nAns: Yes. It does not matter if the attack can be avoided. She transfers damage that she receives which mean the attack is already concluded by that point.\n\n\n7. If Xiao Qiao is locked in Iron Shackles and receives the fire damage , does the damage travel through the chains when she uses her power ?\n i.e Does she get hurt before she is able to pass the damage and then return to health , or does she never receive the damage at all  ?\n\nAns: Xiao Qiao can only pass the damage on AFTER receiving damage. Thus it is logical to say that the fire attack is channeled to the relevant victims already.\n\n\n8. If Zhang Fei is at 1 health and Xiao Qiao deflects 2 units of damage to Zhang Fei , and Zhang Fei is peached 2 times , woul that mean he is able to draw 5 cards?\n\nAns: No there is no concept of negative health in SGS. Even for  Zhou Tai , he is considered at zero health regardless of how many death cards he has. Thus the max number of cards to draw would be the max health of the victim, and no more.\n\n\n9. If Xiao Qiao redirect the damage to another shackled player, would the shackled player receive the deflected damage + the transmitted damage from the initial attack?''\n\nAns: Yes. This unfortunate player would receive both damages.\n\n\n10. Only Da Qiao can enter the ''initial target'' status for Iron Shackling right? Where as if Xiao Qiao is the initial target, she can't alter the initial target?\n\nAns: Yes, Da Qiao can enter the initial target, Xiao Qiao cannot.\n\n\n11. If I am playing as Xiao Qiao and I am linked with IRON SHACKLES to another player who is the target  of Fire Attack ; can I loop the damage of the fire element back to the original target multiple times as long as I have the hearts cards to play?\n\nAns: You can deflect the damage you receive that was passed by the shackles. But that will only happen once , because the shackles will be broken. You can deflect infinite number of times , as long as you have the hearts or spades . Just that for the shackles,it breaks after each transmit\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhōu-tài-周泰","name":"Zhōu Tài 周泰","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikYTTFaLHoBb06v7QpAALqPs9Nf3dEWX_K-vzl9oRApj9tieq2qZLzNwdLS4FPH2bL0C7EWchn-Kwn9wMa1cA83PBMpXCe68wPlY_sLdaZvbit29IERGW89DM1bPWnIfTKC69kkNNSIl-a/s320/wuzhoutai.jpg","text":"\nTranslated description:\n\n\"Body scarred like a Battle record 历战之躯 (lì zhàn zhī qū)\"\n\n\nWikipedia link: Zhou Tai Wiki\n\n\n\nWho is he:\n\nIf there was a commando spirit in any of the Three Kingdoms characters, it would be Zhou Tai. If I had my way, I would rewrite his description as \"Never say die\". He began his military career as a pirate-convert under Sun Ce 孙策, but Sun Quan 孙权 quickly took a liking and requested Zhou Tai be transfered over to his command. It was from then on that Zhou Tai would save Sun Quan's ass many times from certain death. In one significant scenario in the story, Sun Quan asked Zhou Tai to remove his clothing during a banquet and show his battle scars for all those present. Zhou Tai remembers the battle behind every scar, most of which he earned valiantly serving the cause of the Sun Quan's Wu Kingdom. It is thus that Sun Quan treats Zhou Tai as one of his most trusted and capable generals, as kin as a brother to him.\n\n\n\n\nCharacter ability: \"Refuting Death 不屈 (bù qū)\"\n\nWhen your health reaches zero (brink of death), one playing card must be flipped from the deck and placed on your character card. You not considered dead at this point and the game continues. Whenever you lose an additional unit of health from here on, an additional card will be further added on top of your character card. As long as none of these cards have the same \"number\" (ie: from ace to king), you will remain alive. Whenever there is a card or more placed on your character card, you will always be considered as being on the \"brink of death\".\n\n\n\nDisambiguation:\n\n1. Can the card displayed after Zhou Tai's health reaches zero be \"tinkered\" with by Si Ma Yi 司马懿 or Zhang Jiao 张角?\n\n\n\nAns: No. It is not a judgement card and cannot be changed by these 2 characters.\n\n\n[Added Feb 2011] 2. Can other players use PEACH 桃 on Zhou Tai when he has \"brink-of-death\" cards displayed?\n\nAns: Only under specific circumstances. Other players can only use PEACH on Zhou Tai when:\n(a) When Zhou Tai receives damage\n(b) Right after a \"brink-of-death\" card is flipped.\n\n\n\n3. What happens when another \"brink-of-death\" card has a number that matches one of the other cards already displayed?\n\n\n\n[Updated Feb 2011] Ans: Zhou Tai DOES NOT die immediately. Instead the other players have the option of using PEACH to save him, or he can use PEACH or WINE 酒. Once saved, the most recent \"brink-of-death\" card can be discarded.\n\n\n[Added Feb 2011] 4. Can Zhou Tai use PEACH or WINE in his turn to remove \"brink-of-death\" cards, even though he did not receive damage?\n\nAns: Yes. \n\n\n\n5. What is the largest number of health units that Zhou Tai can have in total before he dies?\n\n\n\nAns: 16!! 3 units of health deducted the normal way plus a possible 13 different cards can be displayed without any repeating number.\n\n\n\nAbility's relation to story:\n\nHis ability \"Refuting Death\" is a wonderful match from the story! Many times Zhou Tai risked life and limb to save Sun Quan, each time getting injured and cut up but he survives! This ability is a tribute to the Zhou Tai that \"never says die\".\n\n\n\nAdditional info based on story:\n\n1. Most famous achievement - Immense bravery in rescuing Sun Quan at the battle of Ru Xu Kou 濡须口之战. Upon the failure of Sun Quan's attack, he found himself surrounded by enemy troops. Zhou Tai had already dashed to safety, but seeing that Sun Quan was nowhere to be seen, dashed into the chaos of battle once again. He told Sun Quan to follow behind as he slashed a path out to safety. Yet Sun Quan was once again surrounded very quickly and all seemed lost. Zhou Tai dashed into battle a second time, but this time the enemy was raining arrows on them. Zhou Tai told Sun Quan to dash straight out to safety as he covered to rear this time. They succeeded but Zhou Tai was injured in numerous places in his body. But that wasn't the end. After Sun Quan was safe, he dashed into the chaos a third time to rescue Xu Sheng 徐盛 successfully.\n\n\n\n2. Cause of death - Zhou Tai died of illness at an old-age. It is estimated that he was 62 years old at the time of his death.  \n\nFAQ and Disambiguation\n\n1. How is Peach and  Wine  at the ''brink of death mode'' effective?\n\nAns: Using PEACH or WINE at the ''brink of death'' mode will let him remove one ''brink of death'' card each.\n\n\n2. Can Zhou Tai keep his on-hand cards if his health is zero?\n\nAns: No,he cannot keep any on-hand cards whatsoever.He must use all of his cards or discard them all.\n\n\n3.Does Zhou Tai have to remove all equipped cards(like weapons,horses,and armor)when he is on the brink of death?\n\nAns:No he does not. He can keep all his equipped items. The only penalty for being on the brink is he cannot hold any cards in hand at the end of the turn.\n\n\n4.Does he die immediately when 2 brink-of-death cards have the same suit.\n\nAns:Yes.He dies immediately.\n\n\n5.If Xiao Qiao deflects to Zhou Tai, does he draw brink-of-death cards or Xiao Qiao's ability cards first?\n\nAns:Xiao Qiao's victim will only draw the cards after every other issue has been concluded.For eg: if a player becomes zero life, the player must be rescued first before drawing the cards.\n\nFor Zhou Tai's case, the \"death card\" must be flipped first before he can draw the cards from Xiao Qiao's ability.\n\n\n6.When Zhou Tai is on the brink of death can others heal him with peaches on their turns?\n\nAns: Yes. any player can heal him during their turns.Each heal will remove one of the 'death cards\" from Zhou Tai.\n\n\n7.If Zhou Tai's health is at -5 (5 brinks of death cards),now when Xiao Qiao receives 1 damage and uses her Deflecting damage ability to Zhou Tai (therefore 6 brink of death cards), does he get to draw 10 cards(6 brinks of death cards +  4 health unit)?\n\nAns:Unfortunately, NO. He can only draw up to maximum 4 cards. Although it appears that he has \"negative health\" but in actual fact his heath just remains at zero and he is being sustained by his ability. Therefore he can only draw up to 4 cards.\n\n\n8.Does anything happens to Zhou Tai's \"death cards\" when his character card is flipped by Cao Pi?\n\nAns: Nothing happens to his \"death cards\" when he is flipped. His ability still works. The only difference is he skips turn.\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"sūn-jiān-孙坚","name":"Sūn Jiān 孙坚","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh6spGZ9fWQnZnbk4FW_a5CD7YWMkS7wJxI7AD8xk0QJ-BcWtqY2lstTNN91zpw4xBIB6xHOD7BMPBjBCeFKV4M7RS84qsP-80-KKPZCoxZtBHoViF85IFxGkMwSuTND-8m0C_o3BNAzVBM/s320/wusunjian.jpg","text":"\n\n\nTranslated description:\n\"Emperor of Vigorous Combat 武烈帝 (wǔ liè dì)\"\n\nWikipedia link: Sun Jian Wiki\n\nWho is he:\nBest known as the father of Sun Ce 孙策, Sun Quan 孙权 and Sun Shang Xiang 孙尚香, Sun Jian was one of the warlords who took part in the early coalition against Dong Zhuo 董卓. In fact, Dong Zhuo and Sun Jian were bitter enemies even before Dong Zhuo took control of the imperial family. One significant event in the life of Sun Jian was finding the imperial seal in a well in the palace ruins at Luo Yang 洛阳. Sun Jian wanted to keep the seal for himself and, thus, control huge power within his grasps. Unfortunately for him, he was betrayed and Yuan Shao 袁绍, then the leader of the coalition, confronted Sun Jian. Sun Jian vehemently denied having the seal, but Yuan Shao was convinced he was lying. Yuan Shao sent Liu Biao 刘表 to intercept Sun Jian, and it was under Liu Biao that Sun Jian's life met an abrupt end.\n\nCharacter ability: \"Lingering Spirit 英魂 (yīng hún)\"\nIn the beginning of every turn, you can carry out either of the options listed below if you are not at maximum health (X represents the number of units of health you have lost thus far). Pick one other player to carry out one of the following options:\n\n1. Draw X cards, then discard 1 card.\n\n2. Draw 1 card, then discard X cards.\n\nLimited to one use per turn.\n\nAbility's relation to story:\nThe name \"Lingering Spirit\" should not be taken literally, but instead metaphorically describes Sun Jian's contribution to destroying Dong Zhuo. Being the first in the coalition of 18 warlords to attack Dong Zhuo, Sun Jian almost lost his life to Hua Xiong 华雄, but his initial strike was enough to cower Dong Zhuo and dampen his army's morale. Even after Sun Jian's death, the lessons learnt in his early attacks against Dong Zhuo served Dong Zhuo's enemies well. Thus there is a link to the ability with Sun Jian suffering damage first, yet able to leverage on that to assist his team mates or disconcert his opponents.\n\nAdditional info based on story:\n1. Most famous achievement - Giving the incompetent Yuan Shu 袁术 a piece of his mind. Yuan Shu knew that Sun Jian was to accomplish big things after the coalition disbanded, and thus sought to suppress him by denying him of supplies (Yuan Shu controlled the logistics of the coalition). Sun Jian told Yuan Shu that he spearheaded the coalition's attack not only to remove Dong Zhuo but also to avenge the Yuan family, and yet Yuan Shu chose not to aid him. Yuan Shu was deeply shamed after this \"scolding\" and promptly resumed supplies to Sun Jian.\n\n2. Cause of death - Killed in an ambush by Huang Zu 黄祖. After Liu Biao intercepted Sun Jian, Sun Jian managed to fend off Liu Biao and his general, Huang Zu. As Huang Zu retreated, Sun Jian gave chase but fell victim to an ambush where arrows shot out from all directions. Sun Jian was caught in the line of fire and died under fatal arrow wounds at the age of 36. When Sun Quan established the Kingdom of Sun Wu 孙吴, Sun Jian was posthumously given the title of \"Emperor of Vigorous Combat\".\n\n\n\nFAQ and Disambiguation\n\n1. How is the second option useful?\n\nAns: For the second, if he's at 1 health, he could force someone to draw a card and then discard three. It could potentially be very good to temporarily stop harassment or to set up for someone with an Ancient Scimitar or for offensive card characters like Zhang Fei or Huang Zhong.\n\n\n2. Does Sun Jian ability activate at the start of every player's turn? Or only his turn?\n\nAns: It is only activated at the start of Sun Jian's turn.\n\n\n3. If the target player does not have enough on-hand cards to discard ( less than X after drawing 1 card) , must this player also discard his equipment cards(if any)?\n\nAns: Yes the person will be forced to discard equipped cards if there are no  more on-hand cards.\n\n\n4. What if the targeted player has not enough cards (both on hand and equipped) to discard after draw one card ,(eg he has zero on hand and equipped card) ?\n\nAns: When the player has zero cards left , nothing further happens. Eg, the player only has 1 card . Sun Jian forces player to draw 1 ,discard 3 .The player draws 1 from the deck, then discard the 2 cards he now has to become zero. Though he needs to discard 1more , he does not need to owe that 1 card.\n\n\n5. Can Sun Jian use his abilities on himself?\n\nAns: No it must be used on another player.\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǔ-sù-鲁肃","name":"Lǔ Sù 鲁肃","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQYdYIvDtjA-6j8ik23psLtcS4drcmPTpLPHvca1wWdmX-qGX7bHE1re4CKVrC0nz_xA5TfOxKL-MKtoj4vc7j09eX8kFzoQmxcEt_ROIa-v4yV0fudrmFZMdudQiKvjdCUkyMb0T1OfGV/s320/wulusu.jpg","text":"\n\n\nTranslated description:\n\"The Maverick Diplomat 独断的外交家 (dú duàn dè wài jiāo jiā)\"\n\nWikipedia link: Lu Su Wiki\n\nWho is he:\nThe initiator of the Shu Han 蜀汉 Sun Wu 孙吴 alliance, Lu Su was the man who sought a merger with Liu Bei 刘备 to resist the marauding army of Cao Cao 曹操. Lu Su knew that the alliance was the only chance that both forces had of survival, and thankfully, so did Zhu Ge Liang 诸葛亮. Lu Su initiated contact with Zhu Ge Liang and brought him back to Sun Wu to convince Sun Quan 孙权 to fight Cao Cao. However Zhu Ge Liang's cunning was beyond Lu Su's ability to manage, and Zhu Ge Liang insulted all of Sun Quan's advisors, Zhou Yu 周瑜 and even Sun Quan himself, while still succeeding to form the alliance. The minor ruckus caused Lu Su significant stress, but he was relieved nonetheless that his objective was met. An able and loyal talent, Lu Su took over Zhou Yu's post after the latters death, but Lu Su made a mess of things when he vouched for Shu Han returning Jing Zhou 荆州 to Sun Wu. Liu Bei repeatedly procrastinated returning the strategically important Jing Zhou and the this quickly built tensions between the two kingdoms. The struggle for Jing Zhou eventually led to the fall-out of the allegiance and open war between the these two superpowers.\n\nCharacter ability 1: \"Altruism 好施 (hào shī)\"\nIn the drawing phase, you can choose to draw 2 more cards (total of 4 cards). If you have more than 5 on-hand cards as a result, you must give half of your on-hand cards (rounded down to a whole number) to the player with the least amount of on-hand cards (excluding yourself).\n\nCharacter ability 2: \"Alliance 缔盟 (dì méng)\"\nDuring your action phase, you can choose to force 2 players (other than yourself) to exchange their entire set of on-hand cards by discarding X number of cards, X being the difference between the number of on-hand cards between these 2 players. Limited to one use per turn.\n\nAbility's relation to story:\n\"Altruism\" has a very interesting link. In the story, Lu Su's charitable nature led to him \"lending\" Jing Zhou to Liu Bei, however Lu Su's altruistic nature goes much further than the story. The historical Lu Su was extremely charitable and constantly donated his assets to the poor in the time of extreme chaos (during the initial fall-out of Han Dynasty). He won the hearts of his citizens and it became his platform to rise to a state-level official.\n\n\"Alliance\" needs little mention as his venture into Shu Han was the seed that grew into the Shu Han Sun Wu alliance. However this ability seems to have an antagonistic nature rather than the cooperative nature in the true sense of the word. It sets up a win-lose scenario rather than win-win.\n\nAdditional info based on story:\n1. Most famous achievement - Bringing Shu Han and Sun Wu together to resist Cao Cao. This act led to the battle at Red Cliffs 赤壁之战 which crushed Cao Cao's army and changed the course of history. It is no exaggeration to say that if not for the alliance, Cao Cao would have defeated both Sun Wu and Shu Han, and all of history as we know it would be different.\n\n2. Cause of death - An illness took Lu Su's life at the age of 46. After Lu Su's death, the alliance between Sun Wu and Shu Han begin to crumble. Shortly after, Lu Meng 吕蒙 invaded Jing Zhou and executed Guan Yu 关羽. The death of Guan Yu precipitated into all-out war between Shu Han and Sun Wu, and thus the efforts of Lu Su vaporized.\n\nFAQ and Disambiguation\n\n1. If the number of cards is the same between two other players , does that mean Lu Su need not discard any cards to use his second ability ''Alliance''?\n\nAns: Yes he can simply ask the 2 players with the same number of cards to switch hands without needing to discard any cards.\n\n\n2. Can Lu Su discard equipped cards for the 2nd ability ''Alliance''?\n\nAns: Yes you can discard equipped cards to use ''Alliance''.\n\n\n3. When there is more than 1 player with the least cards , does Lu Su gets to choose who he gives his cards to when he uses his ''Altruism '' ability ?\n\nAns: Lu Su can choose whom to give the cards to if there are several with the least cards.\n\n\n4. For his ability ''Altruism'' , if he has 7 cards on hand , would he have to give 3 cards or 4 cards to the player with the least amount cards ?\n\nAns: Rounded DOWN to a whole number . So he would have to give 3.\n\n\n\n\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"líng-tǒng-凌统","name":"Líng Tǒng 凌统","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhZmh8XXBla8f1zvMyYxJW0r14_Ov_dawkUXFShxtpRnACtL-PtUe6ieXKOch0JRE80cU4pI35XfZQsk1JQVPK3XTBd2-xT6ItaMko7BhfIpUyL_5SU-H5TyR91KCub9qBK5cmk59hh2O3W/s320/lingtong.jpg","text":"\n\n\nTranslated Description:\nForthright and Courageous 豪情烈胆 (háo qíng liè dǎn)\n\nWho is he:\nHistorically, Ling Tong was one of the most important generals under Sun Quan 孙权's command. Yet in the semi-fictional ROTK story, Ling Tong was not given much airtime. Ling Tong was put in as high regard as Lu Meng 吕蒙 and Gan Ning 甘宁, and succeeded in numerous battles as well. He is also one of those that is well remembered for having saved Sun Quan's arse from certain defeat. In his latter days, Ling Tong not longer took to the frontlines, but instead became a successful strategist and advisor to Sun Quan.\n\nAn interesting side story is his grudge against Gan Ning. When Ling Tong was 15 years old, his father was killed by Gan Ning. At that time, Gan Ning had yet to cross over to Sun Ce's side and in an odd-twist of fate, Gan Ning fired a stray arrow that struck down Ling Tong's father. That grudge nearly boiled over later on as Ling Tong and Gan Ning took to swords to settle the score, but was mediated quickly by onlookers.\n\n[2011 Old version]\nCharacter ability: Tempest 旋风 (xuán fēng)\nWhenever a card is removed from your equipped items area, you can carry out either 1 of the following 2 options:\n\n1. Viewed as having used an ATTACK 杀 on any player (this ATTACK will not be considered in calculating the number of ATTACK card used per turn).\n\n2. Cause 1 unit of damage to a player within physical range of 1.\n\n[2012 New version]\nCharacter ability: Tempest 旋风 (xuán fēng)\nEach instance that you lose equipped cards, or you discard 2 or more cards in your discard phase, you can discard a total of 2 cards (one card at a time) from up to maximum of 2 players. \n\n\n(Note: Total of 2 cards means either discard 2 cards from 1 player, or 1 card each from 2 players.)\n\nAbility's relation to story:\nI'm going out on a limb on this one. Ling Tong's rescue of Sun Quan can be read in more detail under Additional Information, where the insanely heroic act of Ling Tong's forces was like a wild storm or hurricane that wreaked havoc on Zhang Liao 张辽's forces. However, that is a circumstantial link indeed, and does not make for a very good relation to the story.\n\nOn the other hand, the mechanics of this ability seems to be a wonderful link with Gan Ning's ability. Imagine Ling Tong paired in the same team with Gan Ning; it would be a nightmare for any opponent within distance of 1 from Ling Tong! However i'm not sure if the creator of this ability took the storyline between these two into consideration when creating it.\n\nAdditional Info based on story:\n1. Most famous achievement - Saving Sun Quan from certain death at Xiao Yao ford 逍遥津. Under a sudden attack by Zhang Liao 张辽, who had brilliantly cut off Sun Quan's escape route, Sun Quan was left with few troops to defend himself. Ling Tong rushed to the rescue with 300 of his closest soldiers and bought enough time for Sun Quan to escape. Ling Tong paid a very high price though. All 300 of his troops, which he regarded as close as family, were killed. Ling Tong himself suffered serious wounds but managed to escape by jumping into the water. He was later rescued by Sun Quan's boat, but Ling Tong was grief-stricken nonetheless.\n\n2. Cause of death - His age when he died is unclear. It was either 48 or 28 years old. Strange. The way in which he died is confirmed. He died of illness on his way back to Sun Quan's side after returning from a trip home. It was during that trip back to his hometown that he gained fame for his humility and respect for the everyday people, despite his great stature as a highly regarded statesperson.\n\nWiki Link:\nLing Tong Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"wú-guó-tài-(lady-wu)-吴国太","name":"Wú Guó Tài (Lady Wu) 吴国太","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAYraNNl4JbpU-3v1wYhffTpZ7YmlgOomFVrhsSuT1IdIkNPJj4v3PnR_TG-I6EVFxtUvHOj0ZVyE5ExQI32vflgAb-XVJidnrij6sIpCQTTlqFRiqmVFOizPxwt5OgRB1GlkRoNbQ71_x/s320/wuguotai.jpg","text":"\n\n\nTranslated Description:\nFearsome Militant Empress 武烈皇后 (wǔ liè huáng hoù)\n\nWho is she:\nThere are only a handful of elder women who are significant in the story (such as Xu Shu 徐庶's mum who hanged herself). Lady Wu is arguably the most notorious in the story because she turned the tables on her own son, Sun Quan 孙权, and gave this ruler of Wu Kingdom a massive headache! In the deadlock between the Kingdoms of Shu and Wu, one city was the epicenter of all the troubles: Jing Zhou 荆州.\n\nLiu Bei 刘备 \"borrowed\" the city from Sun Quan, but he turned renegade and chose not to return this strategically crucial city. Out of frustration, Sun Quan and his advisor, Zhou Yu 周瑜, decided to up the stakes and use the classic Maiden ploy 美人计. The bait? None other than Sun Quan's very own sister, Sun Shang Xiang 孙尚香. It was a wonderful plan except for one tiny oversight... nobody told Lady Wu that the future happiness of her only daughter would be sacrificed. To make matters worse, Lady Wu only heard about the news when Liu Bei was already in town to receive his bride. Imagine her horror when she received second-hand information from the streets that her daughter was to be wedded to the enemy, without her prior knowledge!\n\nBoy, was Sun Quan gonne be hurt reeeeeal bad.\n\nCharacter ability 1: Heavenly Essence 甘露 (gān lù)\nIn the action phase, you can choose 2 players to exchange all of their equipped cards. The difference in the number of equipped cards between the 2 players must not be more than X, where X is the amount of health you have lost thus far. Limited to once per turn.\n\nCharacter ability 2: Ameliorate 补益 (bǔ yì)\nWhen a player is at the brink of death, you can display one of the on-hand cards of that player. If that card is not a basic card, the player will discard that card and regain 1 unit of health.\n\n(Basic cards are ATTACK 杀 (any type), DODGE 闪, PEACH 桃, or WINE 酒)\n\nAbility's relation to story:\nThe abilities do not seem to follow the story much, though there are some interesting points to the ability names. The Chinese characters 甘露 have a few meanings, the most common refers to \"liquid essence\" and is used in poems. I chose this version because it sounds more royal and fitting for an Empress... in comparison to the other meanings. You see, 甘露 can also mean the leaf of a plant, similar to the banana plant, that is used in modern chinese desserts. We can choose to pervert the words 甘露 even further and think of them as an acronym of the 4 characters \"甘愿暴露\", which translates to \"willingly expose (the body)\".\n\nLogically speaking, \"willingly expose\" seems to denote some form of stripping, which would more accurately describe this ability, doesn't it?\n\nThe 2nd ability \"Ameliorate\" has very link to the story. Probably the only instance of Lady Wu offering any assistance was when she stopped Sun Quan from launching an all-out invasion of Jing Zhou, but only because her daughter was in that city. This ability does seem to be related to the game mechanics though. Since Sun Shang Xiang is has the ability to heal, therefore so should her mother?\n\nAdditional info based on story:\n1. Most famous achievement - Ironically, Lady Wu turned out to like Liu Bei quite a fair bit. Since the word was already out in the street that Liu Bei was to marry Sun Shang Xiang, Lady Wu could not possibly rubbish  it as a rumor. The only chance was to meet Liu Bei in person when he asks for Sun Shang Xiang's hand, and disapprove of him using her maternal rights. Yet Liu Bei was a righteous and honest leader (or so the story claims) and quickly won the approval of Lady Wu. In fact, she happily gave the marriage her blessing! This turned out to be a disaster for Sun Quan, because the ploy was to trick Liu Bei into entering the city and keep him under house-arrest indefinitely, without actually having to marry his sister to Liu Bei. Now as it turns out, not only will Liu Bei enjoy the royal treatment as a guest of Lady Wu's, he will actually be walking away with Sun Shang Xiang's hand in marriage!\n\n2. Cause of death - There is an anomaly in the story here that differs from history. In the story, there were 2 women who were married to Sun Jian 孙坚 (Lady Wu's husband). One was Lady Wu herself, and another was her younger sister. The story states that Sun Quan's mother was the elder Lady Wu, who died early and asked Sun Quan to treat her younger sister like his own mother. The younger sister gave birth to Sun Shang Xiang, thus making Sun Shang Xiang the half-sister of Sun Quan. However, none of these is true in history, as there was only one Lady Wu and both Sun Quan and Sun Shang Xiang have the same mother. There appears to be no mention of the cause of Lady Wu's death.\n\nWiki Link\nLady Wu Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"xú-shèng-徐盛","name":"Xú Shèng 徐盛","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiAQeu3dnL0VRyqjF7ztCYiJX001xiIEbd6Dr31TytE3ccia93_MMQCKDoF2ZilHt5YvS1-20-y8qP0S5qbWPTC0nNrIq-QEjr-_Sy7YYzBp9qBF9glSpAD-fE_HGoDXtPt4g5UyzEPpYRt/s320/xusheng.jpg","text":"\n\n\nTranslated Description:\nThe Steel Barricade of Jiang Dong 江东的铁壁 (jiāng dōng dè tiě bì)\n\n(Note: Jiang Dong is a region in the East of China. It literally translates to \"East of the river\")\n\nWho is he:\nAccomplished but complacent, Xu Sheng is a celebrated general under Sun Quan 孙权 that was born into a family of proud militants. In his time serving under Sun Quan, Xu Sheng was known for his courage and strong leadership that, more than once, overcame difficult situations. During his earlier years of service, he was able to defend his position from the warlord Huang She 黄射 while being outnumbered 5 to 1. Not only did he deal massive damage to Huang She's forces, Xu Sheng was able to charge out to engage in melee combat despite being grossly outnumbered... and still emerge overwhelmingly victorious! Xu Sheng then participated in numerous major battles against Cao Cao 曹操, Cao Pi 曹丕, and Liu Bei 刘备, and was victorious far more often than he was defeated.\n\nHowever, Xu Sheng was also known for his arrogance. In fact he considered himself born into status and refused to be put under the command of one other prominent Wu Kingdom general. This other general also appears in this game, and has far more battle scars than he has hair. Who is this other general? And why did Xu Sheng refuse to be put under his command? Read on the find out.\n\nCharacter ability: Annihilate 破军 (pò jūn)\nWhenever your ATTACK 杀 causes damage, you can force your victim to draw X cards from the deck (X being the number of health units the victim currently has. X has a maximum of 5), after which the victim must flip his or her character card over.\n\nAbility's relation to story:\n\"Annihilate\" is presumably related to Xu Sheng's complete decimation of Huang She's forces. In the story, the word 破 was used to describe Xu Sheng's victory over Huang She, where 破 means to tear or destroy and signifies the annihilation of the enemy. This ability ties in quite nicely, since the more the opponent is in peril, the stronger this ability becomes. It is the perfect tool to seal the fate of a struggling opponent.\n\nAdditional info related to story:\n1. Most famous achievement - Refusing to take orders from Zhou Tai. Due to Xu Sheng's heritage, he has always considered himself as upper-class. Thus when Sun Quan assigned Zhou Tai to be in command of Xu Sheng and his forces, Xu Sheng took that as an insult. To appease Xu Sheng, Sun Quan threw a banquet where Zhou Tai, Xu Sheng and other generals were present. During the banquet, Sun Quan asked Zhou Tai to show the numerous battle scars that he has sustained in his line of duty, and thus Xu Sheng's respect for Zhou Tai began to grow. It just so happens that Zhou Tai had also saved Xu Sheng from certain death by risking life and limb, charging into a horde of enemy soldiers and bringing Xu Sheng back to safety. Xu Sheng owes him!\n\n2. Cause of death - There is no exact year of his death, much less the circumstances causing it. It is only known that he died within a 7 year range between the year 222 AD and 229 AD.\n\nWiki Link:\nXu Sheng Wiki\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"zhāng-zhāo-&-zhāng-hóng-张昭&张纮","name":"Zhāng Zhāo & Zhāng Hóng 张昭&张纮","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhhkYDXmR3ivEG_qrjTV_M2Tj98AuznQ5EBL9sl_HnuOvEZp0dyvYMIbRPtm1sjV_98YestlY-RidFzqKXuG2L2dtcga7RxeglDVOHJKoOlxNvI6LH6F0oaaFK0_CkKenSTLxPpKfXsJ3N5/s320/zhangzhao.jpg","text":"\n\n\nTranslated description: \n\"Talents to administrate Heaven and Earth 经天纬地 (jīng tiān wěi dì)\"\n\nWho are they:\nScrawny and wind-worn with age. This is the constant stereotypical image of Chinese military advisers, and these two aging old men fit that stereotype perfectly... well, sort of. Though the images and portraits show Zhang Zhao and Zhang Hong as old geezers, the pair were already advisers to the Wu kingdom since they were much much younger. Collectively known as \"Er Zhang 二张\" or \"The Two Zhang's\", Zhang Zhao and Zhang Hong were first recruited by the the warlord, Sun Jian 孙坚, who was Sun Quan 孙权's father. The two Zhang's were approximately the same age as Sun Jian and will stay loyal to the Wu Kingdom for decades till their death. Tragically, the two Zhang's went through the deaths of both Sun Jian, and his elder son, Sun Ce 孙策. It was on Sun Ce's deathbed that he famously said to his little brother Sun Quan, \"Should [you] have doubts upon internal affairs, [you] must turn to Zhang Zhao; for outer matters [you] must consult Zhou Yu 周瑜.\" Sun Quan wisely employed the two Zhang's for the entire duration of his reign, and saw the Wu Kingdom rise to become one of the three crucial kingdoms of the era.\n\nCharacter ability 1: \"Blunt advice 直谏 (zhí jiàn)\"\nIn the action phase, you can put an on-hand equipment card in the equipped card area of another character (you cannot replace an equipment already equipped). If you do so, you can draw a card.\n\nCharacter ability 2: \"Stabilization 固政 (gù zhèng)\"\nAt the end of other players’ discard phase, you can return a card that was discarded in this phase to the player. If you do so, you can take the other cards discarded in this phase as your own on-hand cards.\n\nAbility's relation to story:\n\"Blunt advice\" refers to Zhang Zhao’s various advices to Sun Quan. As an official of Wu Kingdom, Zhang Zhao aided the young Sun Quan to administrate internal affairs while Zhou Yu managed external affairs. Wise but stubborn, Zhang Zhao criticized Sun Quan whenever he found the Sun Quan's decision incorrect. Although Zhang Zhao was often correct, his blunt attitude angered Sun Quan to the extent that Sun Quan once thought of killing him. Thankfully Sun Quan was able to cool down and took his advice, which always benefited the Wu Kingdom.\n\nThe ability mechanics seem to be play on the words \"Blunt\", and can be interpreted as being \"in your face\". That's how the ability works, by forcefully shoving weapons/armour/horses unto allies (or enemies when it is helpful). Not so much related to the story itself.\n\n\"Stabilization\" refers to Zhang Hong’s contribution to Wu Kingdom. Firstly, Zhang Hong made a plan for Sun Ce, advising him to defeat the warlords Yuan Shu 袁术 and Liu Biao 刘表 to obtain land for Wu Kingdom's survival. Secondly, after the death of Sun Ce, Cao Cao 曹操 intended to eliminate the Wu kingdom. It was Zhang Hong who utilized his diplomatic skills to stop Cao Cao, buying time for Sun Quan to cope with the internal issues of the state. Thirdly, Zhang Hong aided Sun Quan to consolidate his control in politics and in the military, even personally stopping Sun Quan’s reckless actions on the battlefield. Fourthly, he advised Sun Quan to set the capital of Wu Kingdom at Mo Ling 秣陵 (present day Nan Jing 南京), a strategic location which is most suitable to be held tightly. How does all this relate to picking up discarded cards and benefiting from it? I have no idea. Perhaps they simply needed any random name to affix unto this very cool ability?\n\nAdditional info based on story:\nMost famous achievement - Administration of Internal affairs of Wu Kingdom. There were many brilliant generals in Wu Kingdom, but few ministers existed. Sun Quan was too young to handle the internal affairs of the whole kingdom, and his impulsive actions jeopardized the safety of his realm. It was the two Zhangs who corrected his mistake and stabilized politics, allowing Wu Kingdom to prosper.\n\nCause of death - Natural causes. The two Zhangs died as old men, still faithful and loyal to the Sun family as they have been throughout their entire lives.\n\nWiki Link:\nZhang Zhao Wiki\nZhang Hong Wiki\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"sūn-cè-孙策","name":"Sūn Cè 孙策","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiURm2X8hsSn9PMX1xrEPqBLh24h9x7fi-YiN5-ESGBEWnmRgq-TnUofRlppWyF-srTqnMSi6XmN2dPUTvnhUtpdGckEFmGfOCDC9r4UZNTRsQuivp4HgpYQYz7tU68CMqvp0oPPp1uYSp1/s320/sunce.jpg","text":"\n\n\nTranslated description: \n\"The Young Conqueror of Jiang Dong 江东的小霸王 (jiāng dōng dè xiǎo bà wáng)\"\n\n(Note: 霸王 was the title of Xiang Yu 项羽, a military leader of the late-Qin dynasty known for his combat ability.)\n\nWho is he:\nEver heard the song \"18 and Life\" by the 80's rock band Skidrow? Losing his father, Sun Jian 孙坚, when he was only 16 years old, Sun Ce took over the reins of his father's militia and proclaimed himself their warlord. But unlike the misguided youth with a gun in \"18 and Life\", Sun Ce rose out of sorrow like a flaming phoenix and very quickly swept through South and Eastern China, conquering at a ferociously alarming rate! Within only 9 years, Sun Ce quickly became a force to be reckoned with, earning the respect (and warranted fear) of famed warlords such as Cao Cao 曹操 and Yuan Shu 袁术. To give you an idea of just how extraordinary were Sun Ce's achievements, we need only compare the age gap between Cao Cao and Sun Ce. When the two warlords first started discussing alliances, Cao Cao was a respectable 40 years old while Sun Ce was only 20 years old!! What was even more incredible was Sun Ce's ability to recruit and win the respect of extremely talented fighters, many of whom stayed loyal to the Wu Kingdom their entire lives. Some of the famed talents loyal to Sun Ce were Zhou Tai 周泰, Taishi Ci 太史慈, Zhang Zhao 张昭 and Zhang Hong 张纮.\n\nIndeed, had Sun Ce not died so young, history would be very different. However the circumstances surrounding his death were very peculiar. A mix of superstition, black magic, and perhaps an over-active imagination, Sun Ce was said to have died under the curse of one very infamous Taoist priest. Can you guess who?\n\n\nCharacter ability 1: \"Ardor 激昂 (jī áng)\"\nWhenever you use (or become the target of) DUEL 决斗 or a red-suited ATTACK 杀, you can draw a card.\n\nCharacter ability 2: \"Divine Aura 魂姿 (hún zī)\" [Awakening ability]\nAt the beginning of your turn, if your health is 1 unit, you must reduce your maximum health by 1 unit. You then permanently acquire the abilities \"Dashing Hero 英姿\" and \"Lingering Spirit 英魂\".\n\n(Note: \"Dashing Hero\" is Zhou Yu 周瑜's ability that allows him to draw 3 cards. \"Linering Spirit\" is Sun Jian's ability \"Draw X discard 1\" or \"Draw 1 discard X\".)\n\nCharacter ability 3: \"Hegemony 制霸 (zhì bà)\" [Ruler ability]\nDuring the action phase of other Wu characters, they can choose to “Points Duel” once with you. If they do not win the “Points Duel”, you can take the cards used in “Points Duel” from both parties. After your Awakening ability activates, you can refuse the \"Points Duel\".\n\nAbility's relation to story:\nThis is another one of those abilities that simply borrowed a title to label the mechanics. \"Ardor\" refers to Sun Ce’s combat ability, and he was a mighty warrior who led from the frontlines and clashed swords with many generals. He just LOVED to battle. One of those opponents was Taishi Ci, and the duel between the two resulted in a stalemate. But relevance of the title aside, what does having \"red\" attack got to do with his love for fighting? Maybe red is the colour of passion? Hmm.\n\nThe Chinese characters for \"Divine Aura 魂姿\" is a combination of \"英魂\" and \"英姿\", Sun Jian’s and Zhou Yu's abilities respectively. The character's creator noted that the enlightenment from his father and assistance from Zhou Yu were essential to Sun Ce’s success. The phrase literally translates to “Spiritual Presence”, but it sounds a little too religiously influenced.\n\n\"Hegemony\" relates to Sun Ce’s leadership ability. Not only did he defeat his enemies, he also won them over with his charisma. The game mechanics allows other Wu characters (some are former enemies like Taishi Ci and Gan Ning) to challenge Sun Ce as initiating a \"Points Duel\". This plays into Sun Ce's love for dueling. Also, if Sun Ce wins or draws the \"Points Duel\", Sun Ce will literally \"win their support\".\n\nAdditional info based on story:\n1. Most famous achievement - Laying the foundations of the Wu Kingdom at breakneck speed. Sun Ce started his military career from the town of Dan Yang 丹杨 with barely 100 soldiers, but at the time of his death, he had already expanded his territorial claim well into a neighboring province and multiplied his armed forces. The ultimate benefactor of this strong growth was Sun Quan 孙权, that managed to keep the kingdom expanding though at a more conservative pace.\n\n2. Cause of death - Sun Ce had his detractors, one of which was Xu Gong 许贡, a disloyal and disgruntled officer that was forced to surrender to Sun Ce. After Sun Ce executed Xu Gong, three loyal followers of Xu Gong ambushed Sun Ce during his solo hunting trip and managed to pierce an arrow through Sun Ce's cheeks. In the ROTK story, Sun Ce recovered from the wound, but succumbed to the curse of Yu Ji 于吉 and began to hallucinate. The ghostly apparition of Yu Ji haunted Sun Ce wherever he went, till he tore open his wound in frustration and there was no recovering from there. However historically, it is unlikely that any ghost or superstition had to do with his death. Some accounts wrote that Sun Ce died the very night he received the arrow wound.\n\nWiki Link:\nSun Ce Wiki\n\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"bù-liànshī-步练师","name":"Bù Liànshī 步练师","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgQIIdYzsGfj0KyiDVuobffAyBZN6ODb93jW8DgDYceWZNKwoM7W_tsrTEBgb99PVXwZ_Lu6S7_t002Gx-wKNqSuGTGnmxfhdy6T-m2dRCP1lg2T6MGd8IDxl_KbEdOL3fPvXCn3x0R-XtN/s320/bulianshi.png","text":"\n\n\nTranslated Description:\n\"The Uncrowned Empress 无冕之后 (wú miǎn zhī hoù)\"\n\nWho is she:\nNever heard of her. Lady Bu, as she was known to her subjects, had practically no air-time in the story. However Lady Bu was immensely important to Sun Quan 孙权. Struck by her beauty, Sun Quan made her his concubine, and she quickly became his favorite. Thanks to her personality and respect for those around her, she quickly won the favour of the the palace. In fact they started addressing her obliquely as \"Empress\". Sun Quan himself wanted to make her his Empress when he declared himself Emperor of Wu, however he did not do so because his court and advisors preferred someone else as Empress for political reasons. Neither lady became Empress in their lifetimes, but Sun Quan posthumously made Lady Bu the Empress of Wu after her death. Perhaps that was the only way both factions could have been satisfied.\n\nCharacter ability 1: Pacify 安恤 (ān xù)\nIn the action phase, you can choose 2 players (other than yourself) with different number of on-hand cards. The player with less on-hand cards will acquire 1 card from the other player, and display it to all players. If that card is not the suit of Spades, you can draw 1 card from the deck. Limited to once per turn.\n\nCharacter ability 2: In Loving Memory 追忆 (zhuī yì)\nWhen you die, you can choose one player (other than yourself and the player who killed you) to draw 3 cards and regain 1 unit of health.\n\nAbility's relation to story:\nBoth “Pacify” and “In Loving Memory” comes from the imagination of the designer. “Pacificy” was used to depict that Bu Lianshi did her best to pacify the emotion of an aging Sun Quan (Sun Quan became insane in his later life). This ability weakens the powerful to strengthen the weak. Also, if that card is not spades-suit (which represents malignant intentions), she would receive a reward by drawing one more card. This ability is so powerful that it makes Bu Lianshi one of the most hunted-down characters. As a running joke, she is especially good at weakening Sun Quan, who tends to keep a lot of on-hand cards for using “Balance of Power”, so she is one of the best rebels when Sun Quan is the ruler.\n\n\n“In Loving Memory” refers to the fact that she was posthumously titled by Sun Quan, so the designer imagined that Sun Quan missed her. It allows Bu Lianshi to protect her love after her death.\n\nHow to obtain this card:\nBu Lianshi is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"hàn-dāng-韩当","name":"Hàn Dāng 韩当","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjgW41xCph6e4_EfN7VFPBwJ1BVFXiqmDo01ORiZ6RvPFawg0RGptIV4ySn2KMWeoQuKIeRWZrASgowL4-GaXNuuRzcinn0UFlcnjl7Vvy6IUoUSwVR6rXjEJXH0TUQdNzYCyas67TobTtH/s320/handang.jpg","text":"\n\n\nTranslated Description\n“Marquis of Shi Cheng 石城侯 (shí chéng hoù)\"\n\nWho is he:\nYet another old-timer with decades of frontline experience, Han Dang served 3 \"generations\" of Wu leaders (technically speaking, its 2 generations since Sun Ce 孙策 and Sun Quan 孙权 were brothers, but you get the idea). From the earliest days of Sun Jian 孙坚, Han Dang was always the vanguard but never the commander. A loyal, capable and trusted servant, he practically put his entire life in the service of Wu Kingdom. He even took part in the battle of Red Cliffs as the person who rescued the renegade defector Huang Gai 黄盖. Alas, his glory would be tainted, then contaminated by the acts of his son, Han Zong 韩综, who was so hated by Sun Quan that he was hunted down, beheaded, and presented at Sun Quan's tomb.\n\nCharacter Ability 1: Mounted Archer 弓骑 (gōng jì)\nYou can use or play one equipment card as an ATTACK 杀 card. The ATTACK used via this ability has no distance limitations.\n\nCharacter Ability 2: Resolver of Troubles解烦 (jiě fán)\nWhen any player is at the brink of death, you can use an ATTACK on the player whose turn it currently is. If this ATTACK causes damage, you prevent the damage and is instead viewed as having used PEACH 桃 on the player at the brink of death.\n\nAbility's relation to story:\nHan Dang was diligent and respected his subordinates. He was known for his talent of mounted archery, which was odd for people living in Southern China, who could not obtained horses as easily as people living in Northern China, which gives rise of the ability “Mounted Archer”.\n\n\n“Resolver of Troubles” came from the name of his \"Trouble-solving troops 解烦卒\", the elite troops of Wu led by Han Dang himself. The mechanism referred to his frequent rescue of other Wu generals. He was partner of Zhou Tai 周泰, and it was Sun Quan who promoted him. In fiction, he saved Huang Gai in Red Cliffs. The ability allows Han Dang to save others by attacking the source of damage. However, betrayed by its name, this ability is extremely troublesome. What happens if this ATTACK deals damage and Han Dang does not prevent it, letting the source of damage enters the Brink of Death? If Han Dang attacks Xiahou Dun 夏侯惇 or Fa Zheng 法正, and receives damage/loses health and enters Brink of Death? If Han Dang attacks Zhang Jiao 张角 and Zhang Jiao activates his ability? This ability is extremely troublesome…\n\nI suspect that the mechanics in \"Resolver of Troubles\" is such that the damage MUST be prevented. At least that is how I interpreted it because there is no mentioned of \"choice\" in preventing the damage in the ability. \"此【杀】造成伤害时，你防止此伤害\" As you can see the option of choice, typically in the use of the words \"可以\", is missing.\n\nHow to obtain this character:\nHan Dang is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"chéng-pǔ-程普","name":"Chéng Pǔ 程普","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2_oGzK7LY6cRvr-adE8NdqkK_GQzex9LIp6oGK5K6vobzwAGnO4y4LRUtV0-4-p0WRZRGjF41AeUYZTWlEZmHap9cnM_-QZ6yZAVF_OWgC20TsbokoTmJ0icjKEo0rD-FJZ4k9iFVXtOS/s320/chengpu.png","text":"\n\n\nTranslated Description:\n\"Minister spanning 3 Generations 三朝之臣 (sān cháo zhī chén)\"\n\nWho is he:\nIt is Wu kingdom's great fortune to have so many capable and single-mindedly loyal talents aiding the Sun family in their must difficult times. Similar to Han Dang 韩当, Cheng Pu was recruited in the days of Sun Jian 孙坚, and he fought alongside Sun Jian's children till his death. If you are familiar with the ROTK story in the early period, Sun Jian was one of the first to arrive in the captial Luo Yang 洛阳 after forcing Dong Zhuo 董卓 to retreat. It was then that Cheng Pu found the imperial seal in a well. This seal turned out to be the drop of blood that drew the sharks, where Sun Jian was ultimately killed because he had planned to use the seal to wrestle power for himself.\n\nYears later, Cheng Pu served under both Sun Ce 孙策 and Sun Quan 孙权, and was one of the key figures alongside Zhou Yu 周瑜 during the epic battle at Red Cliffs. However his death was incredibly ironic. In a bout of ruthlessness, Cheng Pu decided to burn over one hundred betrayers alive. The smoke and fumes that rose up from the burning bodies poisoned him and he died soon after. Woah!\n\nCharacter Ability 1: Toxic Pyre 疠火 (lì huǒ)\nYou can use 1 normal ATTACK 杀 as FIRE ATTACK 火杀. If this FIRE ATTACK causes damage, you lose 1 unit of health after all damage calculations has been concluded. When you use FIRE ATTACK, you can select 1 additional target player.\n\nCharacter Ability 2: Superior Vintage 醇醪 (chún láo)\nWhen the ending phase of your turn begins, if there are no cards on your character card, you can place any number of ATTACK cards on your character card (these cards are referred to as \"VINTAGE\"). When a player is on the brink on death, you can discard a VINTAGE card and this is viewed as the player having used WINE 酒.\n\nAbility's relation to story:\nCheng Pu died after he burnt the corpses of hundreds of rebellious Wu troops. It was said that toxic smoke killed him. \"Toxic Pyre\" refers to his reason of death. The ability allows him to burn multiple enemies by fire, especially powerful with IRON SHACKLES 铁锁链环 (Cheng Pu also participated in the Battle of Red Cliffs). If you deal damage by converted ATTACKs, you would inhale the toxic smoke and lose one unit of health.\n\n\"Superior Vintage\" refers to the relationship between Zhou Yu and him. It comes from the sentence \"与公瑾交,若饮醇醪,不觉自醉: To socialize with Zhou Yu is like drinking wine of the most superior vintage - I feel inebriated (by his talents) without realizing it\". This ability is very odd. It allows Cheng Pu to heal others by converting his ATTACK to WINE. It clashes with \"Toxic Pyre\" as they both consume ATTACK cards. Also, why does Cheng Pu have such ability? \"Superior Vintage\" is used to praise Zhou Yu, not Cheng Pu himself. Perhaps it wants to show Cheng Pu abandoning his hatred (ATTACK) and gain friendship (WINE that can only be used to save people)?\n\n How to obtain this character:\nCheng Pu is available in the 2012 release of OverKnight Fame, otherwise known as OKF2012 (一将成名2012). Click here to purchase now!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"lǖ-méng-吕蒙-(*sp006)","name":"Lǖ Méng 吕蒙 (*SP006)","faction":"wu","imageUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj23oNZ2wM0prrDawd5TLY3dsuTkcfW1J-yAG6WHkR4mSYFufYqd6i1xOcH97zavD04QkNMnw633AztwZ8a6Ho9KTISrGw8p7qh978G_8uzP6lRFNqmxLaWAdIeF5KN5lFbOuO3p0AgC7SZ/s320/sp006lvmeng.jpg","text":"\n\n\nTranslated Description:\n\"The Charisma of Ministers 国士之风 (guó shì zhī fēng)\"\n\nWho is he:\nAdmit it, you can't stand it when another player uses the original Lu Meng, especially when he is sitted right next to you. That hoard of cards is always a danger, and you can never really tell who's side he's on.\n\nYou are probably hoping that in this revamped version, that irritating ability to store infinite on-hand cards in removed. But hell no!! They just made him even more insanely powerful. I mean, this guy just makes Demi-God Lu Meng seem as dangerous as Grover from Sesame Street! How does one spell IMBA?\n\nCharacter ability 1: \"Taunt the Tiger 探虎\"\nDuring the action phase,  you can conduct Points Duel with another player. If you win, you acquire the following abilities till the end of your turn.\n\n1. Your distance from that player is 1.\n\n2. Non-Time Delay Tool cards used on that player cannot be neutralized by NEGATE 无懈可击.\n\nLimited to once per phase.\n\n\nCharacter ability 2: \"Strategic Judgement 谋断\" [Transformation ability]\nUnder normal circumstances, your token should have \"Warrior 武\" facing up and you possess the abilities \"Ardor 激昂\" and \"Humility 谦逊\".\n\nWhen your number of on-hand cards is 2 or less, you must flip your token over such that \"Strategist 文\" is facing up, and change those 2 abilities into \"Dashing Hero 英姿\" and \"Self Mastery 克己\". You can flip the token over by discarding a card before the start of any player's turn.\n\n(Note:\nHumility 谦逊 (qiān xùn) (Lu Xun 陆逊's ability)\nYou cannot become the target of STEAL 顺手牵羊 and ACEDIA 乐不思蜀.\n\nArdor 激昂 (jī áng) (Sun Ce 孙策's ability)\nWhenever you use (or become the target of) DUEL 决斗 or a red-suited ATTACK 杀, you can draw a card.)\n\nDashing Hero 英姿 (yīng zī) (Zhou Yu 周瑜's ability)\nYou can draw 1 additional card during your drawing phase.\n\nSelf-Mastery 克己 (kè jǐ) (Lu Meng's ability)\nIf you do not use any ATTACK 杀 cards during your action phase, you can skip the discard phase.)\n\nAbility's relation to story:\n“Taunt the Tiger” comes from Lu Meng’s bravery and aspiration to challenge difficulties. In his younger age (15-16 years old), he followed his brother-in-law secretly to fight the bandits. His mother was enraged and scolded him, and he replied, “It is difficult to survive in poverty; if we can prove ourselves through hard work, then wealth would come eventually. How can we get the tiger's cub if we don't enter the tiger's den?\". In his older age, he challenged Guan Yu 关羽, one of the Tiger Generals of Shu. In the game, he can “Agitate the Tiger” in both his Warrior and Strategist form. If he wins, he can approach his enemy, and he can use his ploy without being negated.\n\n“Strategic Judgement” can be split into two parts: 谋 (plotting schemes) and 断(make a judgement). It is said that capable rulers, generals and strategists must be good at both plotting schemes and making decisions. (Yuan Shao 袁绍 and Liu Biao 刘表 were said to be good at plotting schemes with their strategists, but were poor at making decisions). I translate is as “Strategic Judgement”, suiting the literal meaning and the essence of this ability: decide your “form” strategically to maximize your gain.\n\nIn his Warrior form, he gets “Ardor” and “Humility”. His Warrior form shows his younger life, a reckless warrior who fights bravely in the front line and is humble to Sun Quan 孙权's word to learn more. Both his abilities bolster his defense outside turn. In his Strategist form, he gets “Dashing Hero” and “Self-Mastery”. This shows his later life, a well-respected general who restrains himself from hasty actions, waiting to strike at the right moment. He can fill up his cards easily and store them without discarding.\n\n\nHow to obtain this character:\nClick here to purchase this character from Sino-Games.com!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"},{"id":"dà-qiáo-大乔-(*sp008)","name":"Dà Qiáo 大乔 (*SP008)","faction":"wu","imageUrl":"http://sanguoshaenglish.files.wordpress.com/2012/08/spdaqiao.png","text":"\n\n\nTranslated Description:\n\"Transient but Joyous Happiness 韶光易逝 (sháo guāng yì shì)\"\n\nWho is she:\nI don't know about you, but I absolutely hate seeing the original Da Qiao character. No no no, it's not because her ability wasn't good, but quite the contrary. Da Qiao had fantastic ability! Her ability to put everyone else to sleep with ACEDIA 乐不思蜀 was incredibly useful, and frustrating when she's not on your side. THAT is why I hate her, because I seldom ever choose her and she's seldom helping my side!\n\nIn this revamped SP version, the character seems less overpowered than the preceding characters. Her new abilities also mirror some of her old abilities, so it's not a complete overhaul either. It does appear that this SP Da Qiao is rather interesting from the face of it.\n\nCharacter ability 1: \"Gentle Smile 言笑 (yán xiào)\"\nDuring the action phase, you can place a card with suit of Diamonds in the judgement area of any player. Players with \"Gentle Smile\" in their judgement area gets to keep all the judgement cards during that player's judgement phase.\n\nCharacter ability 2: \"Quiet Elegance 安娴 (ān xián)\"\nWhenever you cause damage when you use an ATTACK 杀, you can prevent that damage and force the victim to discard 1 on-hand card, after which you draw 1 card from the deck.\n\nWhenever you become the target of an ATTACK, you can discard 1 on-hand card to render the ATTACK useless, after which your attacker draws 1 card from the deck.\n\nAbility relation to story:\nYou guessed it, none.\n\nLook, we know Da Qiao is beautiful, elegant, and probably has a smile that could have melt the iceberg that sank the Titanic. How that translates into letting others keep judgement cards is a stretch... a long stretch. But hey, the abilities do seem balanced and is not aggro, so i'm pretty happy to ignore the fact that the ability isn't linked much to the story.\n\nHow to obtain this character:\nClick here to purchase this character from Sino-Games.com!\n\n\nEmail ThisBlogThis!Share to XShare to FacebookShare to Pinterest\n\n\n\n\n"}]